{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/zd1owgoWgiPSVBXDnaSvS4D6RN9.jpg",
  "id": 11153,
  "title": "National Lampoon's Vacation",
  "poster_path": "https://image.tmdb.org/t/p/w500/q3DvoqY06yZnRp9faH6uge7n7VP.jpg",
  "release_date": "1983-07-29",
  "vote_average": 7.115,
  "vote_count": 1430,
  "popularity": 46.301,
  "overview": "Clark Griswold is on a quest to take his family to the Walley World theme park for a vacation, but things don't go exactly as planned.",
  "imdb_id": "tt0085995",
  "budget": 15000000,
  "homepage": "",
  "revenue": 61400000,
  "runtime": 99,
  "tagline": "Every summer Chevy Chase takes his family on a little trip. This year he went too far.",
  "genres": [
    "Comedy",
    "Adventure"
  ],
  "production_companies": [
    "Warner Bros. Pictures"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Chevy Chase",
        "character": "Clark Griswold"
      },
      {
        "name": "Beverly D'Angelo",
        "character": "Ellen Griswold"
      },
      {
        "name": "Anthony Michael Hall",
        "character": "Rusty Griswold"
      },
      {
        "name": "Imogene Coca",
        "character": "Aunt Edna"
      },
      {
        "name": "Randy Quaid",
        "character": "Cousin Eddie"
      },
      {
        "name": "Dana Barron",
        "character": "Audrey Griswold"
      },
      {
        "name": "Eddie Bracken",
        "character": "Roy Walley"
      },
      {
        "name": "Brian Doyle-Murray",
        "character": "Kamp Komfort Clerk"
      },
      {
        "name": "Miriam Flynn",
        "character": "Cousin Catherine"
      },
      {
        "name": "James Keach",
        "character": "Motorcycle Cop"
      },
      {
        "name": "Eugene Levy",
        "character": "Car Salesman"
      },
      {
        "name": "Frank McRae",
        "character": "Grover"
      },
      {
        "name": "John Candy",
        "character": "Lasky, Guard at Walleyworld"
      },
      {
        "name": "Christie Brinkley",
        "character": "Girl In The Red Ferrari"
      },
      {
        "name": "Jane Krakowski",
        "character": "Cousin Vicki"
      },
      {
        "name": "John P. Navin, Jr.",
        "character": "Cousin Dale"
      },
      {
        "name": "Nathan Cook",
        "character": "Man Giving Directions"
      },
      {
        "name": "Christopher Jackson",
        "character": "Pimp"
      },
      {
        "name": "Mickey Jones",
        "character": "Mechanic"
      },
      {
        "name": "John Diehl",
        "character": "Assistant Mechanic"
      },
      {
        "name": "Jeannie Dimter Barton",
        "character": "Dodge City Cashier"
      },
      {
        "name": "Randy Lowell",
        "character": "Wyatt Earp"
      },
      {
        "name": "Virgil Wyaco II",
        "character": "Indian"
      },
      {
        "name": "Gerry Black",
        "character": "Davenport"
      },
      {
        "name": "James Staley",
        "character": "Motel Desk Clerk"
      },
      {
        "name": "Adelaide Wilder",
        "character": "Car Hop"
      },
      {
        "name": "Tessa Richarde",
        "character": "Motel Guest"
      },
      {
        "name": "Fritz Ford",
        "character": "Neighbor"
      },
      {
        "name": "Eric Stacey",
        "character": "Neighbor"
      },
      {
        "name": "Scott Perry",
        "character": "Swat Leader"
      },
      {
        "name": "Dennis Freeman",
        "character": "Policeman"
      },
      {
        "name": "Michael Talbott",
        "character": "Cowboy"
      },
      {
        "name": "John Craigmile",
        "character": "Camel Rider"
      },
      {
        "name": "Henry Gibson",
        "character": "Hotel clerk (uncredited)"
      },
      {
        "name": "Harold Ramis",
        "character": "Car salesman (voice) (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Sam Mercer",
        "department": "Production",
        "job": "Location Manager"
      },
      {
        "name": "Phyllis Huffman",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Bub Asman",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Harold Ramis",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Pembroke J. Herring",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Jack T. Collis",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "David R. Ellis",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Jophery C. Brown",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "John Hughes",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Susan Arnold",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Victor J. Kemper",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Joe D. Mitchell",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Frank Griffin",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Wayne Fitzgerald",
        "department": "Art",
        "job": "Title Designer"
      },
      {
        "name": "Robert M. Stevens",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Glenn R. Wilder",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Matty Simmons",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Ralph Burns",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Martin Raymond Bolger",
        "department": "Sound",
        "job": "Sound Mixer"
      },
      {
        "name": "Lindsey Buckingham",
        "department": "Sound",
        "job": "Songs"
      },
      {
        "name": "Lindsey Buckingham",
        "department": "Sound",
        "job": "Vocals"
      },
      {
        "name": "Alan Greedy",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Robert J. Visciglia Sr.",
        "department": "Art",
        "job": "Property Master"
      },
      {
        "name": "Tony Epper",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Dick Ziker",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Dick Ziker",
        "department": "Directing",
        "job": "Second Unit Director"
      },
      {
        "name": "John M. Woodward",
        "department": "Crew",
        "job": "Transportation Coordinator"
      },
      {
        "name": "Paul Vombrack",
        "department": "Camera",
        "job": "Second Unit Director of Photography"
      },
      {
        "name": "Tim Board",
        "department": "Editing",
        "job": "Assistant Editor"
      },
      {
        "name": "Adele Taylor",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Alan Robert Murray",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Earl Gilbert",
        "department": "Lighting",
        "job": "Gaffer"
      },
      {
        "name": "Robert G. Henderson",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Elliott Marks",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Eugene Marks",
        "department": "Sound",
        "job": "Music Editor"
      },
      {
        "name": "Kevin Jewison",
        "department": "Camera",
        "job": "Second Assistant Camera"
      },
      {
        "name": "Hal Whitby",
        "department": "Sound",
        "job": "Boom Operator"
      },
      {
        "name": "Caryl Wickman",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "Robert P. Cohen",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Robert Grand",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Robert Grand",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Patrick Marshall",
        "department": "Lighting",
        "job": "Rigging Gaffer"
      },
      {
        "name": "Earl Clark",
        "department": "Camera",
        "job": "Assistant Camera"
      },
      {
        "name": "Donah Bassett",
        "department": "Editing",
        "job": "Negative Cutter"
      },
      {
        "name": "Bernie Schwartz",
        "department": "Camera",
        "job": "Dolly Grip"
      },
      {
        "name": "Brooke Henderson Ward",
        "department": "Sound",
        "job": "Assistant Sound Editor"
      },
      {
        "name": "Richard J. Bayard",
        "department": "Art",
        "job": "Construction Coordinator"
      },
      {
        "name": "Gaylin P. Schultz",
        "department": "Camera",
        "job": "Key Grip"
      },
      {
        "name": "Rhio Haessig",
        "department": "Lighting",
        "job": "Best Boy Electric"
      },
      {
        "name": "Karen Holley",
        "department": "Art",
        "job": "Leadman"
      },
      {
        "name": "Carl Barth",
        "department": "Directing",
        "job": "Second Unit Director"
      },
      {
        "name": "Ross Brown",
        "department": "Directing",
        "job": "Second Assistant Director"
      },
      {
        "name": "Sonny Van Hecke",
        "department": "Art",
        "job": "Assistant Property Master"
      }
    ]
  },
  "keywords": [
    "relatives",
    "road trip",
    "domestic life",
    "family vacation",
    "family holiday",
    "theme park",
    "duringcreditsstinger"
  ],
  "mpaa": "R",
  "summaries": [
    "The Griswold family's cross-country drive to the Walley World theme park proves to be much more arduous than they ever anticipated.",
    "Having it all planned down to the last detail, well-meaning American paterfamilias Clark Griswold and his supportive wife Ellen take their two teenagers, Rusty and Audrey, on a cross-country trip from the suburbs of Chicago all the way to sunny California's Walley World amusement park. However, anything that could go wrong does, and before long Ellen's cousin Catherine and her husband Eddie enter the picture and Clark is on the verge of blowing a gasket. Roy Walley's wonderful park seems farther and farther away, and although the prospect of a clandestine meeting with the alluring blonde in the fast 1981 Ferrari 308 GTSi sounds tempting, Clark must do the right thing and find the promised land. How hard can it be to have the perfect vacation?—Nick Riganas",
    "The Griswold family--father Clark W., wife Ellen, daughter Audrey, and son Rusty--set out in high spirits to spend their vacation driving cross-country from Chicago to the glorious Walley World on the West Coast. The trip which Clark planned down to the minute slowly loses its smoothness from the moment the first grain of sand gets in. A meeting with constantly-in-debt, simple-minded cousin Eddie results in the Griswold family giving cantankerous Aunt Edna a lift to Phoenix. Of course, the Griswolds receive one strike of bad luck after another. But Clark promised his beloved family the best vacation ever.—Julian Reischl <julianreischl@mac.com>",
    "Follows the Griswold family--Clark, Ellen, Rusty, and Audrey--as they venture westward from the suburbs of Chicago to the Disneyland-like theme park Walley World. Clark has planned the trip down the last detail, including seeing the world's largest ball of twine. However, Clark's pursuit of adventure is matched by his dimwitted bumbling, leading to a vacation his family will not soon forget.—Rick Gregory <rag.apa@email.apa.org>"
  ],
  "synopsis": "Clark Griswold (Chevy Chase) is a food processing salesman living in Chicago, Illinois who wants to spend more time with wife Ellen (Beverly D'Angelo) and his teen children Rusty (Anthony Michael Hall) and Audrey (Dana Barron). So, he decides to lead the family on a cross-country expedition from Chicago to the Los Angeles amusement park, \"Walley World\", billed as \"America's Favorite Family Fun Park\". In the opening scene, Clark and Rusty drive to a local car dealer lot where he decides to purchase a new sports wagon for the cross-country drive. But the conniving salesman Ed (Eugene Levy), tells him that the car he ordered never arrived and scams Clark into taking in its place a more gas-guzzling, technically failing, behemoth station wagon called the Wagon Queen Family Truckster. Clark refuses to be conned, but after his old station wagon is \"accidentally\" crushed by a compacter machine, Clark is left with no choice but to take the Family Truckster.At home, although Ellen tells Clark that she wants to fly to California for their two-week vacation, he insists on driving, so he can bond with his family. The next day, the family packs into their new car for the long drive to California, only to have all their luggage strapped to the top of the station wagon fall off after they back out of the garage... a bad omen of things to come.During the first day's drive, Clark and Ellen try to ease the boredom by singing old folk songs including the so-called Wally World National Anthem. Rusty and Audrey take their escape by listening to their radio Walkman's of their favorite rock group The Ramones. While stopping for gas, Clark cannot find the gas tank opening, and accidentally tears off the station wagon's license plate searching for it.Later that same day, the family arrives in St. Louis, Missouri, but after crossing the Mississippi River into the city, they get lost and end up in a rough ghetto area where some local street hoodlums steal their hubcaps and spray paint graffiti on one side of their car while giving them sham directions back to the local expressway.While driving late at night on the interstate west of St. Louis, all of the family falls asleep... including Clark driving in which their car exits the road and roars through a residential neighborhood, tearing up several yards, before stopping for the night at a local motel.Clark has planned a romantic evening at the motel with Ellen with wine and quarters for the vibrating mattress, but the mattress is loud and starts bouncing wildly. Clark pulls blankets onto the floor and they crawl under the covers, ready for sex. The kids rush in from the connecting room to investigate the noise. Rusty unplugs the bed before the kids go back to their room.On the second day of the vacation (Day 2), the family arrives in Dodge City, Kansas without further incident where Clark falls victim to another tourist trap when he insults the local bartender at a Western-themed tavern, and gets shot with a round of blanks. Back on the road, Clark is tempted by a hot young woman (Christie Brinkley) driving a flashy red 1983 Ferrari 308 GTS, with a California license place that reads LUV ME.That afternoon, the Griswolds arrive at a farm outside of Coolidge, Kansas to visit Ellen's cousin Catherine (Miriam Flynn) and her eccentric husband Eddie Johnston (Randy Quaid), and their five kids, plus one on the way, creating more tension among the Griswolds. Catherine and Eddie foist crotchety old Aunt Edna (Imogene Coca) and her vicious dog, Dinky, on the Griswolds, asking them to drop her off at her son Normy's home in Phoenix, Arizona. Eddie also asks for a loan of $500 to help him out with numerous debits he owns the local bank and many bill collectors. The kids have better experiences with Eddie and Catherine's eldest kids. Cousin Vicki (Jane Krakowski) shows Audrey her secret pot stash, while Cousin Dale (John Navin) shows Rusty his secret porn magazine collection.The next day (Day 3), the Griswolds along with Aunt Edna and Dinky drive off. During a picnic stop in Colorado, Clark has another encounter with the young woman in the red Ferrari whom is parked and dancing to pop music. The Griswolds stop for the night in a run-down campground in South Fork, Colorado where they survive another tourist trap for the night as well as deal with Edna's vicious dog.The next day (Day 4), the Griswalds and Aunt Edna pack up and leave the campground for Arizona. But while packing the car, Clark forgets to untie the nasty Dinky from the car's rear bumper before leaving. Clark does not realize his error until he is pulled over by a local motorcycle cop (James Keach) to angrily inform him of his mistake that has led to the apparent death of the dog. Never less, the policeman, overcome by his own memory of his childhood dog, allows Clark to proceed on his way. During the drive, Clark again sees the young woman driving the red Ferrari while everyone else is asleep. Tempted to keep speed with her, Clark accelerates & almost has an accident. Subsequently, one of the suitcases falls off the car, which contains all of Ellen's credit cards.The next day (Day 5), the family gets lost on a back road somewhere in Arizona where while Clark and Ellen argue, they accidentally drive off the road, missing a large roadblock and get into an accident, damaging the Wagon Queen Family Truckster. Clark hikes off into the desert and spends many hours wondering aimlessly in the hot and arid desert until he finds a gas station... only to find the family there after they were rescued by some local Indians whom had a camel to tow their car to the very station. After making some half-hearted repairs, the redneck mechanic (Mickey Jones), who also happens to be the local sheriff, scams Clark out of all the money he has on him (over $500 for the repairs). But they manage to get to the Grand Canyon Village to check in for the night.The next day (Day 6), the frustrated Clark realizes that in reporting Ellen's lost credit cards to their hometown bank, the bank had frozen Clark's credit cards by accident, and Clark cannot convince the stuffy hotel clerk to take a check to pay for their rooms for the night. With the desk clerk distracted for a few minutes, Clark steals all the cash in the hotel's cash register, leaves behind the $1,000 check, and flees the hotel like a Wild West bank robber, grabs the family away from the scenic sight of the Grand Canyon, and speeds away.Continuing through Arizona, they find that Aunt Edna passed away in her sleep. With little options, they decide to drive to Phoenix anyway and deliver her to her son Normy's house (with the dead Aunt Edna tied to the roof of their car). When they reach Normy's home that evening in a raging thunderstorm, they discover he is out of town, and leave Edna's rigor mortised body on a lawn chair in the backyard, over Ellen's objections. Clark concedes to Ellen's request they say a prayer for the dear departed Edna.Despite all the events and the begging of Ellen and the kids, Clark is more determined than ever to get to Walley World. They check into a motel for the night where after another argument with Ellen, Clark hangs out at the motel's bar where he has a face-to-face-encounter with the beautiful young woman from the red Ferrari and they make small talk about things. The woman beckons Clark to go skinny dipping with her in the motel's swimming pool, but upon diving in, Clark screams over his reaction to the cold pool water... thus waking up the entire motel, including Ellen, Rusty, and Audrey. When the woman takes her leave, Clark goes back to apologize to Ellen who demands that Clark repay the favor by taking him back to the pool to skinny dip with her.The next day (Day 7), the family finally arrives in Los Angeles, California and arrives at Wally World... only to find that the park is closed for the next two weeks for repairs. Clark, slipping into madness seeing all the week's struggles had been for nothing, buys a realistic-looking BB gun from a local sporting goods store, returns to Wally World, and demands to a overweight and geekish park security guard named Russ Lasky (John Candy) to take them through the park; Ellen and kids follow him, attempting to placate their father.Eventually a SWAT team arrives along with park owner Roy Walley (Eddie Bracken) and they arrest the whole family. Clark manages to talk to Roy who surprisingly understands Clark's impassioned epitome of the American Vacation, describing his own memory of a less-than-enjoyable cross-country trip he took with his own family to Florida. Roy does not file charges against the Griswolds, and lets the family enjoy the park as his guests, along with the police and SWAT team who are seen riding on the park's top roller coaster attraction in the final shot of the movie.The end credits show various still photographs of the Griswolds enjoying the rest of the vacation at all the various stops they made over the course of the movie, including a final frame of them returning to Chicago via plane... having abandoned their gas-guzzling car in California."
}