{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/teT1Mo9hZkNCDQ6DFBr5eMJwOpz.jpg",
  "id": 181886,
  "title": "Enemy",
  "poster_path": "https://image.tmdb.org/t/p/w500/vf40tyDRKZsBmaLsYeopzfFLzLx.jpg",
  "release_date": "2013-12-31",
  "vote_average": 6.881,
  "vote_count": 5501,
  "popularity": 25.983,
  "overview": "A mild-mannered college professor discovers a look-alike actor and delves into the other man's private affairs.",
  "imdb_id": "tt2316411",
  "budget": 0,
  "homepage": "http://enemy-movie.com",
  "revenue": 3396726,
  "runtime": 91,
  "tagline": "You can’t escape Yourself!",
  "genres": [
    "Thriller",
    "Mystery"
  ],
  "production_companies": [
    "Rhombus Media",
    "Roxbury Pictures",
    "Mecanismo Films",
    "micro_scope",
    "Entertainment One",
    "Pathé"
  ],
  "production_countries": [
    "CA",
    "FR",
    "ES"
  ],
  "credits": {
    "cast": [
      {
        "name": "Jake Gyllenhaal",
        "character": "Adam Bell / Anthony Claire"
      },
      {
        "name": "Sarah Gadon",
        "character": "Helen Claire"
      },
      {
        "name": "Mélanie Laurent",
        "character": "Mary"
      },
      {
        "name": "Isabella Rossellini",
        "character": "Adam's Mother"
      },
      {
        "name": "Joshua Peace",
        "character": "Carl"
      },
      {
        "name": "Tim Post",
        "character": "Anthony"
      },
      {
        "name": "Kedar Brown",
        "character": "Security Guard"
      },
      {
        "name": "Darryl Dinn",
        "character": "Video Store Clerk"
      },
      {
        "name": "Megan Mane",
        "character": "Lady in the Dark Room"
      },
      {
        "name": "Misha Highstead",
        "character": "Lady in the Dark Room"
      },
      {
        "name": "Alexis Uiga",
        "character": "Lady in the Dark Room"
      },
      {
        "name": "Kiran Friesen",
        "character": "Sad, Broken Woman (uncredited)"
      },
      {
        "name": "Loretta Yu",
        "character": "Receptionist (uncredited)"
      },
      {
        "name": "Stephen R. Hart",
        "character": "Bouncer (uncredited)"
      },
      {
        "name": "Paul Stephen",
        "character": "Dark Room Patron (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Niv Fichman",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Renée April",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "François Ivernel",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Cameron McCracken",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Jim Lambie",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "José Saramago",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Victor Loewy",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Javier Gullón",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Patrice Vermette",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Denis Villeneuve",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Mark Slone",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Nicolas Bolduc",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Saunder Jurriaans",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Matthew Hannam",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Sean Breaugh",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Danny Bensi",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Miguel A. Faura",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Morag Ross",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Catherine Viot",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Sam Hudecki",
        "department": "Art",
        "job": "Storyboard Artist"
      },
      {
        "name": "Marc Orts",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Marc Bech",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Marc Bech",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Oriol Tarragó",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Oriol Tarragó",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Alison Reid",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Debra Johnson",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Martha Sparrow",
        "department": "Art",
        "job": "Set Designer"
      },
      {
        "name": "Albert Ribas",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Herwig Gayer",
        "department": "Sound",
        "job": "Production Sound Mixer"
      },
      {
        "name": "Jennifer Vey",
        "department": "Crew",
        "job": "Stunt Double"
      },
      {
        "name": "John MacLean",
        "department": "Camera",
        "job": "Key Grip"
      },
      {
        "name": "Jordan Kerner",
        "department": "Art",
        "job": "Set Dresser"
      }
    ]
  },
  "keywords": [
    "infidelity",
    "based on novel or book",
    "nightmare",
    "professor",
    "pregnancy",
    "paranoia",
    "toronto, canada",
    "delusion",
    "symbolism",
    "spider",
    "surrealism",
    "mental illness",
    "dream sequence",
    "doppelgänger",
    "double identity"
  ],
  "mpaa": "R",
  "summaries": [
    "A man seeks out his exact look-alike after spotting him in a movie.",
    "Adam Bell is a Toronto area History college professor. He is a rather somber man, largely because he is stuck in a routine, which includes a relationship with his live-in girlfriend, Mary. While watching a rental movie, he spots an actor in a bit part that looks like him. He becomes obsessed with finding out about this double of his. He learns that the actor's stage name is Daniel Saint Claire, whose legal name is Anthony Claire. Claire is a Toronto based actor with only a few on-screen credits, and is married to a woman named Helen who is currently several months pregnant. Adam then becomes obsessed with meeting Claire, who he learns upon first sighting that they look exactly the same, from the facial hair to a scar each has, but Claire who outwardly is more \"put together\" than Adam. Their lives become intertwined as Claire himself ends up becoming obsessed with Adam, but in a slightly different way.—Huggo"
  ],
  "synopsis": "A man attends an erotic show at an underground club, which culminates with a naked woman on the verge of crushing a live tarantula under her platform high heel.Adam Bell (Jake Gyllenhaal), a college history professor (specializing in dictatorships), lives a quiet, monotonous life (class, home, dinner, sex and then all over again) in Toronto. He rents a film, Where There's a Will There's a Way, on the recommendation of a colleague, and spots an actor who looks strikingly like himself, briefly, in the film as a bellhop. Searching online, Adam identifies the actor as Anthony Claire, whose stage name is Daniel Saint Claire. Adam rents the other two films in which Anthony has appeared and becomes obsessed with the man, who appears to be his physical twin. Immediately afterwards, Adam searches some boxes in his own house and finds a photo of someone who looks like himself, with a woman's hand over his shoulder. However, part of the photo is torn out, making the woman impossible to identify.Adam stalks Anthony, visiting his talent agency, where he is mistaken for Anthony and given a confidential letter. Discovering Anthony's apartment in Mississauga, Adam calls the home, but reaches Anthony's pregnant wife, Helen (Sarah Gadon). She also mistakes Adam's voice for Anthony's and assumes it's a joke, but Adam insists he is not Anthony. This frightens Helen, and Adam abruptly ends the call.\nAdam calls again later and reaches Anthony, who assumes Adam is a stalker and tells him not to call again. Helen confronts Anthony about the phone call (she thinks the call is from a jealous husband of Anthony's mistress) and Adam's existence, but Anthony insists he knows nothing. Unconvinced, Helen conducts research on Adam, discovers the college where he teaches, and finds him. Helen is visibly stunned at his exact resemblance to her husband, though Adam does not realize who Helen is.Anthony eventually calls Adam, and they agree to meet in a hotel room, where they discover that they are perfectly identical, even having the same scar. Adam is taken aback by Anthony's direct personality, says the meeting was a mistake, and swiftly departs. The two men begin having similar dreams, or perhaps the same dream, featuring first a naked woman with a spider's head, and later a giant skyscraper-sized spider walking among the buildings of the city where they live.The next day, Anthony is now stalking Adam. He sees Adam's girlfriend, Mary (Melanie Laurent), whom he finds attractive. Anthony plots to accuse Adam of sleeping with his wife, and shame and manipulate Adam into letting him sleep with Mary to 'get even'. He demands Adam's clothes and car keys for a night, after which he promises to disappear forever. Adam complies. Anthony impersonates him and takes Mary to the hotel.Meanwhile, Adam goes to Anthony's apartment in retaliation, and is let inside. The building concierge desperately asks 'Anthony' to take him back to the underground sex club. Inside the apartment, Adam finds a framed photo on a shelf which looks like the one he had found earlier in his own house, but now the photo is intact, and the woman is revealed to be Helen. Adam tries to act as Anthony in front of Helen, but it appears that she recognizes his nicer demeanor. She pretends not to notice and cuddles with him. Later that night, however, Helen wakes to find Adam crying and apologizing; she tells him she wants him to stay, and they make love, which she initiates.Back at the hotel, Mary panics during sex when she notices Anthony's wedding-ring mark and asks who he really is. Anthony claims he has always had the mark. She forces Anthony to drive her home; the two get into a fight in the car which results in a high-speed crash, presumably killing them both.The next day, Adam dresses in Anthony's clothes and finally opens the confidential letter received earlier. He finds the key to the underground sex club, given only to select members. He resolves to go there, and tells Helen that he's going out, but she doesn't respond. As he enters the bedroom, he sees, instead of Helen, a room-sized tarantula cowering against the rear wall. Adam, with a resigned look, sighs."
}