{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/mkBwYZ5r01RQl0Educ0HvEwOyh5.jpg",
  "id": 1934,
  "title": "Shakespeare in Love",
  "poster_path": "https://image.tmdb.org/t/p/w500/iNCTveBiq7jQ4Av4ynWSdWXN6Cc.jpg",
  "release_date": "1998-12-11",
  "vote_average": 6.869,
  "vote_count": 2862,
  "popularity": 20.484,
  "overview": "Young Shakespeare is forced to stage his latest comedy, \"Romeo and Ethel, the Pirate's Daughter,\" before it's even written. When a lovely noblewoman auditions for a role, they fall into forbidden love -- and his play finds a new life (and title). As their relationship progresses, Shakespeare's comedy soon transforms into tragedy.",
  "imdb_id": "tt0138097",
  "budget": 25000000,
  "homepage": "",
  "revenue": 289300000,
  "runtime": 123,
  "tagline": "Love is the only inspiration.",
  "genres": [
    "Romance",
    "History",
    "Comedy"
  ],
  "production_companies": [
    "Miramax",
    "Universal Pictures",
    "Bedford Falls Productions"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Joseph Fiennes",
        "character": "Will Shakespeare"
      },
      {
        "name": "Gwyneth Paltrow",
        "character": "Viola De Lesseps"
      },
      {
        "name": "Geoffrey Rush",
        "character": "Philip Henslowe"
      },
      {
        "name": "Tom Wilkinson",
        "character": "Hugh Fennyman"
      },
      {
        "name": "Judi Dench",
        "character": "Queen Elizabeth"
      },
      {
        "name": "Imelda Staunton",
        "character": "Nurse"
      },
      {
        "name": "Colin Firth",
        "character": "Lord Wessex"
      },
      {
        "name": "Ben Affleck",
        "character": "Ned Alleyn"
      },
      {
        "name": "Simon Callow",
        "character": "Tilney"
      },
      {
        "name": "Steven Beard",
        "character": "Makepeace"
      },
      {
        "name": "Jim Carter",
        "character": "Ralph Bashford"
      },
      {
        "name": "Rupert Everett",
        "character": "Christopher Marlowe"
      },
      {
        "name": "Martin Clunes",
        "character": "Richard Burbage"
      },
      {
        "name": "Tim McMullan",
        "character": "Frees"
      },
      {
        "name": "Joe Roberts",
        "character": "John Webster"
      },
      {
        "name": "Antony Sher",
        "character": "Dr. Moth"
      },
      {
        "name": "Georgie Glen",
        "character": "Lady in Waiting"
      },
      {
        "name": "Nicholas Boulton",
        "character": "Henry Condell"
      },
      {
        "name": "Barnaby Kay",
        "character": "Nol"
      },
      {
        "name": "Mark Williams",
        "character": "Wabash"
      },
      {
        "name": "Jill Baker",
        "character": "Lady De Lesseps"
      },
      {
        "name": "Nicholas Le Prevost",
        "character": "Sir Robert De Lesseps"
      },
      {
        "name": "Rebecca Charles",
        "character": "Chambermaid"
      },
      {
        "name": "Bob Barrett",
        "character": "George Bryan"
      },
      {
        "name": "Simon Day",
        "character": "Taxi boatman"
      },
      {
        "name": "Bridget McConnell",
        "character": "Lady in Waiting"
      },
      {
        "name": "Sandra Reinton",
        "character": "Rosaline"
      },
      {
        "name": "Jason Round",
        "character": "Tavern Actor"
      },
      {
        "name": "Rupert Farley",
        "character": "Barman"
      },
      {
        "name": "Adam Barker",
        "character": "First Auditionee"
      },
      {
        "name": "Harry Gostelow",
        "character": "Second Auditionee"
      },
      {
        "name": "Alan Cody",
        "character": "Third Auditionee"
      },
      {
        "name": "David Curtiz",
        "character": "John Hemmings"
      },
      {
        "name": "Gregor Truter",
        "character": "James Hemmings"
      },
      {
        "name": "Amber Glossop",
        "character": "Scullery Maid"
      },
      {
        "name": "Robin Davies",
        "character": "Master Plum"
      },
      {
        "name": "Hywel Simons",
        "character": "Servant"
      },
      {
        "name": "Roger Morlidge",
        "character": "James Armitage"
      },
      {
        "name": "Daniel Brocklebank",
        "character": "Sam Gosse"
      },
      {
        "name": "Mark Saban",
        "character": "Augustine Phillips"
      },
      {
        "name": "Timothy Kightley",
        "character": "Edward Pope"
      },
      {
        "name": "Roger Frost",
        "character": "Second Taxi Boatman"
      },
      {
        "name": "Rachel Clarke",
        "character": "First Whore"
      },
      {
        "name": "Lucy Speed",
        "character": "Second Whore"
      },
      {
        "name": "John Ramm",
        "character": "Makepeace's Neighbour"
      },
      {
        "name": "Paul Bigley",
        "character": "Peter"
      },
      {
        "name": "Patrick Barlow",
        "character": "Will Kempe"
      },
      {
        "name": "Steven O'Donnell",
        "character": "Lambert"
      },
      {
        "name": "John Inman",
        "character": "Lady Capulet in Play"
      }
    ],
    "crew": [
      {
        "name": "Tom Stoppard",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Stephen Warbeck",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Bob Weinstein",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Harvey Weinstein",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Mark Cooper",
        "department": "Production",
        "job": "Line Producer"
      },
      {
        "name": "Michelle Guish",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Edward Zwick",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Sandy Powell",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Steven Lawrence",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Jill Quertier",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "John Madden",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Marc Norman",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Marc Norman",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "David Parfitt",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Donna Gigliotti",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Julie Goldstein",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Richard Greatrex",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "David Gamble",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Linda Bruce",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Stuart Williams",
        "department": "Crew",
        "job": "Carpenter"
      },
      {
        "name": "Rachael Jones",
        "department": "Art",
        "job": "Sculptor"
      }
    ]
  },
  "keywords": [
    "london, england",
    "theater play",
    "queen elizabeth i",
    "playwright",
    "cross dressing",
    "false history",
    "francis bacon",
    "16th century",
    "acting",
    "elizabethan england"
  ],
  "mpaa": "R",
  "summaries": [
    "The world's greatest ever playwright, William Shakespeare, is young, out of ideas and short of cash, but meets his ideal woman and is inspired to write one of his most famous plays.",
    "William Shakespeare (Joseph Fiennes) is a known but struggling poet, playwright, and actor, who not only has sold his next play to both Philip Henslowe (Geoffrey Rush) and Richard Burbage (Martin Clunes), but now faces a far more difficult problem: he is bereft of ideas and has yet to begin writing. He is in search of his muse, the woman who will inspire him but all attempts fail him until he meets the beautiful Viola De Lesseps (Gwyneth Paltrow). She loves the theatre and would like nothing more than to take to the stage, but is forbidden from doing so as only men can be actors. She is also a great admirer of Shakespeare's works. Dressing as a man, and going by the name of \"Thomas Kent\", she auditions and is ideal for a part in his next play. Shakespeare soon sees through her disguise and they begin a love affair, one they know cannot end happily for them as he is already married and she has been promised to the dour Lord Wessex (Colin Firth). As the company rehearses his new play, William and Viola's love is transferred to the written page leading to the masterpiece that is Romeo and Juliet.—garykmcd",
    "1593 London. Master William Shakespeare (Joseph Fiennes), an up-and-coming playwright and sonneteer, is not nearly as well known as his counterpart, Christopher Marlowe (Rupert Everett). So William's current writer's block does not help matters for him or for the owner of the Rose Theatre, Philip Henslowe (Geoffrey Rush), for whom Will generally writes his plays, that is when the theater is not closed due to the plague or Henslowe's financial problems. That current unwritten play commissioned is a comedy tentatively titled \"Romeo and Ethel, the Pirate's Daughter\". Will's block is partly due to the loss of his muse, his mistress, who he caught in bed with another man, he having a mistress as he would otherwise be alone with his wife back in Stratford. Will begins to write again and passionately when he falls in love with Viola De Lesseps (Gwyneth Paltrow), who comes from a well respected well-off family. Shakespeare also learns that Viola and Thomas Kent, the young man who recently joined the company of the Rose, are one and the same, Viola masquerading as a man to infiltrate the theater world, a domain purely for the male sex, as she is in love with the written word, especially Shakespeare's. As such, she too falls in love with Shakespeare the man and Shakespeare the writer. Without telling Henslowe or Ned Alleyn (Ben Affleck), an egotistical actor, the play is neither the comedy \"Romeo and Ethel, the Pirate's Daughter\" nor one called \"Mercutio\" - the name of Alleyn's character - but is rather morphing into a love story called \"Romeo and Juliet\", the love based on his mutual feelings for Viola. Beyond her continuing to masquerade as Thomas Kent, their own love story has a major obstacle in that she is betrothed to Lord Wessex (Colin Firth), a man she detests and a union sanctioned by her merchant father and Queen Elizabeth (Dame Judi Dench) primarily for financial and business purposes. The mounting of the play, Viola and Will's personal love affair, and their professional collaboration as playwright Will Shakespeare and actor \"Thomas Kent\" are set against the cutthroat business side of sixteenth century English show business.—Huggo",
    "Romantic comedy set in London in the late sixteenth century: Young playwright William Shakespeare (Joseph Fiennes) struggles with his latest work \"Romeo and Ethel the Pirate's Daughter\". A great fan of Shakespeare's plays is young, wealthy Viola De Lesseps (Gwyneth Paltrow), who is about to be married to the cold-hearted Lord Wessex (Colin Firth), but constantly dreams of becoming an actress. Women were not allowed to act on stage at that time (female roles were played by men, too), but dressed up as a boy, Viola successfully auditions for the part of Romeo. Soon she and William are caught in a forbidden romance that provides rich inspiration for his play.—Armin Ortmann <armin@sfb288.math.tu-berlin.de>"
  ],
  "synopsis": "William Shakespeare (Joseph Fiennes) is a poor playwright for Philip Henslowe (Geoffrey Rush), owner of The Rose Theatre, in 1593 London. After learning that his love was cheating on him with his patron, Shakespeare burns his new comedy, Romeo and Ethel the Pirate's Daughter, rewriting it as the tragedy Romeo and Juliet. Suffering from writer's block, he is unable to complete the play, but begins auditions for Romeo. A young man named Thomas Kent is cast in the role after impressing Shakespeare with his performance and his love of Shakespeare's previous work. Kent is actually Viola de Lesseps (Gwyneth Paltrow), the daughter of a wealthy merchant who desires to act but, since women are banned from the stage, she must disguise herself.After Shakespeare discovers his star's true identity, he and Viola begin a passionate secret affair. Inspired by her, Shakespeare writes quickly, and benefits from the advice of playwright and friendly rival Christopher 'Kit' Marlowe (Rupert Everett). Shakespeare and Viola know, however, that their romance is doomed. He is married, albeit long separated from his wife, while Viola's parents have arranged her betrothal to Lord Wessex (Colin Firth), an aristocrat who needs money. When Viola is summoned to the court of Queen Elizabeth I (Judi Dench), Shakespeare dons a woman's disguise to accompany her as her cousin. At court, he persuades Wessex to bet £50 that a play cannot capture the nature of true love. If Romeo and Juliet is a success, Shakespeare as playwright will win the money. The Queen, who enjoys Shakespeare's plays, agrees to witness the wager.Edmund Tilney (Simon Callow), the Master of the Revels, the Queen's official in charge of the theaters, learns that there is a woman in the theatre company at The Rose playhouse, and orders the theatre closed for violating morality and the law. Left without a stage or lead actor, it seems that Romeo and Juliet must close before it even opens, until Richard Burbage (Martin Clunes), the owner of a competing theatre, the Curtain, offers his stage to Shakespeare. Shakespeare assumes the lead role of Romeo, with a boy actor (Daniel Brocklebank), playing Juliet. Viola learns that the play will be performed on her wedding day, and after the ceremony secretly travels to the theatre. Shortly before the play begins, the boy playing Juliet starts experiencing the voice change of puberty. Viola replaces him and plays Juliet to Shakespeare's Romeo. Their passionate portrayal of two lovers inspires the entire audience.Tilney arrives at the theatre with Wessex, who has deduced his new bride's location. Tilney plans to arrest the audience and cast for indecency, but the Queen is in attendance. Although she recognizes Viola, the Queen does not unmask her, instead declaring that the role of Juliet is being performed by Thomas Kent. However, even a queen is powerless to end a lawful marriage, so she orders \"Kent\" to fetch Viola so that she may sail with Wessex to the Colony of Virginia. The Queen also states that Romeo and Juliet has accurately portrayed true love so Wessex must pay Shakespeare £50, the exact amount Shakespeare requires to buy a share in the Lord Chamberlain's Men. The Queen then directs \"Kent\" to tell Shakespeare to write something \"a little more cheerful next time, for Twelfth Night\".Viola and Shakespeare part, resigned to their fates. The film closes as Shakespeare begins to write Twelfth Night, Or What You Will imagining his love washed ashore in a strange land after a shipwreck and musing, \"For she will be my heroine for all time, and her name will be...Viola\", a strong young woman castaway who disguises herself as a young man."
}