{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/afrh3vqLrZeg6ZtKJKm7XW1TiVF.jpg",
  "id": 2044,
  "title": "The Lake House",
  "poster_path": "https://image.tmdb.org/t/p/w500/tHpc1118dYWLnHZleGhwZxRbpae.jpg",
  "release_date": "2006-06-16",
  "vote_average": 7.002,
  "vote_count": 2586,
  "popularity": 24.385,
  "overview": "A lonely doctor who once occupied an unusual lakeside home begins exchanging love letters with its former resident, a frustrated architect. They must try to unravel the mystery behind their extraordinary romance before it's too late.",
  "imdb_id": "tt0410297",
  "budget": 40000000,
  "homepage": "",
  "revenue": 114830111,
  "runtime": 99,
  "tagline": "How do you hold on to someone you've never met?",
  "genres": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "production_companies": [
    "Vertigo Entertainment"
  ],
  "production_countries": [
    "KR",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Keanu Reeves",
        "character": "Alex Wyler"
      },
      {
        "name": "Sandra Bullock",
        "character": "Kate Forster"
      },
      {
        "name": "Christopher Plummer",
        "character": "Simon Wyler"
      },
      {
        "name": "Ebon Moss-Bachrach",
        "character": "Henry Wyler"
      },
      {
        "name": "Willeke van Ammelrooy",
        "character": "Kate's Mother"
      },
      {
        "name": "Dylan Walsh",
        "character": "Morgan"
      },
      {
        "name": "Shohreh Aghdashloo",
        "character": "Anna Klyczynski"
      },
      {
        "name": "Lynn Collins",
        "character": "Mona"
      },
      {
        "name": "Mike Bacarella",
        "character": "Mulhern"
      },
      {
        "name": "Kevin M. Brennan",
        "character": "Waiter"
      },
      {
        "name": "Frank Caeti",
        "character": "Cove Patron"
      },
      {
        "name": "Aliyah Carr",
        "character": "Girl Patient"
      },
      {
        "name": "Jennifer Clark",
        "character": "Nurse Practitioner"
      },
      {
        "name": "Jacob D. Dumelle",
        "character": "Patient on Gurney"
      },
      {
        "name": "Scott Elias",
        "character": "Doug"
      },
      {
        "name": "Lori Ann Gerdisch",
        "character": "I.C.U. Nurse"
      },
      {
        "name": "Cynthia Kaye McWilliams",
        "character": "Vanessa Vanderbeck"
      },
      {
        "name": "India Neilan",
        "character": "Hostess"
      },
      {
        "name": "Mia Park",
        "character": "Receptionist"
      },
      {
        "name": "Jacqueline Williams",
        "character": "Madhvi Patel"
      },
      {
        "name": "Peggy Roeder",
        "character": "Attendant"
      },
      {
        "name": "Jason Wells",
        "character": "Costello"
      },
      {
        "name": "Tiffini Funches",
        "character": "Young Nurse"
      },
      {
        "name": "Jennifer Kern",
        "character": "Nurse"
      },
      {
        "name": "Michael Andrew Gorman",
        "character": "Cove Bartender"
      }
    ],
    "crew": [
      {
        "name": "Bruce Berman",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Lynzee Klingman",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Rachel Portman",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "David Carbonara",
        "department": "Sound",
        "job": "Music Editor"
      },
      {
        "name": "Meg Everist",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Erwin Stoff",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Josh McLaglen",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Deena Appel",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Nathan Crowley",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Kevin Kavanaugh",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Alejandro Agresti",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "David Auburn",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Kim Eun-jeong",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Yeoh Gee-na",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Doug Davison",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Roy Lee",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Alar Kivilo",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Alejandro Brodersohn",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Dana Goldberg",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Mary McLaglen",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Tobiasz Daszkiewicz",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Dominic Mango",
        "department": "Costume & Make-Up",
        "job": "Hair Department Head"
      },
      {
        "name": "Tom Lowell",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Carl Paoli",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Sonny Mallhi",
        "department": "Production",
        "job": "Co-Producer"
      },
      {
        "name": "Katherine Quittner",
        "department": "Sound",
        "job": "Music Editor"
      },
      {
        "name": "Suzi Ostos",
        "department": "Costume & Make-Up",
        "job": "Makeup Department Head"
      },
      {
        "name": "Rick LeFevour",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Rick LeFevour",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Daniel Maldonado",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Brian Christensen",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Sherry Gallarneau",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Peter Sorel",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Mark La Bonge",
        "department": "Camera",
        "job": "Steadicam Operator"
      },
      {
        "name": "Janine Rath",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Chris Mulsoff",
        "department": "Lighting",
        "job": "Rigging Gaffer"
      },
      {
        "name": "Nina Paskowitz",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Pamela S. Westmore",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "John Houlihan",
        "department": "Sound",
        "job": "Music Supervisor"
      },
      {
        "name": "Geri B. Oppenheim",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Frank P. Calzavara",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "James Fierro",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Natalie M. Meyer",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Makiko Carlson",
        "department": "Camera",
        "job": "First Assistant Camera"
      },
      {
        "name": "Linda Perlin",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "James Mammoser",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Kevin Sorensen",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Alicia Skirball",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Mark Harper",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Scott Philyaw",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Melanie A. Allen",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Jodi Starnes",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Maryann Kelman",
        "department": "Crew",
        "job": "Stunts"
      }
    ]
  },
  "keywords": [
    "chicago, illinois",
    "future",
    "writing",
    "architect",
    "time travel",
    "love letter",
    "time",
    "remake",
    "architecture",
    "mysterious letter",
    "first kiss",
    "passage of time",
    "lake house"
  ],
  "mpaa": "PG",
  "summaries": [
    "A lonely doctor who once occupied an unusual lakeside house begins to exchange love letters with its former resident, a frustrated architect. They must try to unravel the mystery behind their extraordinary romance before it's too late.",
    "When two people \"connect,\" the bond between them can be so pure and simple as to stir hearts in heaven. When they connect in all the right places at all the wrong times, heaven weeps for broken hearts. To heal these broken hearts, heaven breaks time.—Blithe Spiritus",
    "Kate Forster is moving out of her all-glass lake house. She is a doctor and has just begun to work in a hospital in Chicago, so she is moving to a new flat in the center of the city. Alex Wyler is the new owner of the lake house, a young architect who's working on the construction of a new housing complex on the outskirts of the city. Alex and Kate maintain a correspondence, talking about house matters, sending each other letters, which are put in the lake house's letterbox. But a strange thing is happening: they both find out that the letterbox is a kind of time communication channel between the year 2004, in which Alex lives, and the year 2005, in which Kate lives. After sending each other many letters talking about their lives, and Kate talking to Alex about how life will be in two years, it seems like they're falling in love with each other, but they might never meet because of the time distance. Nevertheless, Kate remembers that in 2004 she forgot a book (Jane Austen's \"Persuasion\") in a train station, and she asks Alex to go to that place in that precise moment. Maybe her future will change when Alex decides to meet Kate's other self in the past, although she has a boyfriend. They will learn that playing with time could be dangerous for both of them, but Alex will take everything into his hands to finally meet Kate in the future.—Alejandro Frias",
    "In Chicago, lonely architect Alex Wyler has a troubled relationship with his father Simon Wyler. In 2004, he buys an old glass house by a lake, designed and built by his father, and finds a message in his mailbox from the former tenant, the also-lonely Dr. Kate Forster, asking to the new resident deliver her correspondence to an address downtown. Alex meets his brother Henry in Chicago and when they go to the address with Dr. Forster's correspondence, they find a building of luxury apartments under construction to be delivered 18 months later. After exchanging some messages, Alex and Kate discover that she is living in 2006 and Alex in 2004. They fall in love with each other and try to figure out how to meet in person.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "Dr. Kate Forster, who works in a Chicago hospital, has had issues with relating to people on a deeply-emotional level. Alex Wyler is a social developer and architect. At different times they both lived in the same lakeside glass house built by Alex's father. The two begin a correspondence by pure chance when Kate leaves a note in the lake house's letterbox asking the new tenant to forward her mail to her new address in the city. Alex gets this message--two years prior when he himself lived in the lake house. When the two discover that they are indeed corresponding through the time-warped mailbox, they learn more about each other. They manage to spend time together through common experiences two years apart. The more they correspond, the deeper the bond between the two gets, and they end up falling in love. Kate has the benefit of being able to tell Alex of what happens in the future. Alex has the benefit of being able to experience things that Kate has experienced in the past. He even has a chance to meet her before she knew him. Kate devises a plan to meet in her present/Alex's future so that they can spend their life together at the same time. However much can happen to Alex between his present and Kate's present, two years in his future.—Huggo"
  ],
  "synopsis": "In 2006, Dr. Kate Forster (Sandra Bullock) is leaving a lake house that she has been renting in Chicago. Kate leaves a note in the mailbox for the next tenant to forward her mail, adding that the paint-embedded paw-prints on the path leading to the house were already there when she arrived.Two years earlier in 2004, Alex Wyler (Keanu Reeves), an architect, arrives at the lake house and finds Kate's letter in the mailbox. The house is neglected, with no sign of paw prints anywhere. During the subsequent restoration of the house, a dog runs through Alex's paint and leaves fresh paw prints right where Kate said they would be. Baffled, Alex writes back, asking how Kate knew about the paw prints since the house was unoccupied until he arrived. On Valentine's Day 2006, Kate witnesses a traffic accident near Daley Plaza and tries to save the male victim, unsuccessfully. She impulsively drives back to the lake house, finds Alex's letter and writes back.Alex is estranged from his father Simon J. Wyler (Christopher Plummer), who runs a large architecture firm, but stays in touch with his brother Henry. The lake House was built by Simon and Alex has purchased it, so that he can relive the memories of his childhood. Simon had built the lake house with his own hands, before he was a big shot and was still in love with his wife Mary (the house was a gift to her). But as Simon became more successful, he also became more difficult to live with, until Mary ditched him. She got sick and died within a year, but Simon didn't attend her funeral.\nAlex visits the address given by Kate but finds no building there (it is still under construction in 2004).Both Alex and Kate continue passing messages to each other via the mailbox, and each watches its flag go up and down as the message leaves and the reply arrives as they wait at the mailbox. They cautiously look around each time the flag changes, hoping to somehow spot the other. It is in vain as they are alone at the mailbox. They then discover that they are living exactly two years apart. Their correspondence takes them through several events, including Alex finding a book, Jane Austen's Persuasion, at a railway station where Kate said she would have lost it, and Alex taking Kate on a walking tour of his favorite places in Chicago via an annotated map that he leaves in the mailbox.In 2004, Kate was dating Morgan Price (Dylan Walsh), who had come to town to meet her. Alex's dog (in 2004) Jake runs to Kate's house and Alex chases him. Thats how Alex meets Morgan and tells him how he lives on the house on the lake. Morgan says that he wants to rent the house for Kate. Morgan invites Alex for his party.\nAlex eventually meets Kate at her boyfriend's party; however, he doesn't mention their exchange of letters because it had not happened to Kate yet. Kate later remembered the meeting as a vague memory in the past. They shared a dance (& a kiss) and talked about Kate's favorite book \"Persuasion\", which is about true love having to wait for the right time before the lovers could unite.As Alex and Kate continue to write to each other, they decide to try to meet again. Alex makes a reservation at the Il Mare restaurant - two years into Alex's future, but only a day away for Kate. Kate goes to the restaurant, but Alex fails to show. Heartbroken, Kate asks Alex not to write to her again, recounting the accident a year before. Both Alex and Kate leave the lake house, continuing on with their separate lives. Kate gets back together with Morgan; Alex vacates the lake house and rents it out to Morgan and Kate starts living there.On Valentine's Day 2006 for Alex, Valentine's Day 2008 for Kate, he returns to the lake house after something about the day triggers a memory. Meanwhile, Kate goes to an architect to review the renovation plans for a house that she now wants to buy. A drawing of the lake house on the conference room wall catches her attention and upon asking, Henry Wyler (Ebon Moss-Bachrach) informs her the artist was his brother, Alex, and Kate realizes that this was the same Alex with whom she had been corresponding. She also learns that Alex was killed in a traffic accident exactly two years ago to the day and realizes why he never showed up for their date - he was the man who died in Daley Plaza.Rushing to the lake house, Kate frantically writes a letter telling Alex she loves him but begs him not to try to find her if he loves her back. Wait two years, she says, and come to the lake house instead. Meanwhile, in 2006, Alex has gone to Daley Plaza to look for Kate.\nAt the lake house, Kate drops to her knees sobbing, fearing that she has arrived too late to stop Alex. After a long pause, the mailbox flag finally lowers; Alex has picked up her note. Not long afterwards, a familiar mint-green truck pulls up. She walks forward smiling as the driver, clad in jeans and a familiar tan jacket, approaches. She and Alex kiss and walk toward the lake house."
}