{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/druc9hHkLeMtb0fYf7WTfHXWk6G.jpg",
  "id": 2277,
  "title": "Bicentennial Man",
  "poster_path": "https://image.tmdb.org/t/p/w500/wrs23eO0VEWwOQpXoOasMnlW9Y4.jpg",
  "release_date": "1999-12-17",
  "vote_average": 7.246,
  "vote_count": 3425,
  "popularity": 26.552,
  "overview": "Richard Martin buys a gift, a new NDR-114 robot. The product is named Andrew by the youngest of the family's children. \"Bicentennial Man\" follows the life and times of Andrew, a robot purchased as a household appliance programmed to perform menial tasks. As Andrew begins to experience emotions and creative thought, the Martin family soon discovers they don't have an ordinary robot.",
  "imdb_id": "tt0182789",
  "budget": 100000000,
  "homepage": "",
  "revenue": 87423861,
  "runtime": 131,
  "tagline": "One robot's 200 year journey to become an ordinary man.",
  "genres": [
    "Science Fiction",
    "Drama"
  ],
  "production_companies": [
    "Columbia Pictures",
    "Touchstone Pictures",
    "1492 Pictures",
    "Laurence Mark Productions",
    "Radiant Productions"
  ],
  "production_countries": [
    "DE",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Robin Williams",
        "character": "Andrew"
      },
      {
        "name": "Embeth Davidtz",
        "character": "Little Miss / Portia"
      },
      {
        "name": "Sam Neill",
        "character": "Sir"
      },
      {
        "name": "Oliver Platt",
        "character": "Rupert Burns"
      },
      {
        "name": "Kiersten Warren",
        "character": "Galatea Robotic / Human"
      },
      {
        "name": "Wendy Crewson",
        "character": "Ma'am"
      },
      {
        "name": "Hallie Eisenberg",
        "character": "Little Miss 7 yrs. old"
      },
      {
        "name": "Lindze Letherman",
        "character": "Miss 9 yrs. old"
      },
      {
        "name": "Angela Landis",
        "character": "Miss"
      },
      {
        "name": "John Michael Higgins",
        "character": "Bill Feingold"
      },
      {
        "name": "Bradley Whitford",
        "character": "Lloyd"
      },
      {
        "name": "Igor Hiller",
        "character": "Lloyd 10 yrs. old"
      },
      {
        "name": "Joe Bellan",
        "character": "Robot Delivery Man"
      },
      {
        "name": "Brett Wagner",
        "character": "Robot Delivery Man"
      },
      {
        "name": "Stephen Root",
        "character": "Dennis Mansky"
      },
      {
        "name": "Scott Waugh",
        "character": "Motorcycle Punk"
      },
      {
        "name": "Quinn Smith",
        "character": "Frank"
      },
      {
        "name": "Kristy Connelly",
        "character": "Monica"
      },
      {
        "name": "Jay Johnston",
        "character": "Charles"
      },
      {
        "name": "George D. Wallace",
        "character": "Male President"
      },
      {
        "name": "Lynne Thigpen",
        "character": "Female President"
      },
      {
        "name": "Ples Griffin",
        "character": "Zimbabwe Representative"
      },
      {
        "name": "Marcia Pizzo",
        "character": "Lloyd's Wife"
      },
      {
        "name": "Paula DuPré Pesmen",
        "character": "Feingold's Assistant"
      },
      {
        "name": "Clarke Devereux",
        "character": "Priest"
      },
      {
        "name": "Bruce Kenneth Wagner",
        "character": "Engagement Party Guest"
      },
      {
        "name": "Paula West",
        "character": "Singer"
      },
      {
        "name": "Kevin 'Tiny' Ancell",
        "character": "Restoration Worker #1"
      },
      {
        "name": "Richard Cross",
        "character": "Restoration Worker #2"
      },
      {
        "name": "Adam Bryant",
        "character": "Humanoid Head"
      },
      {
        "name": "Eric Fiedler",
        "character": "Puppeteer"
      },
      {
        "name": "Billy Bryan",
        "character": "Puppeteer"
      },
      {
        "name": "Christopher Nelson",
        "character": "Puppeteer"
      },
      {
        "name": "Jim Kundig",
        "character": "Puppeteer"
      },
      {
        "name": "Terry Sandin",
        "character": "Puppeteer"
      },
      {
        "name": "Mike Elizalde",
        "character": "Puppeteer"
      },
      {
        "name": "Mark Garbarino",
        "character": "Puppeteer"
      },
      {
        "name": "Christian Ristow",
        "character": "Puppeteer"
      },
      {
        "name": "Leonard MacDonald",
        "character": "Puppeteer"
      },
      {
        "name": "Dan Rebett",
        "character": "Puppeteer"
      },
      {
        "name": "Bernhard Eichholz",
        "character": "Puppeteer"
      },
      {
        "name": "Evan Brainard",
        "character": "Puppeteer"
      },
      {
        "name": "Benny Buettner",
        "character": "Puppeteer"
      },
      {
        "name": "Kamela Portuges",
        "character": "Puppeteer"
      },
      {
        "name": "Michael Steffe",
        "character": "Puppeteer"
      },
      {
        "name": "Mark Walas",
        "character": "Puppeteer"
      }
    ],
    "crew": [
      {
        "name": "Norman Reynolds",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Bruton Jones",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "James Horner",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Janet Hirshenson",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Jane Jenkins",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Nicolas De Toth",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Neil Travis",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Wolfgang Petersen",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Anne Kuljian",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Chris Columbus",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Chris Columbus",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Mark Radcliffe",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Phil Meheux",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Laurence Mark",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Paula DuPré Pesmen",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Dan Kolsrud",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Mark W. Mansbridge",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Michael Barnathan",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Nicholas Kazan",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Isaac Asimov",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Gail Katz",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Joseph G. Aulisi",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "William Hiney",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Gary Archer",
        "department": "Costume & Make-Up",
        "job": "Prosthetics"
      },
      {
        "name": "Robert Silverberg",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Tory Belleci",
        "department": "Art",
        "job": "Props"
      },
      {
        "name": "Merrick Rustia",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Matsune Suzuki",
        "department": "Art",
        "job": "Conceptual Design"
      },
      {
        "name": "Neal Miller",
        "department": "Production",
        "job": "Producer"
      }
    ]
  },
  "keywords": [
    "android",
    "based on novel or book",
    "freedom",
    "hologram",
    "futuristic",
    "robot",
    "based on short story",
    "journey",
    "22nd century",
    "2040s",
    "23rd century",
    "2060s"
  ],
  "mpaa": "PG",
  "summaries": [
    "An android endeavors to become human as he gradually acquires emotions.",
    "This film follows the 'life' and times of the lead character, an android who is purchased as a household robot programmed to perform menial tasks. Within a few days the Martin family realizes that they don't have an ordinary droid as Andrew begins to experience emotions and creative thought. In a story that spans two centuries, Andrew learns the intricacies of humanity while trying to stop those who created him from destroying him.—<N2XFYLS@aol.com>",
    "Follows the evolution of the android robot Andrew Martin (Williams) from his introduction into the Martin family and interaction with them through four generations: discovery of his emotional and creative abilities, development into an artist and inventor, evolution into an android, his fight to win legal recognition for his humanity, and ultimately his destiny."
  ],
  "synopsis": "The NDR series robot \"Andrew\" is introduced into the Martin family home in April 2005 to perform housekeeping and maintenance duties. Unfortunately, the elder daughter of the family doesn't accept him, and orders him to jump out the window - injuring his mechanisms severely. The father of the household, Richard Martin, holds a family meeting and stipulates that Andrew is to be treated as a human being, and as a member of the family, rather than a household appliance. They then slowly grow to accept Andrew as a functional member of their family unit.But when Andrew accidentally breaks a glass figurine belonging to \"Little Miss\" Amanda Martin, to whom he is devoted, he carves a similar figurine out of wood. The family is astonished by this sign of original creativity in a robot and Sir Richard Martin takes Andrew to his manufacturer, NorthAm Robotics, to inquire if all the robots are like him. The CEO of the company sees this development as a problem and wishes to scrap Andrew or, as he puts it, \"fix him.\"Deeply angered, Martin takes Andrew home and allows him to pursue his own development: creating masterpiece clocks and other wood items. He also encourages Andrew to educate himself in the humanities and helps him to understand the concepts.When Andrew is damaged, Martin again takes him to NorthAm Robotics for repairs, but stipulates that if they attempt in any way to alter Andrew's positronic brain, the company would be liable for the projected revenue Andrew's creativity would generate over his operational lifespan - a sum that would bankrupt the company (since his operational lifespan is essentially limitless). Andrew requests that while he is being repaired his face be altered to convey the emotions he feels but cannot fully express; thus begins Andrew's outward transformation from robot to android. He is told this would cost an exorbitant amount of money, and prints of a cheque, to which Andrew replies that the sum is roughly one months of his salary. The CEO of NorthAm Robotics balks and mutters that the sum is \"more than he makes in a year\". \"Sir\" Richard is gleeful at this, and says it is quite a \"good achievement for...what was it he called you last time we were here, Andrew?\" \"Household Appliance, Sir.\" \"That's right. Household Appliance.\"After many years, Andrew has amassed enough money to need a legal adviser and bank account. Andrew eventually asks for his freedom, much to Richard's dismay. Deeply hurt, Mr. Martin grants his request, but banishes Andrew from the house so that he can be 'completely' free.In 2048, Andrew sees Richard Martin one last time, on his deathbed. Mr. Martin apologizes to Andrew for banishing him, telling him it was Andrew's right to have his freedom.Andrew sets out to find other NDR series robots and discover if they have also developed personalities of their own. He spends years searching, but finds none functioning. Finally, he stumbles across Galatea, an NDR robot that has been given female attributes and is owned by Rupert Burns, son of the original NDR robot designer. Andrew is attracted to Galatea after seeing her dance, but soon discovers that her personality chip was activated. She becomes a source of great annoyance to Andrew: her personality was implanted by the manufacturers, whereas his developed independently of programming. As it turns out, her owner, Burns, has been working to create a more human looking robot on his own, but has been unable to attract funding for the project. Andrew Martin agrees to finance Burns' research and the two join forces to revolutionize robotics - in the course of which they also revolutionize the field of human prosthetic organs.Over the years, he maintains contact with Amanda, grown-up, married, divorced, and with children of her own - who resent Andrew's friendship with their mother. Eventually, Andrew becomes human enough to fall in love with Amanda's granddaughter, Portia, and she with him.Andrew Martin petitions the World Congress to recognize him as human, which would allow him and Portia to be legally married, but is rejected on the grounds that so long as he is in effect immortal, he cannot be human. Over the course of the next 100 years, he proceeds to turn himself into a prosthetic human, thus allowing him to age. Andrew again attends the World Congress, now appearing old and frail. The Speaker of said Congress agrees to debate the issue and asks him why he wants this. He replies: \"To be acknowledged for who and what I am; no more, no less. Not for acclaim, not for approval, but the simple truth of that recognition has been the elemental drive of my existence and it must be achieved if I am to live or die with dignity.\"Andrew Martin is on his death bed, Portia beside him, when the Speaker of the World Congress finally announces on television the court's decision: that Andrew Martin is recognized as the oldest, non-biblical human being in history, aged 200 years old. The Speaker also finally validates the marriage between Portia and Andrew. Andrew dies while listening to the broadcast. Portia orders their nurse, Galatea, now recognizably human, to unplug her, i.e., shut down her life support machine. The movie ends with Portia about to die hand-in-hand with Andrew, as she whispers to him \"See you soon.\"Bangs_McCoy(Source: WikiPedia and Bangs_McCoy)."
}