{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/vRTKNKNWLZ22fAgPa5kY8wT2b1F.jpg",
  "id": 284,
  "title": "The Apartment",
  "poster_path": "https://image.tmdb.org/t/p/w500/hhSRt1KKfRT0yEhEtRW3qp31JFU.jpg",
  "release_date": "1960-06-21",
  "vote_average": 8.217,
  "vote_count": 2099,
  "popularity": 31.419,
  "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
  "imdb_id": "tt0053604",
  "budget": 3000000,
  "homepage": "",
  "revenue": 25000000,
  "runtime": 125,
  "tagline": "Movie-wise, there has never been anything like it - laugh-wise, love-wise, or otherwise-wise!",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "production_companies": [
    "The Mirisch Company",
    "United Artists"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Jack Lemmon",
        "character": "C.C. Baxter"
      },
      {
        "name": "Shirley MacLaine",
        "character": "Fran Kubelik"
      },
      {
        "name": "Fred MacMurray",
        "character": "Jeff D. Sheldrake"
      },
      {
        "name": "Ray Walston",
        "character": "Joe Dobisch"
      },
      {
        "name": "Jack Kruschen",
        "character": "Dr. Dreyfuss"
      },
      {
        "name": "David Lewis",
        "character": "Al Kirkeby"
      },
      {
        "name": "Hope Holiday",
        "character": "Mrs. Margie MacDougall"
      },
      {
        "name": "Joan Shawlee",
        "character": "Sylvia"
      },
      {
        "name": "Naomi Stevens",
        "character": "Mrs. Mildred Dreyfuss"
      },
      {
        "name": "Johnny Seven",
        "character": "Karl Matuschka"
      },
      {
        "name": "Joyce Jameson",
        "character": "The Blonde"
      },
      {
        "name": "Willard Waterman",
        "character": "Mr. Vanderhoff"
      },
      {
        "name": "David White",
        "character": "Mr. Eichelberger"
      },
      {
        "name": "Edie Adams",
        "character": "Miss Olsen"
      },
      {
        "name": "Dorothy Abbott",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Ralph Moratz",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Joe Palma",
        "character": "Office Maintenance Man (uncredited)"
      },
      {
        "name": "Bill Baldwin",
        "character": "TV Movie Host (uncredited)"
      },
      {
        "name": "Benny Burt",
        "character": "Charlie - Bartender (uncredited)"
      },
      {
        "name": "Lynn Cartwright",
        "character": "Elevator Supervisor with Clicker (uncredited)"
      },
      {
        "name": "Mason Curry",
        "character": "Bit Part (uncredited)"
      },
      {
        "name": "David Macklin",
        "character": "Messenger (uncredited)"
      },
      {
        "name": "Hal Smith",
        "character": "Man in Santa Claus Suit (uncredited)"
      },
      {
        "name": "Paul Bradley",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Steve Carruthers",
        "character": "Restaurant Patron (uncredited)"
      },
      {
        "name": "Dick Cherney",
        "character": "Bar Patron (uncredited)"
      },
      {
        "name": "Franklyn Farnum",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Herschel Graham",
        "character": "Restaurant Patron (uncredited)"
      },
      {
        "name": "Lars Hensen",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Eugene Jackson",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Frances Weintraub Lax",
        "character": "Mrs. Lieberman (uncredited)"
      },
      {
        "name": "William Meader",
        "character": "Executive (uncredited)"
      },
      {
        "name": "Monty O'Grady",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Paul Power",
        "character": "Bar Patron (uncredited)"
      },
      {
        "name": "Tony Regan",
        "character": "Executive (uncredited)"
      },
      {
        "name": "Clark Ross",
        "character": "Restaurant Patron (uncredited)"
      },
      {
        "name": "Norman Stevans",
        "character": "Office Worker (uncredited)"
      },
      {
        "name": "Sid Troy",
        "character": "Williams (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "John Williams",
        "department": "Sound",
        "job": "Orchestrator"
      },
      {
        "name": "Billy Wilder",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Billy Wilder",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Billy Wilder",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "I. A. L. Diamond",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "I. A. L. Diamond",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Doane Harrison",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Adolph Deutsch",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Joseph LaShelle",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Daniel Mandell",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Alexandre Trauner",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Alexandre Trauner",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Edward G. Boyle",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Harry Ray",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Allen K. Wood",
        "department": "Production",
        "job": "Production Manager"
      },
      {
        "name": "Milt Rice",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Don Stott",
        "department": "Lighting",
        "job": "Gaffer"
      },
      {
        "name": "Hal W. Polaire",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Robert Martin",
        "department": "Sound",
        "job": "Boom Operator"
      },
      {
        "name": "Fred Lau",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Sid Sidney",
        "department": "Sound",
        "job": "Music Editor"
      },
      {
        "name": "Joe Palma",
        "department": "Crew",
        "job": "Stand In"
      },
      {
        "name": "Alice Monte",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "David Salven",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Del Harris",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "William Schurr",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Miriam Nelson",
        "department": "Crew",
        "job": "Choreographer"
      },
      {
        "name": "May Wale Brown",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Tom Plews",
        "department": "Art",
        "job": "Property Master"
      },
      {
        "name": "Gordon Sawyer",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Forrest T. Butler",
        "department": "Costume & Make-Up",
        "job": "Costume Designer"
      }
    ]
  },
  "keywords": [
    "new year's eve",
    "new york city",
    "lovesickness",
    "clerk",
    "winter",
    "age difference",
    "suicide attempt",
    "office",
    "flat",
    "spaghetti",
    "tennis racket",
    "romantic comedy",
    "black and white",
    "extramarital affair",
    "christmas"
  ],
  "mpaa": "NR",
  "summaries": [
    "A Manhattan insurance clerk tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.",
    "As of November 1, 1959, mild mannered C.C. Baxter has been working at Consolidated Life, an insurance company, for close to four years, and is one of close to thirty-two thousand employees located in their Manhattan head office. To distinguish himself from all the other lowly cogs in the company in the hopes of moving up the corporate ladder, he often works late, but only because he can't get into his apartment, located off of Central Park West, since he has provided it to a handful of company executives - Mssrs. Dobisch, Kirkeby, Vanderhoff and Eichelberger - on a rotating basis for their extramarital liaisons in return for a good word to the personnel director, Jeff D. Sheldrake. When Baxter is called into Sheldrake's office for the first time, he learns that it isn't just to be promoted as he expects, but also to add married Sheldrake to the list to who he will lend his apartment. Dobisch, Kirkeby, Vanderhoff and Eichelberger are now feeling neglected as Baxter no longer needs their assistance in moving up.—Huggo",
    "Of all the ways to climb the corporate ladder, C.C. Baxter, a loyal, resourceful, and cooperative clerk in a giant Manhattan insurance firm, has come up with the fastest: lend the key of his convenient bachelor apartment to his womanising bosses. Indeed, Baxter's strategy is infallible, and as the meek but ambitious employee is starting to enjoy the fruit of his labour, he catches the eye of the company's philandering big boss, Jeff D. Sheldrake, who, of course, wants a piece of the action. Now, Baxter can really give his career a boost; however, is there any room left for his blossoming love life?—Nick Riganas",
    "Bud Baxter is a struggling clerk in a huge New York insurance company. He's discovered a quick way to climb the corporate ladder - by lending out his apartment to the executives as a place to take their mistresses. He often has to deal with the aftermath of their visits and one night he's left with a major problem to solve.—Col Needham <col@imdb.com>"
  ],
  "synopsis": "C. C. Baxter (Jack Lemmon) is a lonely office drone for an insurance company in New York City. Four different company managers take turns commandeering Baxter's apartment, which is located on West 67th Street on the Upper West Side, for their various extramarital liaisons. Unhappy with the situation, but unwilling to challenge them directly, he juggles their conflicting demands while hoping to catch the eye of fetching elevator operator Fran Kubelik (Shirley MacLaine). Meanwhile the neighbors in the apartment building assume Baxter is a \"good time Charlie\" who brings home a different drunken woman every night. Baxter accepts their criticism rather than reveal the truth.The four managers write glowing reports about Baxter a little too glowing, so personnel director Mr. Sheldrake (Fred MacMurray) suspects something illicit behind the praise. Sheldrake lets Baxter's promotion go unchallenged on condition that he be allowed to use the apartment as well, starting that night. Sheldrake gives Baxter two tickets to The Music Man to ensure his absence. Delighted about his promotion, Baxter asks Kubelik to meet him at the theatre. She agrees and it is revealed to the audience that she is Sheldrake's girlfriend, intending to break off their affair that night but is instead charmed by Sheldrake to the apartment. Baxter is disappointed at being stood up, but is willing to forgive Kubelik.At an office party on Christmas Eve, Baxter discovers the relationship between Sheldrake and Kubelik, though he conceals this realization, while Kubelik learns from Sheldrake's secretary that she is merely the latest female employee to be his mistress, the secretary herself having filled that role several years earlier. At the apartment, Kubelik confronts Sheldrake with this information and while he maintains that he genuinely loves her, he leaves to return to his family. Meanwhile, a depressed Baxter picks up a woman in a local bar and, upon returning the apartment, is astounded to find Kubelik in his bed, fully clothed and overdosed on Baxter's sleeping pills.Baxter sends his bar pickup home and enlists the help of his neighbour, a physician, in reviving Kubelik without notifying the authorities. The doctor makes various assumptions about Kubelik and Baxter, which Baxter concedes without revealing Sheldrake's involvement. Baxter later telephones Sheldrake and informs him of the situation, and while Sheldrake professes gratitude for Baxter's quiet handling of the matter, he avoids any further involvement. Kubelik recuperates in Baxter's apartment under his care for two days, during which he tries to entertain and distract her from any possible suicidal afterthoughts, talking her into playing numerous hands of gin rummy, though she is largely uninterested.Baxter and Kubelik's absence from work is noted and commented on, with Baxter's former \"customers\" assuming that Baxter and Kubelik were having an affair. Kubelik's taxi-driver brother-in-law comes looking for her and two of the customers cheerfully direct him to Baxter's apartment, partly out of spite since he has been denying them access since his arrangement with Sheldrake. The brother-in-law also assumes the worst of Baxter and punches him several times.Sheldrake, angered at his secretary for sharing the truth with Kubelik, fires her. She retaliates by telling his wife about his infidelities, leading to the breakup of the marriage. Sheldrake moves into a room at his athletic club and continues to string Kubelik along while he enjoys his newfound bachelorhood. Baxter finally takes a stand when Sheldrake demands the apartment for another liaison with Kubelik on New Year's Eve, which results in Baxter quitting the firm. When Kubelik hears of this from Sheldrake, she realizes that Baxter is the man who truly loves her and abandons him, running to the apartment. Baxter, in the midst of packing to move out, is bewildered by her appearance and her insistence on resuming their earlier game of gin rummy. When he declares his love for her, her reply is the now-famous final line of the movie: \"Shut up and deal.\""
}