{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/8iYqLiWWdapOWxxMimSqtfST2M1.jpg",
  "id": 31011,
  "title": "Mr. Nobody",
  "poster_path": "https://image.tmdb.org/t/p/w500/qNkIONc4Rgmzo23ph7qWp9QfVnW.jpg",
  "release_date": "2009-11-06",
  "vote_average": 7.825,
  "vote_count": 5616,
  "popularity": 23.094,
  "overview": "Nemo Nobody leads an ordinary existence with his wife and 3 children; one day, he wakes up as a mortal centenarian in the year 2092.",
  "imdb_id": "tt0485947",
  "budget": 47000000,
  "homepage": "",
  "revenue": 2331721,
  "runtime": 141,
  "tagline": "Nothing is real, everything is possible.",
  "genres": [
    "Science Fiction",
    "Drama",
    "Romance"
  ],
  "production_companies": [
    "Pan Européenne Production",
    "Virtual Films",
    "Wild Bunch"
  ],
  "production_countries": [
    "BE",
    "CA",
    "FR",
    "DE"
  ],
  "credits": {
    "cast": [
      {
        "name": "Jared Leto",
        "character": "Nemo Nobody (old & adult)"
      },
      {
        "name": "Sarah Polley",
        "character": "Adult Elise"
      },
      {
        "name": "Diane Kruger",
        "character": "Adult Anna"
      },
      {
        "name": "Linh-Dan Pham",
        "character": "Adult Jean"
      },
      {
        "name": "Rhys Ifans",
        "character": "Nemo's Father"
      },
      {
        "name": "Natasha Little",
        "character": "Nemo's Mother"
      },
      {
        "name": "Toby Regbo",
        "character": "Nemo age 16"
      },
      {
        "name": "Juno Temple",
        "character": "Anna age 15"
      },
      {
        "name": "Allan Corduner",
        "character": "Dr. Feldheim"
      },
      {
        "name": "Daniel Mays",
        "character": "Young Journalist"
      },
      {
        "name": "Clare Stone",
        "character": "Elise age 15"
      },
      {
        "name": "Audrey Giacomini",
        "character": "Jean age 15"
      },
      {
        "name": "Thomas Byrne",
        "character": "Nemo age 9"
      },
      {
        "name": "Laura Brumagne",
        "character": "Anna age 9"
      },
      {
        "name": "Noa De Costanzo",
        "character": "Nemo age 5"
      },
      {
        "name": "Léa Thonus",
        "character": "Elise age 9"
      },
      {
        "name": "Anaïs Van Belle",
        "character": "Jean age 9"
      },
      {
        "name": "Harold Manning",
        "character": "TV Host"
      },
      {
        "name": "Pascal Duquenne",
        "character": "Henry"
      },
      {
        "name": "David Schaal",
        "character": "Thug 1"
      },
      {
        "name": "Laurent Capelluto",
        "character": "Man in Black"
      },
      {
        "name": "Harry Cleven",
        "character": "Man in Black 2"
      },
      {
        "name": "Andrew Simms",
        "character": "Showroom Man"
      },
      {
        "name": "Ben Mansfield",
        "character": "Stefano age 22-40"
      },
      {
        "name": "Emily Tilson",
        "character": "Eve"
      },
      {
        "name": "Roline Skehan",
        "character": "Joyce"
      },
      {
        "name": "Anders Morris",
        "character": "Noah"
      },
      {
        "name": "Nathan Boydell",
        "character": "Paul"
      },
      {
        "name": "Vincent Dupont",
        "character": "Michael"
      },
      {
        "name": "Jenna Wheeler-Hughes",
        "character": "Showroom Girl"
      },
      {
        "name": "Valérie-Marie Chadelaud",
        "character": "Showroom Woman"
      },
      {
        "name": "Stéphane Thiry",
        "character": "Male Nurse 1"
      },
      {
        "name": "Bruno Verstraete",
        "character": "Male Nurse 2"
      },
      {
        "name": "Alice van Dormael",
        "character": "Angel of Oblivian 1"
      },
      {
        "name": "Juliette Van Dormael",
        "character": "Angel of Oblivian 2"
      },
      {
        "name": "Tedd Dillon",
        "character": "Texan Man"
      },
      {
        "name": "Melanie Doerr",
        "character": "Texan Woman"
      },
      {
        "name": "Talya Rubin",
        "character": "Shy Woman"
      },
      {
        "name": "Vito DeFilippo",
        "character": "Shy Man"
      },
      {
        "name": "Corey Cleve Bentivegna",
        "character": "Boy of Shy Couple"
      },
      {
        "name": "Sandrine Laroche",
        "character": "Desillusioned Woman"
      },
      {
        "name": "Olivier Bony",
        "character": "Desillusioned Man"
      },
      {
        "name": "Laura Van Hove",
        "character": "Teenage Girl"
      },
      {
        "name": "Jack Proudlove",
        "character": "Teenage Boy"
      },
      {
        "name": "Marc Zinga",
        "character": "Gay Man 1"
      },
      {
        "name": "Martin Swabey",
        "character": "Gay Man 2"
      },
      {
        "name": "Philippe Godeau",
        "character": "Golf Player / Sad Man"
      },
      {
        "name": "Sarah Gravel",
        "character": "Sad Woman"
      },
      {
        "name": "John Canoe",
        "character": "Mohawk Man"
      },
      {
        "name": "Donna Kanerahtenha Jacobs",
        "character": "Mohawk Woman"
      },
      {
        "name": "Fujio Ishimaru",
        "character": "Japanese Gardener"
      },
      {
        "name": "Robin Carette",
        "character": "Nemo 18 months"
      },
      {
        "name": "Hugo Harold-Harrison",
        "character": "Pool Instructor"
      },
      {
        "name": "Sylvie Olivé",
        "character": "Family Mars Mother"
      },
      {
        "name": "Stéphane Taillasson",
        "character": "Famly Mars Father"
      },
      {
        "name": "Jules Taillasson",
        "character": "Family Mars Son"
      },
      {
        "name": "Jan Hammenecker",
        "character": "Shoe Factory Director"
      },
      {
        "name": "Serge Larivière",
        "character": "Shoe Lace Supplier"
      },
      {
        "name": "Leni Parker",
        "character": "Teacher"
      },
      {
        "name": "Katharina Pejcic",
        "character": "Anna's Daughter"
      },
      {
        "name": "Alexander Türk",
        "character": "Anna's Son"
      },
      {
        "name": "Tanya Trombetta",
        "character": "Anna's Friend"
      },
      {
        "name": "Lola Pauwels",
        "character": "Young Stefano's Girlfriend"
      },
      {
        "name": "Daniel Brochu",
        "character": "Peter"
      },
      {
        "name": "Louise Sophia Engel",
        "character": "Nemo & Anna's Daughter"
      },
      {
        "name": "Aaron Landt",
        "character": "Nemo & Anna's Son"
      },
      {
        "name": "Christelle Cornil",
        "character": "Coma Nurse 1"
      },
      {
        "name": "Tawny Andersen",
        "character": "Coma Nurse 2"
      },
      {
        "name": "Christophe Beaucarne",
        "character": "Villa Owner"
      },
      {
        "name": "Jules Eerdekens",
        "character": "Pool Maintenance Collegue 1"
      },
      {
        "name": "Philippe Lévy",
        "character": "Pool Maintenance Collegue 2"
      },
      {
        "name": "Renaud Alcalde",
        "character": "Spaceship Neighbour 1"
      },
      {
        "name": "Dominique Warnier",
        "character": "Spaceship Neighbour 2"
      },
      {
        "name": "Catherine Demaiffe",
        "character": "Tender Nurse"
      },
      {
        "name": "Pierre Chaves",
        "character": "Hotel Entrance Guard"
      },
      {
        "name": "Nicholas Beveney",
        "character": "Black Man Airport"
      },
      {
        "name": "David Kennedy",
        "character": "Thug 2"
      },
      {
        "name": "Josselin Moinet",
        "character": "Morgue Policeman"
      },
      {
        "name": "Virginie Bordes",
        "character": "Continuity Girl"
      },
      {
        "name": "Carlo Mestroni",
        "character": "Police Officer"
      },
      {
        "name": "Nicolas Ross",
        "character": "Anna & Peter's Son"
      },
      {
        "name": "Marie-Ève Beauregard",
        "character": "Anna & Peter's Daughter"
      },
      {
        "name": "Manfred Andrae",
        "character": "Anna's Neighbour"
      },
      {
        "name": "Thi-Mai Nguyen",
        "character": "Prehistoric Pregnant Woman"
      },
      {
        "name": "John Churchill",
        "character": "Boy on Slide"
      }
    ],
    "crew": [
      {
        "name": "Christophe Beaucarne",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Philippe Godeau",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Uwe Bünker",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Susan Shipton",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Nathalie Leborgne",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Jaco Van Dormael",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Jaco Van Dormael",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Regine Constant",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Sylvie Olivé",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Jean-Yves Asselin",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Alessija Lause",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ulla Gothe",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Stéphane Taillasson",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Matyas Veress",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Olivier Rausin",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Stéphane Thiry",
        "department": "Camera",
        "job": "Key Grip"
      },
      {
        "name": "Pierre van Dormael",
        "department": "Sound",
        "job": "Original Music Composer"
      }
    ]
  },
  "keywords": [
    "surrealism",
    "time",
    "multiple storylines",
    "2090s"
  ],
  "mpaa": "R",
  "summaries": [
    "A boy stands on a station platform as a train is about to leave. Should he go with his mother or stay with his father? Infinite possibilities arise from this decision. As long as he doesn't choose, anything is possible.",
    "'Nemo Nobody' is recounting his life story to a reporter. He's less than clear, often times thinking that he is 34 years of age, others, well over 100. But his story becomes more confusing after he does focus on the fact of his current real age.—Huggo",
    "In a utopian future, Nemo is the oldest and last man to ever have the choice of immortality. The film explores Nemo as a young boy faced with an impossible decision: should he stay with his father or go with his mother? The film is based around all of his possible lives that could occur, of which are all dependent on his one decision.—annie-987-514477",
    "It is the year 2092. Nemo Nobody is 118 years old and is the last remaining mortal human on earth, as, due to medical advances, all other humans are immortal. He is being interviewed in order to document his life, but the stories he tells seem to run parallel to each other. How could he be in several places at the same time, living, as it were, multiple lives?—grantss"
  ],
  "synopsis": "In 2092, humanity has conquered mortality through the endless renewal of cells. The world watches in fascination as the 118-year-old Nemo Nobody (Jared Leto), the last mortal on Earth, edges towards death. Curious to know of life before quasi-immortality, they interview Nemo. Dr. Feldheim (Allan Corduner), a psychiatrist, uses hypnosis to help Nemo recall some of his memories, while Nemo relates other memories to a journalist (Daniel Mays). As he is prodded, Nemo makes contradictory statements. He recounts his life at three primary points: at age 9, when his parents divorced, at age 15 when he fell in love, and at age 34 as an adult. All three unfold into their many possible outcomes.\nNemo explains that before birth, children remember everything that will happen in their lives. At the moment of conception, the Angels of Oblivion erase their memory. The Angels, however, forget about Nemo, allowing him to \"remember\" different possible futures for himself. At age 9, at a railway station, he is forced to choose as his mother leaves on a train while his father stays on the platform. In one case, he manages to board the train while in another he stays with his father.Life with mother\nA rebellious Nemo lives with his mother (Natasha Little) and her new partner, Harry (Michael Riley), in Montreal. He sees a new girl, Anna (Diane Kruger), in his school and is immediately smitten. One day on the beach, Anna asks if he would like to swim with her and her friends. Nemo insults her friends and they barely see each other again.In an alternate story line, Nemo admits to Anna he cannot swim; the two spend time together and fall in love. Anna turns out to be Harry's daughter and the two step siblings begin an illicit affair. They pledge their lives to one another. When Harry and Nemo's mother break up, Anna goes to New York with her father, and they lose touch. Years later, Nemo works as a pool cleaner, hoping to run into Anna by chance. They finally see one another at the train station and immediately recognize each other in a crowd of passers-by. After a passionate reunion, Anna announces she is not ready to immediately resume the relationship. She gives him her number, asks him to call her in two days and meet at the lighthouse. However, he loses her number when a sudden downpour makes her note illegible. Nemo waits at the lighthouse every day, but Anna does not come.In a different story-line, Anna and Nemo are married with children. Nemo works at a television studio narrating educational videos. One evening, while returning home, he hits a bird, loses control of his car, plummets into a lake and drowns.Life with father\nNemo stays with his father (Rhys Ifans), who later becomes disabled. He works in a shop and spends his free time at home at the typewriter, writing a science fiction story about a journey to Mars. At a school dance, he meets Elise (Sarah Polley) and falls in love. A few days later, Nemo goes to Elise's house but sees her with her 22-year-old boyfriend. Frustrated, he speeds away on his motorcycle, has an accident and is hospitalized in a vegetative state. Though he can perceive the world through his senses, Nemo cannot move or speak. He detects his parents' reunion at his bedside. Nemo tries to remember the movement of his fingers on the typewriter keyboard and eventually manages to lift a finger as this story line comes to a close.In yet another alternate time-line, Nemo speaks with Elise at her house, and learns that she is still in love with her boyfriend, Stefano. Nemo does not back down and keeps assuring her of his feelings. Finally, Elise gives in and a few years later, they get married. In one version of the story line, Elise dies in an accident on the return from the wedding. Nemo keeps her ashes, having promised her to spread them on Mars. In a far future, Nemo carries Elise's ash to Mars and spreads them on the planet's surface. Aboard the spacecraft traveling back to Earth, he meets Anna. Before they can say much to each other, the ship is destroyed by meteoroids. In an alternate version of events, he works at the same television studio but his assistant drowns instead. The assistant's widow is Anna, whom he recognizes. Another story-line has Nemo and Elise married with three children. However, their marriage is unhappy as Elise suffers from borderline personality disorder and chronic depression. She has attacks of hysteria and, despite Nemo's attempts to save their marriage, ultimately leaves him to pursue Stefano.Alternatively, after being rejected by Elise, Nemo resolves to marry the first girl who will dance with him at the school prom. That night, he dances with Jeanne (Linh Dan Pham). While taking her home, Nemo pledges to marry her and be successful. Despite being successful and have two children, Nemo is unhappy and bored with his life. Nemo writes over all his possessions to Jeanne and leaves his family. Now making all of his decisions randomly via coin toss, he goes to the airport, and pretends to be a passenger named Daniel Jones and is taken to a hotel by a waiting chauffeur. At Jones' hotel room, Nemo is murdered while taking a bath, and his body is dumped in the woods.Running throughout all the many paths his life could take or has taken, the adult Nemo awakens again and again in a surrealistic world dominated by argyle patterns. This setting seems artificial, like a movie set, and often appears to bleed over into his other lives. Following clues that he finds scattered throughout this city, he ultimately arrives at a crumbling, abandoned wooden-framed house. He stumbles upon a DVD player hooked up to a television screen. In the strangely interactive video, the 118-year-old Nemo converses with the 34-year-old one. He explains that the younger man does not exist. This is a universe where Nemo Nobody was never born, and his consciousness is stuck in some sort of limbo. He states that he is experiencing the story from the end and that he must stay alive until 5:50 AM on 12 February 2092.Epilogue\nBefore his death, Mr. Nobody tells the journalist that neither of them exist. They are figments in the mind of the 9-year-old Nemo at the train station, as he was forced to make an impossible choice. The young boy tries to find the correct decision, following each choice to its conclusion. Eventually, the boy takes a third option: to not make the choice at all. He leaves both parents and runs away towards an unknown future. This ambiguous choice somehow leads to him and Anna reuniting happily. The film returns to old Nemo on his death bed. The calculated time arrives and Mr. Nobody's last words are watched by the world. The expansion of the universe comes to a halt and time appears to reverse. The universe ceases to dissipate, and finally begins contracting. Consequently, Nemo's life simplifies itself. He is able to return to his childhood, watch his parents get back together and be with Anna. The 118-year-old man cackles triumphantly as he springs back into awareness with the realization that his younger self has finally found his one true love and life."
}