{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/6gtlv8NYhzEeRyfbIbfeXp5KVJR.jpg",
  "id": 318781,
  "title": "Colonia",
  "poster_path": "https://image.tmdb.org/t/p/w500/p7oGFkMGaQR27R1olN9RoMzg4vS.jpg",
  "release_date": "2015-06-24",
  "vote_average": 7.274,
  "vote_count": 1834,
  "popularity": 23.747,
  "overview": "A young woman's desperate search for her abducted boyfriend draws her into the infamous Colonia Dignidad, a sect nobody ever escaped from.",
  "imdb_id": "tt4005402",
  "budget": 14000000,
  "homepage": "http://screenmediafilms.net/productions/details/1635/Colonia",
  "revenue": 3621046,
  "runtime": 106,
  "tagline": "There is no turning back",
  "genres": [
    "Drama",
    "History"
  ],
  "production_companies": [
    "Majestic Filmproduktion",
    "Rat Pack Filmproduktion",
    "Iris Productions",
    "Fred Films"
  ],
  "production_countries": [
    "DE",
    "GB",
    "FR",
    "LU"
  ],
  "credits": {
    "cast": [
      {
        "name": "Emma Watson",
        "character": "Lena"
      },
      {
        "name": "Daniel Brühl",
        "character": "Daniel"
      },
      {
        "name": "Michael Nyqvist",
        "character": "Paul Schäfer"
      },
      {
        "name": "Richenda Carey",
        "character": "Gisela"
      },
      {
        "name": "Vicky Krieps",
        "character": "Ursel"
      },
      {
        "name": "Jeanne Werner",
        "character": "Doro"
      },
      {
        "name": "Julian Ovenden",
        "character": "Roman"
      },
      {
        "name": "August Zirner",
        "character": "German Ambassador"
      },
      {
        "name": "Martin Wuttke",
        "character": "Niels Biedermann"
      },
      {
        "name": "César Bordón",
        "character": "Manuel Contreras"
      },
      {
        "name": "Nicolás Barsoff",
        "character": "Jorge"
      },
      {
        "name": "Steve Karier",
        "character": "Bernd"
      },
      {
        "name": "Stefan Merki",
        "character": "Rudi"
      },
      {
        "name": "Lucila Gandolfo",
        "character": "Colonia Doctor"
      },
      {
        "name": "Johannes Allmayer",
        "character": "Dieter"
      },
      {
        "name": "Gilles Soeder",
        "character": "Kurt"
      },
      {
        "name": "Katharina Müller-Elmau",
        "character": "Embassy Secretary"
      },
      {
        "name": "Oscar Ali Garci",
        "character": "Interrogator"
      },
      {
        "name": "Etienne Halsdorf",
        "character": "Schäfer's Sprinter #1"
      },
      {
        "name": "Jules Waringo",
        "character": "Schäfer's Sprinter #2"
      },
      {
        "name": "Johannes Frolich",
        "character": "Schäfer's Sprinter #3"
      },
      {
        "name": "Lauren Jane Pringle",
        "character": "Stewardess #1"
      },
      {
        "name": "Alexia Moyano",
        "character": "Stewardess #2"
      },
      {
        "name": "Lydia Stevens",
        "character": "Stewardess #3"
      },
      {
        "name": "Natalia Señorales",
        "character": "Stewardess #4"
      },
      {
        "name": "Melania Lenoir",
        "character": "Stewardess #5"
      },
      {
        "name": "Justina Bustos",
        "character": "Stewardess #6"
      },
      {
        "name": "Paul Herwig",
        "character": "Herbert Klotz"
      },
      {
        "name": "Pietro Gian",
        "character": "Crew Bus Driver"
      },
      {
        "name": "Marcelo Vilaro",
        "character": "General Pinochet"
      },
      {
        "name": "Iván Espeche",
        "character": "Military Officer #1"
      },
      {
        "name": "Gastón Filgueira",
        "character": "Military Officer #2"
      },
      {
        "name": "Martine Conzemius",
        "character": "Colonia Woman"
      },
      {
        "name": "Cuco Wallraff",
        "character": "Military Doctor"
      },
      {
        "name": "Pedro Merlo",
        "character": "Hooded Man"
      },
      {
        "name": "Lalo Rotaveria",
        "character": "Union Leader"
      },
      {
        "name": "Carlos Alejandro López",
        "character": "Soldier #1"
      },
      {
        "name": "Jose Antonio Coello Porras",
        "character": "Soldier #2"
      },
      {
        "name": "Stephan Szasz",
        "character": "Hospital Patient"
      },
      {
        "name": "Edgar Moro",
        "character": "Blond Boy"
      },
      {
        "name": "Jasper Timm",
        "character": "Singing Boy"
      },
      {
        "name": "Ariel Nuñez Di Croce",
        "character": "David London (uncredited)"
      },
      {
        "name": "Éric Gigout",
        "character": "Colonia Man (uncredited)"
      },
      {
        "name": "Herbert Forthuber",
        "character": "Embassy Staffer (uncredited)"
      },
      {
        "name": "Rouven Blessing",
        "character": "Sect Member (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "John Hubbard",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Hansjörg Weißbrich",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Kolja Brandt",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Benjamin Herrmann",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Bernd Lepel",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Bruno Tarrière",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Waldemar Pokromski",
        "department": "Costume & Make-Up",
        "job": "Makeup Designer"
      },
      {
        "name": "Nicole Fischnaller",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Florian Gallenberger",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Florian Gallenberger",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Fernando Velázquez",
        "department": "Sound",
        "job": "Music"
      },
      {
        "name": "Frank Kruse",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Tom Kinninmont",
        "department": "Writing",
        "job": "Co-Writer"
      },
      {
        "name": "André Dziezuk",
        "department": "Sound",
        "job": "Music"
      },
      {
        "name": "Nicolas Steil",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Connie Balduzzi",
        "department": "Costume & Make-Up",
        "job": "Costume Supervisor"
      },
      {
        "name": "Isabelle Dickes",
        "department": "Costume & Make-Up",
        "job": "Assistant Costume Designer"
      },
      {
        "name": "Ken Fitzke",
        "department": "Crew",
        "job": "Special Effects Coordinator"
      },
      {
        "name": "Ralf Schreck",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Nina Knott",
        "department": "Visual Effects",
        "job": "Visual Effects Producer"
      },
      {
        "name": "Dominik Trimborn",
        "department": "Visual Effects",
        "job": "Visual Effects Supervisor"
      },
      {
        "name": "Eugenia Giesbrecht",
        "department": "Costume & Make-Up",
        "job": "Costume Supervisor"
      },
      {
        "name": "Lola Knoblach",
        "department": "Editing",
        "job": "Digital Intermediate"
      },
      {
        "name": "Nick Lowe",
        "department": "Editing",
        "job": "Dialogue Editor"
      },
      {
        "name": "Charlotte Hayward",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Charlotte Hayward",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Torsten Wenzel",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Martin Ware",
        "department": "Production",
        "job": "Casting Associate"
      },
      {
        "name": "Nicolas Tran-Trong",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Alex Aach",
        "department": "Crew",
        "job": "Second Unit Cinematographer"
      },
      {
        "name": "Agustín Barrutia",
        "department": "Lighting",
        "job": "Gaffer"
      },
      {
        "name": "Christopher Chaber",
        "department": "Crew",
        "job": "Visual Effects Editor"
      },
      {
        "name": "Tobias Frank",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Pablo Maestre Galli",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Aixa Torres",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "Agostina De Francesco",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Sylvia Kasel",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Eileen Byrne",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Elodie Steffin",
        "department": "Costume & Make-Up",
        "job": "Assistant Costume Designer"
      },
      {
        "name": "Christian Cottet",
        "department": "Crew",
        "job": "Second Unit Cinematographer"
      },
      {
        "name": "Helder Loureiro Alves Da Silva",
        "department": "Lighting",
        "job": "Gaffer"
      },
      {
        "name": "Yoshua Berkowitz",
        "department": "Camera",
        "job": "Steadicam Operator"
      },
      {
        "name": "Bruno Nicolas",
        "department": "Visual Effects",
        "job": "Visual Effects Supervisor"
      },
      {
        "name": "Michel Schillings",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Klaus Frers",
        "department": "Sound",
        "job": "Music Supervisor"
      },
      {
        "name": "Thomas Binar",
        "department": "Sound",
        "job": "Music Supervisor"
      },
      {
        "name": "Peggy Bernaerts",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Claudine Moureaud",
        "department": "Costume & Make-Up",
        "job": "Makeup Designer"
      },
      {
        "name": "Christian Tröger",
        "department": "Editing",
        "job": "Digital Intermediate"
      }
    ]
  },
  "keywords": [
    "kidnapping",
    "1970s",
    "cult",
    "chile",
    "pinochet regime",
    "religion",
    "torture chamber",
    "religious fundamentalism",
    "military dictatorship",
    "political unrest"
  ],
  "mpaa": "R",
  "summaries": [
    "A young woman's desperate search for her abducted boyfriend draws her into the infamous Colonia Dignidad, a sect nobody has ever escaped from.",
    "Lena and Daniel, a young couple become entangled in the Chilean military coup of 1973. Daniel is abducted by Pinochet's secret police and Lena tracks him to a sealed off area in the South of the country, called Colonia Dignidad. The Colonia presents itself as a charitable mission run by lay preacher Paul Schäfer but, in fact, is a place nobody ever escaped from. Lena decides to join the cult in order to find Daniel. Based on true events.—Producer"
  ],
  "synopsis": "It starts when we see Lena (Emma Watson) working as an air hostess on a Chile bound plane. She then travels into the center of Santiago with the rest of the crew who are shown to be a strong group of friends, (she is particularly close to the pilot, Roman) until their van meets the chaos caused by a left wing political rally. Lena then recognizes her boyfriend Daniel (Daniel Brühl) as a lead speaker of the event. He is surprised and overjoyed to see Lena as her arrival was a surprise after a long time apart.The film then shows us that they are in a serious long distance relationship as she presumably lives in Britain (based on the other crew members' English accents) and he is living in Chile. They kiss each other and Lena picks up the camera to take photos of the moment. After this, we see Daniel developing the photos, most of which are related to his political activities. Whilst eating together, the telephone rings and Daniel is warned by his friend that due an unfolding coup by the Pinochet regime they must vacate the flat immediately. They run onto the street attempting to flee the soldiers who are rounding up everybody. However, they too are caught because Daniel was photographing the event.The army takes the detainees to the main sport stadium in the city at gunpoint, where a man, with his face obscured, identifies anyone who is supposedly against the new right wing government. Daniel is dragged away into a vehicle resembling an ambulance along with other dissidents whilst Lena is free to go.After this Lena goes to meet the other people who were present at Daniel's rally. She asks them to help her find her husband but she is simply told that there is nothing they can do as he has been taken south to a place called Colonia Dignidad (Colony of Dignity), a place that doesn't live up to its name. It is a dark cult from which no one has ever escaped. Dissidents are sent there by the army to suffer, and in return the complex stores their arms.Desperate to rescue her boyfriend, Lena now dressed plainly like a nun with a crucifix takes the bus towards the colony. The colony is in a remote location accessed across several fields from the road, she walks along its high security outer fence towards the main gate, after knocking on the gate she is admitted to the secure complex at which point her passport is confiscated by a senior cult member Gisela (Richenda Carey).Immediately she witnesses the dark nature of the place when a crying child is upset and Lena is admonished for comforting him by a senior cult member. Stripped of her possessions, she is taken to see the leader, Paul Schäfer called Pious (Mikael Nyqvist), who interviews her about why she is there. She lies that she is there to seek God, however she isn't believed. Pious forces her to strip, and we see that she is wearing more modern clothes underneath. He labels her a harlot because of this and she is questioned further. Her lie that she is there because she needs him is believed, at which point she becomes a member of the cult and agrees not to try and leave the complex.Meanwhile, we see that Daniel has been tortured by the army until Pious turns up pretending to be a caring savior of those being tortured by the army. Throughout his recovery from this Daniel plays dumb, pretending to be called Hans. Under this false identity he is given light duties, and when he is caught exploring out of bounds areas, he isn't punished .Through Lena we witness the brutal reality of the place. She must work long hours in a field, in a manner not unlike slavery. Once, after collapsing from exhaustion she is flogged. Begging for water, she is given a bucket full of clean water which she is forbidden from drinking. We see that she is locked in a communal cell at night and that the women who are separated from the men are psychologically abused. They only meet men in what is called a communal parade, performed for important guests. One confused woman Doro (Jeanne Werner) believed she was going to marry a man from this parade who she met only once three years ago. Because of Lena's mistake who tells Gisela about Doro's plans having no idea that it was her secret Doro was taken to a \"men's gathering,\" a form of ritualized abuse where women are told by Pious and their \"fiance\" that they are ugly, dirty, and unloved . This whole marriage sham was cruelly concocted by the cult leaders to cause anguish to the women and Doro ended in hospital while Lena, hidden, watched the gathering. Pious states that breaking a person without harming them physically is an art. He is also shown to be sexually abusing younger children, who were separated from their parents at birth to live a life of slavery.In a hope to meet Daniel, Lena swims naked in a river in order to be taken to the men's gathering, to cleanse her of her \"indecency\". However she didn't see Daniel there as he was trying to escape that night. In doing so he sets off an alarm which calls the men to find \"Hans\" with guns. This means that Lena avoided a beating, and by being a \"retard\" Hans isn't punished. They are unaware of each other's presence in the camp until the next communal parade, where Daniel hears that the army will test Sarin gas on, as he is seen as worthless.Thus they agree to meet in the barn where Lena works each night. Daniel gets there by volunteering for additional work. Accidentally he discovers tunnels under the complex and steeling a camera from the shed he photographs them finding also the room where he was tortured. Next time they meet Daniel gives the photos to Lena who is not pleased with the danger that the photos put them in. With Gisela coming, he hides in the tunnel in the barn whilst Lena hides the photos under a bucket. Lena is now joined by Ursel (Vicky Krieps), Gisela's daughter, a member of her own status, to peel the potatoes. Unequipped for the job, Gisela goes away to get a knife. Seeing upon her return that no peeling has been done, the girls are ordered to move apart and the photos are discovered. Unsuccessfully denying all knowledge Lena appears to be in trouble until Hans steps in to frame his boss saying that he found them in the tool shed. The two are then dismissed, and Lena knocks out Gisela who was escorting her back to her quarters, and she returns to the barn to meet Daniel who found that the next day the Sarin experiment would be performed on him and this is his last chance to escape through tunnels that he believes lead to outside world.So Lena and Ursel (who lived in Colonia since her childhood believing in their ideas, but now is pregnant and disappointed, knowing her baby and probably her as well will be killed by the cult) immediately enter the tunnels following Daniel, who gets them to the other side of the fence. Lena and Daniel escape while Ursel is killed by a tripwire-operated gun. During this time they are being pursued after Pious realizes that Hans is intelligent after discovering in a mattress the sedatives used in the cult's mind-control techniques.Now almost free, they hitchhike to the German embassy in Santiago to get new passports, but they learn that the embassy is in cahoots with the cult, which was founded in Chile by German Neo-Nazis.Despite the embassy being deliberately unhelpful, Lena uses her contacts at the airline to book herself and Daniel onto a flight. Carefully guarding their photos as they are taken to the airport by the ambassador, Lena becomes suspicious about being driven through the back entrance. Locked in a side room she sees that the embassy have brought Pious and the army after them, so she smashes a window and they escape the room just in time. Running through the airport they hear the final call for their flight, despite being told by the embassy they were early, and they can see the plane some distance across the airfield closing its door.As the action intensifies they can see Pious through a window where Daniel spits at the glass. They steal a baggage truck to race towards the plane where Roman orders the door to be opened. Pursued by the cult and the army, they board the plane just in time, leaving Pious trapped on the steps. The army forces the airport control tower to order the plane to not take off. Sensing the danger they are in, and fueled by his loyalty to his good friend Lena, Captain Roman ignores this order and takes off anyway, saving Lena and Daniel.The credits then roll after some information detailing what happened to the real life Pious, who died in 2004 in a Chilean prison."
}