{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/xBSwwkAYl9h8QVG2OxNpSaSgJwr.jpg",
  "id": 43949,
  "title": "Flipped",
  "poster_path": "https://image.tmdb.org/t/p/w500/6zDYFigohwncqFL00MKbFV01dWb.jpg",
  "release_date": "2010-08-06",
  "vote_average": 8.001,
  "vote_count": 2765,
  "popularity": 44.064,
  "overview": "When Juli meets Bryce in the second grade, she knows it's true love. After spending six years trying to convince Bryce the same, she's ready to give up - until he starts to reconsider.",
  "imdb_id": "tt0817177",
  "budget": 14000000,
  "homepage": "http://www.warnerbros.com/flipped",
  "revenue": 1755212,
  "runtime": 89,
  "tagline": "You never forget your first love.",
  "genres": [
    "Romance",
    "Drama"
  ],
  "production_companies": [
    "Reiner / Greisman Productions"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Madeline Carroll",
        "character": "Julianna \"Juli\" Baker"
      },
      {
        "name": "Callan McAuliffe",
        "character": "Bryce Loski"
      },
      {
        "name": "Rebecca De Mornay",
        "character": "Pasty Loski"
      },
      {
        "name": "Anthony Edwards",
        "character": "Steven Loski"
      },
      {
        "name": "John Mahoney",
        "character": "Chet Duncan"
      },
      {
        "name": "Penelope Ann Miller",
        "character": "Trina Baker"
      },
      {
        "name": "Aidan Quinn",
        "character": "Richard Baker"
      },
      {
        "name": "Kevin Weisman",
        "character": "Daniel Baker"
      },
      {
        "name": "Morgan Lily",
        "character": "Young Juli"
      },
      {
        "name": "Ryan Ketzner",
        "character": "Young Bryce"
      },
      {
        "name": "Ashley Taylor",
        "character": "Sherry Stalls"
      },
      {
        "name": "Israel Broussard",
        "character": "Garrett"
      },
      {
        "name": "Cody H. Carolin",
        "character": "Lynetta"
      },
      {
        "name": "Inga R. Wilson",
        "character": "Mrs. Kimble"
      },
      {
        "name": "Michael Bolten",
        "character": "Mark Baker"
      },
      {
        "name": "Shane Harper",
        "character": "Matt Baker"
      },
      {
        "name": "Stefanie Scott",
        "character": "Dana Tressler"
      },
      {
        "name": "Patricia Lentz",
        "character": "Mrs. McClure"
      },
      {
        "name": "Matthew Gold",
        "character": "Eddie Trulock"
      },
      {
        "name": "Wallace Bridges",
        "character": "Tree Worker"
      }
    ],
    "crew": [
      {
        "name": "Bill Coe",
        "department": "Camera",
        "job": "First Assistant Camera"
      },
      {
        "name": "Janet Hirshenson",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Rob Reiner",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Rob Reiner",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Rob Reiner",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Andrew Scheinman",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Thomas Del Ruth",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Robert Leighton",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Jane Jenkins",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Marc Shaiman",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Marc Fishman",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "David Siegel",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "David Siegel",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Martin Shafer",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Alan Greisman",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Liz Glotzer",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Bill Brzeski",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Frank Capra III",
        "department": "Production",
        "job": "Co-Producer"
      },
      {
        "name": "Frank Capra III",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Kelvin McIlwain",
        "department": "Visual Effects",
        "job": "Visual Effects Supervisor"
      },
      {
        "name": "Brian Relyea",
        "department": "Directing",
        "job": "Second Assistant Director"
      },
      {
        "name": "Danielle Berman",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Susan E. Novick",
        "department": "Crew",
        "job": "Post Production Supervisor"
      },
      {
        "name": "Francisco X. Pérez",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Durinda Wood",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Jennifer Corey",
        "department": "Production",
        "job": "Production Supervisor"
      },
      {
        "name": "Ben Glass",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Dennis Liddiard",
        "department": "Costume & Make-Up",
        "job": "Key Makeup Artist"
      },
      {
        "name": "Virginia Burton",
        "department": "Costume & Make-Up",
        "job": "Costume Supervisor"
      },
      {
        "name": "Lorrie Campbell",
        "department": "Art",
        "job": "Set Designer"
      },
      {
        "name": "Nancy Nugent",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "Jon Title",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "Kerry Lyn McKissick",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "David Luckenbach",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "David Luckenbach",
        "department": "Camera",
        "job": "Steadicam Operator"
      },
      {
        "name": "Joe Ondrejko",
        "department": "Art",
        "job": "Construction Coordinator"
      },
      {
        "name": "Daniel J. Leahy",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Dave Robling",
        "department": "Crew",
        "job": "Transportation Coordinator"
      },
      {
        "name": "Banzai Vitale",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Desma Murphy",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Mark Karavite",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Glynna Grimala",
        "department": "Sound",
        "job": "ADR Supervisor"
      },
      {
        "name": "Christopher Brooks",
        "department": "Sound",
        "job": "Music Editor"
      },
      {
        "name": "Allison Bader",
        "department": "Production",
        "job": "Casting Associate"
      },
      {
        "name": "Jody Gaber",
        "department": "Art",
        "job": "Art Department Coordinator"
      },
      {
        "name": "Gayle Wesley",
        "department": "Sound",
        "job": "First Assistant Sound Editor"
      },
      {
        "name": "Patricia Story",
        "department": "Crew",
        "job": "Unit Publicist"
      },
      {
        "name": "Wendelin Van Draanen",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Medusah",
        "department": "Costume & Make-Up",
        "job": "Key Hair Stylist"
      },
      {
        "name": "Marie Larkin",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Russell Tyrrell",
        "department": "Crew",
        "job": "Special Effects Coordinator"
      },
      {
        "name": "Marina Ray",
        "department": "Costume & Make-Up",
        "job": "Assistant Costume Designer"
      },
      {
        "name": "Danny Miller",
        "department": "Editing",
        "job": "First Assistant Editor"
      },
      {
        "name": "Robert Tyrrell",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Paul McIlvaine",
        "department": "Lighting",
        "job": "Chief Lighting Technician"
      },
      {
        "name": "Frank Roughan",
        "department": "Crew",
        "job": "Transportation Captain"
      },
      {
        "name": "Peter Martorano",
        "department": "Production",
        "job": "Location Manager"
      },
      {
        "name": "Perry Dodgson",
        "department": "Sound",
        "job": "Boom Operator"
      },
      {
        "name": "Mo Henry",
        "department": "Editing",
        "job": "Negative Cutter"
      },
      {
        "name": "Gail Carroll-Coe",
        "department": "Crew",
        "job": "Cableman"
      },
      {
        "name": "Jules Carideo",
        "department": "Production",
        "job": "Production Office Coordinator"
      },
      {
        "name": "Robert Eber",
        "department": "Sound",
        "job": "Production Sound Mixer"
      },
      {
        "name": "Andy Hoehn",
        "department": "Camera",
        "job": "First Assistant Camera"
      },
      {
        "name": "Peter Klein",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Paul Goodstein",
        "department": "Camera",
        "job": "Key Grip"
      },
      {
        "name": "Amie McCarthy Winn",
        "department": "Art",
        "job": "Property Master"
      },
      {
        "name": "Ross Jensen",
        "department": "Production",
        "job": "Production Accountant"
      },
      {
        "name": "David Schmidt",
        "department": "Crew",
        "job": "Transportation Captain"
      },
      {
        "name": "Meghan Waldrop",
        "department": "Art",
        "job": "Art Department Assistant"
      },
      {
        "name": "Tom Hanada",
        "department": "Crew",
        "job": "Post Production Assistant"
      },
      {
        "name": "Donavan McDougle",
        "department": "Art",
        "job": "Title Designer"
      },
      {
        "name": "Gary T. Jones",
        "department": "Crew",
        "job": "Stand In"
      }
    ]
  },
  "keywords": [
    "based on novel or book",
    "shyness",
    "family relationships",
    "unrequited love",
    "neighbor",
    "teenage boy",
    "first crush",
    "young love",
    "opposites attract",
    "multiple perspectives",
    "1950s",
    "1960s",
    "based on young adult novel"
  ],
  "mpaa": "PG",
  "summaries": [
    "Two eighth-graders start to have feelings for each other despite being total opposites.",
    "In 1957, when second-graders Bryce Loski and Julianna \"Juli\" Baker first meet, Juli knows it's love, but Bryce isn't so sure and tries to avoid Juli. By the sixth grade, in 1961, Bryce tries to get rid of Juli by dating Sherry Stalls, whom Juli despises. However, Bryce's best friend, Garrett, takes an interest in Sherry and eventually tells her the truth about Bryce asking her out; she doesn't take it well. From Juli's perspective, Bryce returned her feelings, but was shy. After finding out Bryce and Sherry broke up, she thought she could have Bryce back. But then they reconsider their decisions as time goes on. In 1962, Bryce's grandfather Chet Duncan moves in with the family. Chet has different views about Juli. There's a large, old sycamore tree that Juli loves which no one else understands. One day, it's cut down by a group of landscapers so a house can be built there, despite Juli's opposition. She becomes very depressed afterwards, as the tree let her see the world in a more enlightened way. Her father gives her a painting of the tree.",
    "1963. The Loskis and the Bakers have lived across the street from each other since 1957 when the Loskis moved into the neighborhood. They, as families, have never spent any time together socially in the differences especially between the family patriarchs, judgmental Steven Loski who has always viewed the Bakers as beneath him especially since they won't even maintain their yard, while free-spirited Richard Baker has other priorities in life with the family's limited funds to worry too much about what Steven thinks. Juli Baker, now in the eighth grade, has had a crush on classmate Bryce Loski ever since the Loskis were unloading their moving truck when she and Bryce were in the second grade, and Juli looked deep into Bryce's eyes. Bryce, however, has done whatever he felt he needed to do to avoid who he considered overbearing and thus annoying Juli. Bryce's maternal grandfather, Chet Duncan, who recently moved in with the Loskis, sees Juli in a different vein, she the rare soul that is a beacon of light, much like his now deceased wife. Several events in Bryce and Juli's lives are shown this year - seen individually from Bryce and Juli's very different perspectives - that may change the tide in their relationship, the ups and downs which are also affected by external forces combined with the strength or weakness within each of Bryce and Juli.—Huggo",
    "Juli Baker devoutly believes in three things: the sanctity of trees (especially her beloved sycamore), the wholesomeness of the eggs she collects from her backyard flock of chickens, and that someday she will kiss Bryce Loski. Ever since she saw Bryce's dazzling brown eyes back in second grade, Juli has been smitten. Unfortunately, Bryce has never felt the same. Frankly, he thinks Juli Baker is a little weird--after all, what kind of freak raises chickens and sits in trees for fun? Then, in eighth grade, everything changes. Bryce begins to see that Juli's unusual interests and pride in her family are, well, kind of cool. And Juli starts to think that maybe Bryce's dazzling brown eyes are as empty as the rest of Bryce seems to be. After all, what kind of jerk doesn't care about other people's feelings about chickens and trees? With Flipped, mystery author Wendelin Van Draanen has taken a break from her Sammy Keyes series, and the result is flipping fantastic. Bryce and Juli's rants and raves about each other ring so true that teen readers will quickly identify with at least one of these hilarious feuding egos, if not both. A perfect introduction to the adolescent war between the sexes.—anonymous"
  ],
  "synopsis": "In 1957, when second-graders Bryce Loski and Julianna \"Juli\" Baker first meet, Juli knows it's love, but Bryce isn't so sure. Girl-phobic and easily embarrassed, young Bryce does everything he can to keep away as much as possible from Juli for the next six years, which isn't easy since they go to the same school and live across the street from each other. When they start the sixth grade, Bryce hopes that he can get rid of Juli by asking the girl Juli hates the most, Shelly Stalls, out on a date. This plan works for a while, up until his best friend Garrett takes an interest in Shelly and tells her the truth about Bryce asking her out. Juli sees Bryce and Shelly break up and goes back to her regular Bryce-obsessed ways.From Juli's point of view, when she and Bryce first met, he returned her feelings but was just shy and embarrassed. When he \"held her hand\" she thought she would get her first kiss from him in the second grade. Juli knew that she was flipped from then on. After finding out that Bryce and Shelly broke up, she thought she could have her old Bryce back. She spent the whole year smelling his watermelon-scented hair and wondering if she'd ever get her kiss.In 1963, now in seventh grade, Bryce's grandfather Chet Duncan moves in with the family. Chet finds Juli different, special, and a rare kind of girl who's hard to come across. He continues to tell Bryce this with hope. There's a large, old sycamore tree that Juli loves which no one understands. One day, it's cut down by the owner in spite of Juli's protest and dismay. Her voice narrates her love for the tree that let her see the world in a much more enlightened way.Chet and Juli form a strong friendship over time while he helps her work on her messy lawn. Bryce begins to develop feelings for Juli just as Juli begins to question her feelings about Bryce. Her feelings completely disappear when she overhears him and Garrett talking about her mentally challenged uncle, and sees him throwing away the eggs she gave him. When Juli tells Bryce she never wants to speak to him again, she and her family coincidentally get invited to the Loski's house for a sit down dinner, which ends up with Bryce's dad being considerably rude to her family. At the dinner she confronts Bryce about what he said about her uncle and tells him she doesn't want to speak to him again, not ever. During dinner, sitting opposite each other, she never talks or makes eye contact with him. After dinner she apologizes for the way she acted. Bryce is upset that she apologizes, because that means that she doesn't care enough to hold a grudge.She continues to have mixed feelings about Bryce when the school's basket boy auction looms just around the corner. She hears that Shelly plans to bid on Bryce against another one of the school's \"finest\" girls. Bryce thinks that Juli plans on bidding for him after hearing she walked in with a wad of cash (which she wasn't planning on having with her). Just as Bryce begins to worry about what would happen if she does bid for him, she bids all her cash on basket boy number eight, the boy before Bryce.Later, during the basket boy bidding lunch, Bryce and Shelly sit at a table across from Juli and basket boy number 8, Eddie Trulock. With her facing Bryce, he can't help but stare at Juli the whole time. He sees she's having a good time with her date and gets jealous. He leaves Shelly, grabs Juli to talk to her, and attempts to kiss her in front of everyone. She dodges his kiss and flees. Juli gets on her bike and cycles home as fast as she can, with Bryce following. Incredulous, Garrett chases after Bryce for abandoning Shelly, and the two break off their long friendship after a confrontation.Juli arrives home crying. Bryce continuously tries to talk to her, ringing the doorbell, calling her house, knocking on her bedroom window, despite her ignoring him. Finally, one day Juli sees Bryce digging a hole in her front lawn, which infuriates her. Her father said he gave him permission and she watches Bryce continue to dig. After finishing the hole, he leaves. Juli is confused but Bryce returns carrying a baby sycamore tree and places it in the hole. She goes outside to help him. Knowing that he redeemed himself, Bryce covers Juli's hands with his. They share smiles and then continue planting the sycamore tree, both aware that their mutually first kiss won't be long in coming."
}