{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/n8UzZ7gd3lmsBeYAH539pfnwGwu.jpg",
  "id": 455980,
  "title": "Tag",
  "poster_path": "https://image.tmdb.org/t/p/w500/eXXpuW2xaq5Aen9N5prFlARVIvr.jpg",
  "release_date": "2018-05-30",
  "vote_average": 6.709,
  "vote_count": 2929,
  "popularity": 29.511,
  "overview": "For one month every year, five highly competitive friends hit the ground running in a no-holds-barred game of tag they’ve been playing since the first grade. This year, the game coincides with the wedding of their only undefeated player, which should finally make him an easy target. But he knows they’re coming...and he’s ready.",
  "imdb_id": "tt2854926",
  "budget": 28000000,
  "homepage": "https://www.warnerbros.com/movies/tag",
  "revenue": 75100000,
  "runtime": 100,
  "tagline": "Based on a true story. We’re not kidding.",
  "genres": [
    "Comedy",
    "Action"
  ],
  "production_companies": [
    "New Line Cinema",
    "Broken Road Productions",
    "Warner Bros. Pictures"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Ed Helms",
        "character": "Hogan 'Hoagie' Malloy"
      },
      {
        "name": "Jon Hamm",
        "character": "Bob Callahan"
      },
      {
        "name": "Jeremy Renner",
        "character": "Jerry Pierce"
      },
      {
        "name": "Jake Johnson",
        "character": "Randy 'Chilli' Cilliano"
      },
      {
        "name": "Hannibal Buress",
        "character": "Kevin Sable"
      },
      {
        "name": "Annabelle Wallis",
        "character": "Rebecca Crosby"
      },
      {
        "name": "Isla Fisher",
        "character": "Anna Malloy"
      },
      {
        "name": "Rashida Jones",
        "character": "Cheryl Deakins"
      },
      {
        "name": "Leslie Bibb",
        "character": "Susan Rollins"
      },
      {
        "name": "Maxwell Ross",
        "character": "Teen Jerry"
      },
      {
        "name": "Brayden Benson",
        "character": "Young Jerry"
      },
      {
        "name": "Jaren Lewison",
        "character": "Teen Hoagie"
      },
      {
        "name": "Braxton Bjerken",
        "character": "Young Hoagie"
      },
      {
        "name": "Kevin Tyler Moody",
        "character": "Teen Randy"
      },
      {
        "name": "Tyler Crumley",
        "character": "Young Randy"
      },
      {
        "name": "Elijah Marcano",
        "character": "Teen Bob"
      },
      {
        "name": "Braxton Alexander",
        "character": "Young Bob"
      },
      {
        "name": "Xavion Shelton",
        "character": "Teen Kevin"
      },
      {
        "name": "Legend Williams",
        "character": "Young Kevin"
      },
      {
        "name": "Kella Raines",
        "character": "Teen Cheryl"
      },
      {
        "name": "Th'Yana Star",
        "character": "Young Cheryl"
      },
      {
        "name": "Steve Berg",
        "character": "Louis"
      },
      {
        "name": "Nora Dunn",
        "character": "Linda Malloy"
      },
      {
        "name": "Brian Dennehy",
        "character": "Mr. Cilliano"
      },
      {
        "name": "Thomas Middleditch",
        "character": "Dave"
      },
      {
        "name": "Lil Rel Howery",
        "character": "Reggie"
      },
      {
        "name": "Sebastian Maniscalco",
        "character": "Pastor"
      },
      {
        "name": "Indiana Sifuentes",
        "character": "Mexican Jerry"
      },
      {
        "name": "Trayce Malachi",
        "character": "Young Boy in Mall"
      },
      {
        "name": "Jock McKissic",
        "character": "Marvin"
      },
      {
        "name": "Al Mitchell",
        "character": "AA Member"
      },
      {
        "name": "Kate Kneeland",
        "character": "Wedding Caterer"
      },
      {
        "name": "Vince Pisani",
        "character": "Wedding Planner"
      },
      {
        "name": "Kurt Yue",
        "character": "Doctor Yuen"
      },
      {
        "name": "Jim Esposito",
        "character": "Martin - Neighbor"
      },
      {
        "name": "Loren Lott",
        "character": "Sable's Girlfriend"
      },
      {
        "name": "Andrew Tran",
        "character": "Boy Attacker"
      },
      {
        "name": "Carrie Brownstein",
        "character": "Therapist (uncredited)"
      },
      {
        "name": "Courtney Brown",
        "character": "Nurse (uncredited)"
      },
      {
        "name": "Melissa LeEllen",
        "character": "Mall Patron (uncredited)"
      },
      {
        "name": "Donald K. Overstreet",
        "character": "Bar Patron (uncredited)"
      },
      {
        "name": "Grace Pippas",
        "character": "Student (uncredited)"
      },
      {
        "name": "Tatum Price",
        "character": "First Class Passenger (uncredited)"
      },
      {
        "name": "Leslie Sides",
        "character": "Freedom Atlantic Employee (uncredited)"
      },
      {
        "name": "Joey Thurmond",
        "character": "Wedding Guest (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Todd Garner",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Denise Wingate",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Larry Blanford",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "David Sandefur",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Walter Hamada",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Rob McKittrick",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Richard Brener",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Hans Ritter",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Mark Steilen",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Mark Steilen",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Mark Steilen",
        "department": "Writing",
        "job": "Screenstory"
      },
      {
        "name": "Rich Delia",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Helen Britten",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Dave Neustadter",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Germaine Franco",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Jeff Tomsic",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Tara Feldstein Bennett",
        "department": "Production",
        "job": "Casting Director"
      },
      {
        "name": "Josh Crockett",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Sara Romilly",
        "department": "Crew",
        "job": "Post Production Supervisor"
      },
      {
        "name": "Sean Robins",
        "department": "Production",
        "job": "Co-Producer"
      },
      {
        "name": "Jerrid Jones",
        "department": "Sound",
        "job": "Sound Mixer"
      },
      {
        "name": "Serena Reichenbaugh",
        "department": "Sound",
        "job": "Additional Sound Re-Recording Mixer"
      },
      {
        "name": "Will Greenfield",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Christopher H. Warner",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Matthew Groves",
        "department": "Camera",
        "job": "Additional Photography"
      },
      {
        "name": "Michael W. Hoban",
        "department": "Lighting",
        "job": "Rigging Grip"
      }
    ]
  },
  "keywords": [
    "based on true story",
    "travel",
    "game",
    "group of friends",
    "classmates"
  ],
  "mpaa": "R",
  "summaries": [
    "A small group of former classmates organize an elaborate, annual game of tag that requires some to travel all over the country.",
    "Childhood friends Jerry (Jeremy Renner), Callahan (Jon Hamm), Randy (Jake Johnson), Sable (Hannibal Buress) and Hoagie (Ed Helms) have been competing in the same game of tag for 30 years. When Jerry gets married, he attempts to retire from the intense annual game without ever being \"it,\" causing the other four to band together and go to extreme lengths to finally tag him. Directed by Jeff Tomsic. Inspired by the Wall Street Journal article \"It Takes Planning, Caution to Avoid Being It.\"",
    "Hogan \"Hoagie\" Malloy, Bob Callahan, Randy \"Chilli\" Cilliano, Kevin Sable and Jerry Pierce have been playing tag since they were nine years old, starting in 1983, during the month of May. Since then, the group's main rule of the game is that the last one tagged is \"it,\" until next season. With Hoagie having been the last one tagged in the previous year, he first recruits Bob, the CEO of an insurance company, and then Chilli and Kevin for one last attempt to tag Jerry, who has seemingly never been tagged because of his strong athleticism and intelligence. Hoagie tells them that Jerry plans to retire after this year's game because of his upcoming marriage. Rebecca Crosby, a Wall Street Journal reporter doing a piece on Bob, joins them and decides to write an article on the friends. They are also accompanied by Hoagie's wife Anna. Once they arrive at their hometown of Spokane, Washington, they locate Jerry at the local country club where he will be getting married, but they are overwhelmed by Jerry's skill. Jerry then introduces his fiancee Susan. As the others express disappointment over not being invited to the wedding despite their close relationship, Jerry knew he would almost certainly be tagged or at least targeted during the ceremonies. They agree to not play the game at any wedding-related events in exchange for invitations to the wedding. Despite this, the group makes several attempts to tag Jerry both before and right after wedding-related events..",
    "Shockingly based on a true story, the film follows a group of friends who, throughout their entire childhood lives and continuing on into their adulthood, have been playing the same, continuous game of tag every year. However, for this year, they're planning something very special for one of their friends, Jerry. You see, Jerry hasn't been tagged by any of his friends yet and this streak is what the guys are aiming to break. With Jerry having plans on marrying his fiancee and retiring from the game altogether, his friends make it their ultimate mission to tag him once and for all.—Affan Jamsari"
  ],
  "synopsis": "Hogan \"Hoagie\" Malloy (Ed Helms), Bob Callahan (Jon Hamm), Randy \"Chilli\" Cilliano (Jake Johnson), Kevin Sable (Hannibal Buress), and Jerry Pierce (Jeremy Renner) have been playing tag since they were nine years old, starting in 1983, during the month of May. Since then, the group's main rule of the game is that the last one tagged is \"it,\" until next season. With Hoagie having been the last one tagged in the previous year, he first recruits Bob, the CEO of an insurance company, and then Chilli and Kevin for one last attempt to tag Jerry, who has seemingly never been tagged because of his strong athleticism and intelligence. Hoagie tells them that Jerry plans to retire after this year's game because of his upcoming marriage. Rebecca Crosby (Annabelle Wallis), a Wall Street Journal reporter doing a piece on Bob, joins them and decides to write an article on the friends who have been playing tag for 30 yrs. They are also accompanied by Hoagie's outgoing wife (Isla Fisher) Anna.Once they arrive at their hometown of Spokane, Washington, they locate Jerry and lure him to the local country club, but they are overwhelmed by Jerry's skill. Jerry then introduces his fiance Susan. As the others express disappointment over not being invited to the wedding despite their close relationship, Jerry knew he would almost certainly be tagged or at least targeted during the ceremonies. They agree to not play the game at any wedding-related events in exchange for invitations to the wedding. Despite this, the group makes several attempts to tag Jerry both before and right after wedding-related events.The group sneaks into his house at night but are forced to leave when Jerry sets up a convincing ruse that he is actually in Hoagie's bedroom at that exact moment (anticipating that the gang would break into his house to tag him) (Jerry was in his own basement, where he had set up a replica of Hoagie's bedroom and had Skyped the group from there). The next morning, Hoagie disguises himself as an elderly woman and ambushes Jerry at the mall but is defeated and humiliated. Then, at a rehearsal dinner at the country club, Jerry invites Cheryl Deakins (Rashida Jones), Bob and Chilli's high school crush, to distract the group, and the attempt to tag Jerry leaves Hoagie, Chilli, and Kevin all caught in painful traps, set by Jerry. During the rehearsal dinner, Susan reveals to the guys that she is pregnant.Defeated, the group try to build a new plan. After finding out Jerry attends Alcoholics Anonymous meetings, the group decide to strike his next meeting, which is on his wedding day. In preparation, they lock every exit and dress up as members of AA. They make their move and almost tag Jerry, but once he finds himself trapped, Jerry retreats to the communion wine storage. He stays there for hours as the guys besiege the room, until Susan comes by, with the wedding just a few hours away. Susan berates Jerry for risking their wedding for a childish game but suddenly appears to fall faint and have a miscarriage. Jerry comes out to help. Chilli is convinced that it is a ruse, but the situation seems authentic, and Jerry himself also tells them he is not playing around and the two leave.The guys receive texts that the wedding is postponed due to the potential miscarriage. However, a suspicious Anna sees that the bridesmaids all made similar Instagram posts. With one of the bridesmaids having a crush on Bob, and having a private profile, Anna creates a fake profile for Bob in order to bait the bridesmaid for the truth. Once they get access, they see a post from the bridesmaid of Susan in her dress, showing that the wedding is still on schedule. Incensed by the trick, the gang decide to crash the wedding. Upon their arrival, Susan confirms the hoax, including the pregnancy. Angry at Jerry for lying, Hoagie decides to tag Jerry at the end of the ceremony after he and Susan kiss. Hoagie charges at Jerry, but narrowly misses and ends up tackling the pastor to the ground. Hoagie then loses consciousness, which Jerry thinks is a ruse, but Anna confirms that Hoagie's condition is serious and calls for an ambulance.Everyone meets up at the hospital where Hoagie tells them the truth: he had lied about Jerry quitting after the season because he wanted to reunite with his friends after he recently discovered a tumor on his liver and has advanced liver cancer; he may not be alive for the following year. Jerry chooses to swallow his pride and allows Hoagie to tag him. The group starts the game again, running around the hospital as they did as children, and change their rules so Anna and Rebecca can play as well.\nBefore the credits roll, a photograph is displayed, showing the real group of ten men that inspired the film, who continue to play to this day."
}