{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/osHKguxvXPIUJJzsO3DEORZZ8QD.jpg",
  "id": 4564,
  "title": "Sex and the City",
  "poster_path": "https://image.tmdb.org/t/p/w500/AhNfnsGW95RKHQNLdgFH48UN0Zy.jpg",
  "release_date": "2008-05-12",
  "vote_average": 6.569,
  "vote_count": 2018,
  "popularity": 52.214,
  "overview": "A New York writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.",
  "imdb_id": "tt1000774",
  "budget": 65000000,
  "homepage": "http://www.sexandthecitymovie.com/",
  "revenue": 418800000,
  "runtime": 146,
  "tagline": "Get Carried away.",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "production_companies": [
    "Darren Star Productions",
    "New Line Cinema",
    "HBO"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Sarah Jessica Parker",
        "character": "Carrie Bradshaw"
      },
      {
        "name": "Kim Cattrall",
        "character": "Samantha Jones"
      },
      {
        "name": "Kristin Davis",
        "character": "Charlotte York Goldenblatt"
      },
      {
        "name": "Cynthia Nixon",
        "character": "Miranda Hobbes"
      },
      {
        "name": "Chris Noth",
        "character": "Mr. Big"
      },
      {
        "name": "Candice Bergen",
        "character": "Enid Frick"
      },
      {
        "name": "Jennifer Hudson",
        "character": "Louise, Carrie's assistant"
      },
      {
        "name": "David Eigenberg",
        "character": "Steve Brady"
      },
      {
        "name": "Evan Handler",
        "character": "Harry Goldenblatt"
      },
      {
        "name": "Jason Lewis",
        "character": "Smith Jerrod"
      },
      {
        "name": "Mario Cantone",
        "character": "Anthony Marantino"
      },
      {
        "name": "Lynn Cohen",
        "character": "Magda"
      },
      {
        "name": "Willie Garson",
        "character": "Stanford"
      },
      {
        "name": "Joanna Gleason",
        "character": "Therapist"
      },
      {
        "name": "Joseph Pupo",
        "character": "Brady"
      },
      {
        "name": "Alexandra Fong",
        "character": "Lily York Goldenblatt"
      },
      {
        "name": "Parker Fong",
        "character": "Lily York Goldenblatt"
      },
      {
        "name": "Kerry Bishé",
        "character": "Twenty-Something Girl Dreaming"
      },
      {
        "name": "Polina Frantsena",
        "character": "Twenty-Something Girl #1"
      },
      {
        "name": "Kate Rockwell",
        "character": "Twenty-Something Girl #2"
      },
      {
        "name": "Amy Flanagan",
        "character": "Twenty-Something Girl #3"
      },
      {
        "name": "Lena Hall",
        "character": "Twenty-Something Girl #4"
      },
      {
        "name": "Amanda Setton",
        "character": "Girl Slapping Guy"
      },
      {
        "name": "Ching Valdes-Aran",
        "character": "Real Estate Agent"
      },
      {
        "name": "Malcolm Gets",
        "character": "Building Agent"
      },
      {
        "name": "Lorna Kelly",
        "character": "Auctioneer"
      },
      {
        "name": "Daphne Rubin-Vega",
        "character": "Baby Voiced Woman"
      },
      {
        "name": "Patrick DeMarchelier",
        "character": "Vogue Fashion Photographer"
      },
      {
        "name": "André Leon Talley",
        "character": "Vogue Executive"
      },
      {
        "name": "Plum Sykes",
        "character": "Vogue Writer"
      },
      {
        "name": "Lawren Howell",
        "character": "Vogue Fashion Editor"
      },
      {
        "name": "Gucci Westman",
        "character": "Vogue Makeup Artist"
      },
      {
        "name": "Serge Normant",
        "character": "Vogue Hairstylist"
      },
      {
        "name": "Mary Howard",
        "character": "Vogue Set Dresser"
      },
      {
        "name": "Dave Bradford",
        "character": "Flower Delivery Guy"
      },
      {
        "name": "Gilles Marini",
        "character": "Dante"
      },
      {
        "name": "Monica Mayhem",
        "character": "Dante's Girl #1"
      },
      {
        "name": "Gilbert Cruz",
        "character": "Raoul"
      },
      {
        "name": "Damian Young",
        "character": "Karl"
      },
      {
        "name": "Rick Aiello",
        "character": "Angry Driver"
      },
      {
        "name": "Rogelio T. Ramos",
        "character": "Paulo"
      },
      {
        "name": "Rene L. Moreno",
        "character": "Felix"
      },
      {
        "name": "Veanne Cox",
        "character": "Halloween Woman #1"
      },
      {
        "name": "Ricardo Molina",
        "character": "Resort Worker"
      },
      {
        "name": "Annaleigh Ashford",
        "character": "Spoiled Label Queen"
      },
      {
        "name": "Bridget Everett",
        "character": "Drunk Party Girl"
      },
      {
        "name": "Peter Y. Kim",
        "character": "Business Guy"
      },
      {
        "name": "Suzanne Cryer",
        "character": "Dog Rescue Woman"
      },
      {
        "name": "Joshua Henry",
        "character": "Will"
      },
      {
        "name": "Henriette Mantel",
        "character": "Activist #1"
      },
      {
        "name": "Nancy Shayne",
        "character": "Activist #2"
      },
      {
        "name": "Kim Shaw",
        "character": "Valentine's Night Waitress"
      },
      {
        "name": "Michelle M. Kim",
        "character": "Dante's Girl #2"
      },
      {
        "name": "Erica K. Evans",
        "character": "Dante's Girl #3"
      },
      {
        "name": "Roxy DeVille",
        "character": "Dante's Girl #4"
      },
      {
        "name": "Van Hughes",
        "character": "Cater Waiter"
      },
      {
        "name": "Sara Gettelfinger",
        "character": "Flight Attendant"
      },
      {
        "name": "Bridget Regan",
        "character": "Hostess"
      },
      {
        "name": "Dreama Walker",
        "character": "Upper East Side Waitress"
      },
      {
        "name": "Ruby E. Crawford",
        "character": "Louise's Sister"
      },
      {
        "name": "Henry Strozier",
        "character": "Judge"
      },
      {
        "name": "Lisa Kron",
        "character": "Junior's Waitress"
      },
      {
        "name": "Scott Burn",
        "character": "Gucci Salesman"
      },
      {
        "name": "Julie Halston",
        "character": "Bitsy von Muffling (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Sarah Jessica Parker",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Lydia Marks",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Patricia Field",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Jonathan Filley",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Michael Berenbaum",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Buddy Joe Hooker",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Aaron Zigman",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Manolo Blahnik",
        "department": "Costume & Make-Up",
        "job": "Shoe Design"
      },
      {
        "name": "Jeremy Conway",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Toby Emmerich",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Michael Patrick King",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Michael Patrick King",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Michael Patrick King",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Dana Robin",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Ed Check",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Richard Mancuso",
        "department": "Production",
        "job": "Production Accountant"
      },
      {
        "name": "Michael Hilkene",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Odin Benitez",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Bryan Mathison",
        "department": "Costume & Make-Up",
        "job": "Set Costumer"
      },
      {
        "name": "Eric M. Cyphers",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "John Melfi",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Darren Star",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "John Thomas",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Molly Rogers",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Danny Santiago",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Salaam Remi",
        "department": "Crew",
        "job": "Executive Music Producer"
      },
      {
        "name": "Candace Bushnell",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Bernard Telsey",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Richard Brener",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "John Cenatiempo",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Michael Queen",
        "department": "Crew",
        "job": "Production Office Assistant"
      },
      {
        "name": "Chris Cenatiempo",
        "department": "Crew",
        "job": "Stunts"
      }
    ]
  },
  "keywords": [
    "hotel",
    "new year's eve",
    "new york city",
    "forgiveness",
    "city portrait",
    "fashion journal",
    "saint louis",
    "female friendship",
    "romantic comedy",
    "fashion designer",
    "malibu",
    "loss of libido",
    "botox",
    "couples therapy",
    "best friend",
    "wedding",
    "break-up",
    "fashion",
    "manhattan, new york city",
    "desire to have children",
    "female sexuality"
  ],
  "mpaa": "R",
  "summaries": [
    "A New York City writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.",
    "After moving in together in an impossibly beautiful New York apartment, Carrie Bradshaw and Mr. Big make a rather arbitrary decision to get married. The wedding itself proves to be anything but a hasty affair--the guest list quickly blooms from 75 to 200 guests, and Carrie's simple, label-less wedding gown gives way to an enormous creation that makes her look like a gigantic cream puff. An upcoming photo spread in Vogue puts the event--which will take place at the New York Public Library--squarely in the public eye. Meanwhile, Carrie's girlfriends--Samantha, the sexpot; Charlotte, the sweet naïf; and Miranda, the rigid perfectionist--could not be happier. At least, they couldn't be happier for Carrie. Charlotte still has the unrealized hope of getting pregnant. Samantha is finding a loving, committed relationship more grueling than she could have imagined. Miranda unwittingly lets her own unhappiness--created when Steve admits to cheating on her just once--spoil Carrie's. After a heated encounter with Steve, she happens to spot Mr. Big and tells him he's crazy to get married. She's really only thinking of her own marriage. But her angry remark gets Mr. Big to thinking.—J. Spurlin",
    "New York \"Sex and the City\" columnist Carrie Bradshaw and her three best girlfriends - PR maven Samantha Jones, lawyer Miranda Hobbes and art gallery curator Charlotte York - have long mastered one of the two \"L\"s to which she believes all women arriving in New York aspire: labels. As such, the foursome, three years after John Preston AKA Mr. Big professed his love to Carrie and three books by Carrie on their life later, focus on the other \"L\": love. Charlotte believes she has the perfect love life with husband Harry Goldenblatt and their adopted two year old daughter Lily. She is hyper-vigilant in ensuring that that life remains perfect especially in light of some unexpected news on the home front. Extremely self-confident Samantha, now living in Los Angeles with her younger client/boyfriend, actor Smith Jerrod, is in love with him, but feels that she is losing her sense of identity to Smith's rising star. This revelation is even more troubling to her with a handsome new neighbor moving in next door, he who always seems to be having sex with a different woman every night. Miranda and her bartender husband Steve Brady are facing problems maintaining a healthy sex life as Miranda focuses her attentions on caring for their five year old son, Brady Hobbes. This and a subsequent action by Steve places a strain on their love life and marriage. And Carrie and Big make the decision to buy an apartment together. The lavish apartment they choose and the subsequent financial arrangement they embark upon lead to Carrie and Big deciding to get married. Combined with a request by Vogue editor Enid Frick to Carrie, Carrie and Big come to individual views as to the emotional toll on each other of their decision, which is complicated by a statement by Miranda. A result is that Carrie, for the first time, hires a personal assistant, a young woman named Louise from St. Louis who unwittingly helps Carrie come to grips with her personal problems. Through the trials and tribulations of the four in dealing with their respective love lives, they, as always, lend their emotional support to the other three.—Huggo",
    "Mr. Big and Carrie buy a magnificent penthouse in Manhattan and they decide to get married. Enid Frick invites Carrie to take pictures for a special edition of Vogue about marriage of women of forty and something years. During the preparation, Carrie raises the guest list from seventy-five to two hundred guests, and a simple wedding dress to a fashionable Vivienne Westwood, intimidating Mr. Big in his third wedding. Meanwhile Miranda has no sex with Steve and he confesses that he had had one night stand with a woman. On the eve of the wedding, in the rehearsal dinner, the upset Miranda tells Mr. Big that marriage ruins everything. On the next day, the scared Mr. Big calls off the wedding leaving Carrie in the church. Carrie feels humiliated and depressed and Samantha, Miranda and Charlotte decide to travel to Mexico with Carrie to the hotel where she was supposed to spend her honeymoon. When Carries returns, she hires the assistant Louise to help her to organize her life. When Miranda discloses what she told to Mr. Big to Carrie in the rehearsal dinner, their friendship is shaken.—Claudio Carvalho, Rio de Janeiro, Brazil"
  ],
  "synopsis": "Carrie walks through the streets of New York City thinking about events that have happened to her and her friends during Sex and the City. Charlotte is now happily married to Harry Goldenblatt, but she had a hard time getting pregnant - so they adopted a Chinese girl named Lily; Miranda has settled down in Brooklyn with Steve (David Eigenberg) to raise their son Brady together; and Samantha has relocated her business to Los Angeles to be close to Smith (Jason Lewis), who is now a superstar, although she misses her old life and takes every opportunity to fly East to be with Carrie, Miranda and Charlotte.Carrie herself is now in a relationship with Big (Chris Noth), and they are viewing apartments with plans to move in together. Carrie falls in love with a penthouse far from their price range. Big immediately agrees to pay for it. Carrie offers to sell her own apartment, although she also voices her fear that she would have no legal rights to their home in case they separate, as they are not married. To quell her fears, Big suggests that they marry. Carrie announces the news to her friends. Charlotte and Miranda are happy at the news, but Samantha - as Carrie points out dryly - sounds more excited at the thought of Carrie \"finally getting Botox\". Charlotte suggests her longtime gay friend, Anthony Marantino, as the pushy wedding planner.Miranda confesses to her friends that she has been so busy she hasn't had sex with Steve in six months. When Steve confesses, he has cheated on her, Miranda is devastated and immediately separates from him. At Carrie and Big's rehearsal dinner, Steve tries to reconcile with Miranda, but she rebuffs him. Still upset with Steve, she tells Big bluntly that marriage ruins everything.\nOn the wedding day, (partially due to Miranda's words at the rehearsal dinner) Big is too fearful to go through with the ceremony.Carrie, devastated, flees the wedding. Samantha stays behind to clear the guests. Big changes his mind and catches up with Carrie in an attempt to reconcile in the middle of a one-way street. Carrie furiously attacks him with her bouquet while he earns scathing looks from Miranda and Charlotte, as well as from the crowds of New Yorkers watching the scene unfold. To console Carrie (who is depressed, and at the beginning of the holiday doesn't eat anything for two days), the four women take the honeymoon that Carrie had booked to Mexico, where they undergo stress reduction and collect themselves.Upon returning to New York, Carrie hires an assistant, Louise (Jennifer Hudson), to help her manage her life. Miranda eventually confesses to Carrie about what happened at the rehearsal dinner, and the two briefly fall out as Carrie storms out of a restaurant on Valentine's Day. After reflecting on the argument, she had with Carrie, Miranda agrees to attend couples counseling with Steve, and they are eventually able to reconcile. Samantha finds her five-year-old relationship passionless and begins over-eating to keep from cheating on Smith with a gorgeous neighbor, Dante. She eventually realizes that she needs to put herself first, so she says farewell to Smith and moves back to New York. Around the same time, Louise quits her job as Carrie's assistant to get married and move back permanently to her hometown of St Louis.Charlotte learns she is pregnant, and for most of her pregnancy is fearful that something might happen to her baby, so she stops her regular running around Central Park. Carrie puts her fear to rest by telling her that, since she already soiled herself in Mexico, her bad luck is finished. Later, Charlotte has a surprise encounter with Big that leaves her so outraged that her water breaks. Big takes her to the hospital and waits until baby Rose is born, hoping to see Carrie. Harry passes on the message that Big would like her to call him, and that he has written to her frequently, but never received a reply. Carrie searches her correspondence and finds in Louise's personal assistant file that he has sent her dozens of letters copied from the book she read him before their wedding, culminating with one of his own where he apologizes for screwing up and promises to love her forever.Carrie travels to the exquisite penthouse Big had bought for them to collect a pair of brand-new Manolo Blahnik shoes (that later become one of the icons of the movie) that she had left there. She finds Big in the walk-in closet he had built for her, and the moment she sees him, her anger at his betrayal dissipates. They share a passionate kiss, and Big proposes to Carrie properly, using one of her diamond-encrusted shoes in place of a ring.They later marry alone, in a simple wedding in New York City Hall, with Carrie wearing the simple dress that she had intended to wear before being enticed away by the Vivienne Westwood dress that she had modeled in the bridal issue of Vogue. Miranda, Samantha, and Charlotte turn up to surprise Carrie, having been called by Big.The film ends with the four women sipping cosmopolitans, celebrating Samantha's fiftieth birthday, with Carrie making a toast to the next fifty."
}