{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/z8TvnEVRenMSTemxYZwLGqFofgF.jpg",
  "id": 458576,
  "title": "Monster Hunter",
  "poster_path": "https://image.tmdb.org/t/p/w500/1UCOF11QCw8kcqvce8LKOO6pimh.jpg",
  "release_date": "2020-12-03",
  "vote_average": 6.618,
  "vote_count": 3121,
  "popularity": 58.233,
  "overview": "A portal transports Cpt. Artemis and an elite unit of soldiers to a strange world where powerful monsters rule with deadly ferocity. Faced with relentless danger, the team encounters a mysterious hunter who may be their only hope to find a way home.",
  "imdb_id": "tt6475714",
  "budget": 60000000,
  "homepage": "https://www.monsterhunter.movie",
  "revenue": 42145959,
  "runtime": 104,
  "tagline": "Behind our world, there is another.",
  "genres": [
    "Action",
    "Fantasy",
    "Adventure"
  ],
  "production_companies": [
    "Capcom",
    "Constantin Film",
    "Impact Pictures",
    "Tencent Pictures",
    "TOHO"
  ],
  "production_countries": [
    "CN",
    "DE",
    "JP",
    "GB"
  ],
  "credits": {
    "cast": [
      {
        "name": "Milla Jovovich",
        "character": "Artemis"
      },
      {
        "name": "Tony Jaa",
        "character": "The Hunter"
      },
      {
        "name": "Ron Perlman",
        "character": "Admiral"
      },
      {
        "name": "T.I.",
        "character": "Lincoln"
      },
      {
        "name": "Diego Boneta",
        "character": "Marshall"
      },
      {
        "name": "Meagan Good",
        "character": "Dash"
      },
      {
        "name": "Josh Helman",
        "character": "Steeler"
      },
      {
        "name": "Jin Au-Yeung",
        "character": "Axe"
      },
      {
        "name": "Hirona Yamazaki",
        "character": "Handler"
      },
      {
        "name": "Jannik Schümann",
        "character": "Aiden"
      },
      {
        "name": "Nanda Costa",
        "character": "Lea"
      },
      {
        "name": "Nic Rasenti",
        "character": "Captain Roark"
      },
      {
        "name": "Clyde Berning",
        "character": "JSO V22 Pilot #1"
      },
      {
        "name": "Paul Hampshire",
        "character": "JSO Soldier #2"
      },
      {
        "name": "Schelaine Bennett",
        "character": "Comms Officer E3 Sentry"
      },
      {
        "name": "Bart Fouche",
        "character": "Commander West E3 Sentry"
      },
      {
        "name": "Pope Jerrod",
        "character": "E3 Sentry Pilot"
      },
      {
        "name": "Aaron Beelner",
        "character": "Palico"
      },
      {
        "name": "Adrián Muñoz",
        "character": "Hunter #2"
      }
    ],
    "crew": [
      {
        "name": "Paul W. S. Anderson",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Paul W. S. Anderson",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Paul W. S. Anderson",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Jeremy Bolt",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Robert Kulzer",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Paul Haslinger",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Tamara Notcutt",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Martin Moszkowicz",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Glen MacPherson",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Tracy Perkins",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Guy Potgieter",
        "department": "Art",
        "job": "Supervising Art Director"
      },
      {
        "name": "Dennis Berardi",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Calvin Hayward",
        "department": "Production",
        "job": "Production Manager"
      },
      {
        "name": "Danielle Knox",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Doobie White",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Kabelo Bouga Chalatsane",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ahsan Uddin Ahmed",
        "department": "Visual Effects",
        "job": "Visual Effects"
      }
    ]
  },
  "keywords": [
    "giant monster",
    "female soldier",
    "another dimension",
    "bow and arrow",
    "based on video game",
    "swordswoman",
    "dimensional travel"
  ],
  "mpaa": "PG-13",
  "summaries": [
    "When Cpt. Artemis and her loyal soldiers are transported to a new world, they engage in a desperate battle for survival against enormous enemies with incredible powers. Feature film based on the video game by Capcom.",
    "While on a peril-laden mission to track a missing team of soldiers, hard-as-nails U.S. Army Ranger Captain Natalie Artemis and her elite brothers-in-arms find themselves transported to an alternate universe. There, trapped in a barren desert-world rife with formidable adversaries and subterranean sand-dwelling beasts, for the first time, Captain Artemis and her squad are shocked to discover that their otherwise destructive military weapons are now entirely inadequate to take down the enemy. But, unexpectedly, in their desperate battle for survival, the team stumbles upon a mysterious local huntsman whose superior combat skills allow him to stay one step ahead of the mighty creatures. Is there an escape from the prison realm? Above all, what does it take to become a fearless monster hunter?—Nick Riganas",
    "Ranger Captain Natalie Artemis and her six-man Alpha team seeks in a desert area the Bravo team that vanished. Out of the blue, they are surprised by a storm and cross a gateway to another world. They are attacked by an underground monster and a man first warns them and then help them with his bow and arrow. The monster kills two soldiers and Artemins and four soldiers hide in a cave, but they are attacked by spider-like monsters. Artemis is rescued by the Hunter, and they fight each other first. Then they team-up to reach the other side of the sand, and they succeed to kill the monster. The hunter returns to his people and their leader The Admiral offers to help her to return to her world.—Claudio Carvalho, Rio de Janeiro, Brazil"
  ],
  "synopsis": "In the New World where humans co-exist with a wide variety of large and savage monsters, a Hunter, a warrior trained to hunt and kill these powerful creatures, is separated from his team when their ship is attacked by Diablos, a horned subterranean monster.In the real world, United States Army Captain Natalie Artemis and her U.N. security team search for a missing team of soldiers in the desert. A sudden storm pulls them into a portal to the New World where they find the remains of the missing soldiers and their vehicles. As the Diablos approaches them, the Hunter, who is observing the group, fires a warning signal. Impervious to bullets and grenades, the Diablos attacks and kills several members of the squad.The survivors hide in a cave, where they are attacked by a pack of Nerscyllas. Everyone is killed except for Artemis, who runs into the Hunter while trying to escape. They briefly fight before grudgingly agreeing to cooperate. Artemis learns that the portals are created by the Sky Tower, a structure located across the desert. To reach the Tower, the Hunter reveals they will need to kill the Diablos in order to cross the desert safely. Artemis learns how to fight using the Hunter's unique bladed weapons and helps him set a trap for the Diablos to kill it with Nerscylla venom. The attack is successful, with Artemis delivering the finishing blow, but the Hunter is badly wounded. Constructing a makeshift stretcher, Artemis dutifully carries him across the desert.The pair reaches an oasis populated with herbivorous creatures called Apceros. When a Rathalos, a fire-breathing wyvern, flies by and causes the Apceros to stampede, Artemis and the Hunter are rescued by a group of Hunters led by their chieftain: the Admiral. The Admiral explains that the Sky Tower was built by the first civilization to inhabit the New World, using the monsters to protect it. Artemis agrees to help kill the Rathalos so she can return home.In the ensuing battle, Artemis falls through the portal, returning to the real world. The portal doesn't close in time, and the Rathalos emerges and begins wreaking havoc. Artemis is able to slow it down long enough for the Hunter to slip through the portal and deliver the fatal shot. Though she has the chance to stay, Artemis decides to go back to the New World and remain with the Hunters to protect the real world from other monsters. The Admiral approaches her, just before the appearance of another flying monster known as Gore Magala. He notes that as long as the portal remains open, there will always be the threat that monsters will pass through to the real world. Artemis concludes that finding a way to take down the Sky Tower is now their primary objective.In a mid-credits scene, Palico, the Admiral's companion, arrives to help fight the Gore Magala, while an ominous cloaked figure observes the battle from the top of the tower."
}