{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/yBov7O4eXDcBLDpZrOHZzFr8rIl.jpg",
  "id": 459151,
  "title": "The Boss Baby: Family Business",
  "poster_path": "https://image.tmdb.org/t/p/w500/kv2Qk9MKFFQo4WQPaYta599HkJP.jpg",
  "release_date": "2021-07-01",
  "vote_average": 7.4,
  "vote_count": 2388,
  "popularity": 102.39,
  "overview": "The Templeton brothers — Tim and his Boss Baby little bro Ted — have become adults and drifted away from each other. But a new boss baby with a cutting-edge approach and a can-do attitude is about to bring them together again … and inspire a new family business.",
  "imdb_id": "tt6932874",
  "budget": 82000000,
  "homepage": "https://www.dreamworks.com/movies/the-boss-baby-2",
  "revenue": 146745280,
  "runtime": 107,
  "tagline": "Playtime is over.",
  "genres": [
    "Animation",
    "Comedy",
    "Adventure",
    "Family"
  ],
  "production_companies": [
    "DreamWorks Animation"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Alec Baldwin",
        "character": "Theodore Templeton (voice)"
      },
      {
        "name": "James Marsden",
        "character": "Tim Templeton (voice)"
      },
      {
        "name": "Amy Sedaris",
        "character": "Tina Templeton (voice)"
      },
      {
        "name": "Ariana Greenblatt",
        "character": "Tabitha Templeton (voice)"
      },
      {
        "name": "Jeff Goldblum",
        "character": "Dr. Armstrong (voice)"
      },
      {
        "name": "Eva Longoria",
        "character": "Carol Templeton (voice)"
      },
      {
        "name": "James McGrath",
        "character": "Wizzie (voice)"
      },
      {
        "name": "Jimmy Kimmel",
        "character": "Ted Templeton (voice)"
      },
      {
        "name": "Lisa Kudrow",
        "character": "Janice Templeton (voice)"
      },
      {
        "name": "Raphael Alejandro",
        "character": "Nathan / Lead Baby Ninja (voice)"
      },
      {
        "name": "Serenity Reign Brown",
        "character": "Meghan (voice)"
      },
      {
        "name": "David Soren",
        "character": "Jimbo (voice)"
      },
      {
        "name": "Nicholas Gist",
        "character": "The Triplets (voice)"
      },
      {
        "name": "James Ryan",
        "character": "Story Bear (Connie) (voice)"
      },
      {
        "name": "David P. Smith",
        "character": "Movie Patron (voice)"
      },
      {
        "name": "Nova Reed",
        "character": "Little Bo Peep Baby (voice)"
      },
      {
        "name": "Molly K. Gray",
        "character": "Creepy Girl (voice)"
      },
      {
        "name": "Ashlyn Lundahl",
        "character": "'No' Girl (voice)"
      },
      {
        "name": "Dave Needham",
        "character": "Glue Baby (voice)"
      },
      {
        "name": "Tom McGrath",
        "character": "Dr. Tiffany Hamilton (voice)"
      },
      {
        "name": "Reyn Doi",
        "character": "Box Kid (voice)"
      },
      {
        "name": "Collin Erker",
        "character": "Time Out Kid (voice)"
      },
      {
        "name": "Walt Dohrn",
        "character": "Baby Bouncer (voice)"
      },
      {
        "name": "April Lawrence",
        "character": "Acorn Center Computer (voice)"
      },
      {
        "name": "Miles Bakshi",
        "character": "Young Tim Voice-Over (voice)"
      },
      {
        "name": "Kristin Lowe",
        "character": "Pageant Mom 1 (voice)"
      },
      {
        "name": "Marjorie Cohn",
        "character": "Pageant Mom 2 (voice)"
      },
      {
        "name": "Connor Albrecht",
        "character": "Dreidel Kid (voice)"
      }
    ],
    "crew": [
      {
        "name": "Hans Zimmer",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Mark A. Hester",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Michael McCullers",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Michael McCullers",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Michael McCullers",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Tom McGrath",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Tom McGrath",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Beau Borders",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "John Swanson",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Steve Mazzaro",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Michael J. Broomberg",
        "department": "Sound",
        "job": "Foley Artist"
      },
      {
        "name": "Christi Soper Hilt",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Paul N.J. Ottosson",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Paul N.J. Ottosson",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Christian Schaanning",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "James Morioka",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "Andy Schuhler",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Raymond Zibach",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Luke Schwarzweller",
        "department": "Sound",
        "job": "Sound Mix Technician"
      },
      {
        "name": "Pedro Eustache",
        "department": "Sound",
        "job": "Musician"
      },
      {
        "name": "Nelson Yokota",
        "department": "Art",
        "job": "Storyboard Artist"
      },
      {
        "name": "Marla Frazee",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Marla Frazee",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Christopher Brock",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Matt Yocum",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "Jeff Hermann",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Andrew Harkins",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Mary Blee",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Stephen Wood",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Jon Eric Schmidt",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Lisa Curtis Saunders",
        "department": "Visual Effects",
        "job": "Pipeline Technical Director"
      },
      {
        "name": "Angelo Raguso",
        "department": "Sound",
        "job": "Sound Mixer"
      },
      {
        "name": "Carl Roberts",
        "department": "Sound",
        "job": "Foley Recordist"
      },
      {
        "name": "Christopher Gonzalez",
        "department": "Visual Effects",
        "job": "Animation"
      }
    ]
  },
  "keywords": [
    "baby",
    "boss",
    "sequel",
    "sibling",
    "family"
  ],
  "mpaa": "PG",
  "summaries": [
    "The Templeton brothers have become adults and drifted away from each other, but a new boss baby with a cutting-edge approach is about to bring them together again - and inspire a new family business.",
    "In the sequel to DreamWorks Animation's Oscar®-nominated blockbuster comedy, the Templeton brothers--Tim (James Marsden, X-Men franchise) and his Boss Baby little bro Ted (Alec Baldwin)--have become adults and drifted away from each other. Tim is now a married stay-at-home dad. Ted is a hedge fund CEO. But a new boss baby with a cutting-edge approach and a can-do attitude is about to bring them together again.. and inspire a new family business.—DreamWorks",
    "Three long decades after the events of The Boss Baby (2017), Tim, now a stay-at-home dad with two daughters, and his younger brother Ted, now a billionaire CEO, are drifting apart. However, the apple doesn't fall far from the tree. Now, a new boss has emerged, eager to take the reins. Of course, the tiny leader has an audacious plan to thwart a sinister conspiracy. Will Tim and Ted reconnect for the sake of a challenging mission?—Nick Riganas"
  ],
  "synopsis": "Tim Templeton (James Marsden) (Ted Jr.'s older brother, Carol's husband) is now fully grown and lives with his wife Carol (Eva Longoria) and their two daughters, 7-year-old Tabitha (Ariana Greenblatt) and infant Tina (Amy Sedaris). Carol is a successful chef, while Tim is a stay at home husband and cares for the kids.Tim's younger brother Ted (Alec Baldwin) (a former executive of Baby Corp, Tim's younger brother) is now a successful CEO and is never around, but sends lavish gifts to the family. Tabitha is exhibiting more grown-up behavior, and one night while Tim wonders about the person his daughter is becoming, he hears something from Tina's room. He discovers that Tina is from Baby Corp, just as Ted once was, and that she has been assigned to get Ted there for a special mission. Tim refuses to call Ted, saying that he will never come (as he cares for nothing but his work), and encourages Tina to go back to sleep. However, Tina leaves a fake voicemail for Ted (using Tim's recorded voice), luring him to the Templetons' house.The next morning, Ted arrives and Tim explains to him that Tina is a Baby Corp dispatch. Tina introduces the brothers to a new formula that will allow them to turn back into children for 48 hours in order to infiltrate Tabitha's school and figure out what Dr. Erwin Armstrong (Jeff Goldblum), founder and principal of the school, is planning behind parents' backs. Dr Erwin espouses that parents are holding their kids back and Tim believes that he is the reason why Tabitha has been growing ever more distant from him.\nTim and Ted hide from Carol and leave her a note that they are going on a brother bonding trip. This is a good cover for them to complete their mission.At the school, Tim, now as his 7-year-old self, follows Tabitha to her class while baby Ted is placed with other babies. Ted rallies the babies to help him get out of the playroom so that he can go to Armstrong's office to investigate. Tim tries to get sent to the principal's office by disrupting class, but is instead put in \"The Box\" for timeout. Ted discovers that Armstrong is actually a baby himself (and has just built a grown up body around himself), having run away from home after realizing that he was smarter than his parents and now makes money by creating popular phone apps (all of these apps are created by babies who code). His ultimate plan is to get rid of every parent on B-Day (Baby revolution day), so that they cannot tell their children what to do anymore.Tim finds that Tabitha is excelling in her class, except for music. She struggles with the notes and this is putting her performance in the upcoming holiday pageant at risk. Tim speaks to Tabitha (as her classmate Marcos Lightspeed) and understands that Tabitha wants her dad Tim to be proud of her.Tim gets invited by Carol to her house, as Tabitha's friend. There he meets his own parents Ted Templeton Sr. (Jimmy Kimmel) & Janice Templeton (Lisa Kudrow), who tell \"Marcos\" that Tim is an unreliable dad. He had a very active imagination as a kid and imagined seeing his baby brother walk and talk.\n\"Marcos\" helps Tabitha practice for her performance.On the night of the holiday pageant, where Tabitha is supposed to sing a solo, the brothers and Tina plan to expose Armstrong. However, they learn that B-Day is set to happen that night through Armstrong's new app, QT-Snap, which will hypnotize the parents into mindless zombies. Tina tries to organize Ted to try and turn off the master power switch, that will stop the app upload. Tim stops Ted, since Tabitha is due to perform shortly. Both Tim and Ted are caught by Armstrong's ninja babies and are put in The Box, which slowly starts to fill with water. Tabitha sings her solo, but when she sees that Tim has not showed up, she runs off the stage crying. She is consoled by Tina, who reveals her identity and her mission. Tabitha agrees to help her younger sister by getting to the server and shutting down QT-Snap before it can go worldwide. Ted is able to call Precious, Tabitha's pet pony, into the school, as she breaks them out of The Box.Tim and Ted reach the server first, but they are stopped by Armstrong, who calls the zombie parents for backup. Tabitha realizes that Marcos is really Tim. While the brothers hold them back as the formula starts to wear off, Tina and Tabitha get up to the server. Tabitha is able to hack in and pull up the shutdown screen, but is interrupted by Armstrong. The sisters then set off a candy lava volcano using Mentos and soda, destroying the servers and turning all parents back to normal. Tina then reveals that bringing Tim and Ted back together was her true mission. The whole Templeton family gathers to celebrate Christmas, while Armstrong returns to his own family."
}