{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/wD0TCyFkRkol7JkLmO7gp7oZkib.jpg",
  "id": 50544,
  "title": "Friends with Benefits",
  "poster_path": "https://image.tmdb.org/t/p/w500/q4ZAmIIbe2LiLvhQT0q3e6pleYr.jpg",
  "release_date": "2011-07-21",
  "vote_average": 6.651,
  "vote_count": 7567,
  "popularity": 38.602,
  "overview": "Dylan and Jamie think it's going to be easy to add the simple act of sex to their friendship, despite what Hollywood romantic comedies would have them believe. They soon discover however that getting physical really does always lead to complications.",
  "imdb_id": "tt1632708",
  "budget": 35000000,
  "homepage": "https://www.sonypictures.com/movies/friendswithbenefits",
  "revenue": 149500000,
  "runtime": 109,
  "tagline": "Some friends come with a happy ending.",
  "genres": [
    "Romance",
    "Comedy"
  ],
  "production_companies": [
    "Castle Rock Entertainment",
    "Olive Bridge Entertainment",
    "Zucker Productions",
    "Screen Gems"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Justin Timberlake",
        "character": "Dylan Harper"
      },
      {
        "name": "Mila Kunis",
        "character": "Jamie Rellis"
      },
      {
        "name": "Jenna Elfman",
        "character": "Annie Harper"
      },
      {
        "name": "Patricia Clarkson",
        "character": "Lorna"
      },
      {
        "name": "Woody Harrelson",
        "character": "Tommy Bollinger"
      },
      {
        "name": "Richard Jenkins",
        "character": "Mr. Harper"
      },
      {
        "name": "Bryan Greenberg",
        "character": "Parker"
      },
      {
        "name": "Andy Samberg",
        "character": "Quincy"
      },
      {
        "name": "Nolan Gould",
        "character": "Sammy - Sam the Magnificent"
      },
      {
        "name": "Shaun White",
        "character": "Himself"
      },
      {
        "name": "Andrew Fleming",
        "character": "Driver"
      },
      {
        "name": "Catherine Reitman",
        "character": "Female Co-Worker"
      },
      {
        "name": "Courtney Henggeler",
        "character": "Flight Attendant"
      },
      {
        "name": "Masi Oka",
        "character": "Darin Arturo Morena"
      },
      {
        "name": "Tiya Sircar",
        "character": "Hostess"
      },
      {
        "name": "Christopher T. Wood",
        "character": "Ira Ungerleider"
      },
      {
        "name": "Emma Stone",
        "character": "Kayla"
      },
      {
        "name": "Lili Mirojnick",
        "character": "Laura"
      },
      {
        "name": "Rupak Ginn",
        "character": "Male Co-Worker (L.A.)"
      },
      {
        "name": "Duane R. Shepard Sr.",
        "character": "Older Man"
      },
      {
        "name": "Chike Johnson",
        "character": "Taxi Driver"
      },
      {
        "name": "Angelique Cabral",
        "character": "Pam Niborski"
      },
      {
        "name": "Lance Kerfuffle",
        "character": "Security Guard"
      },
      {
        "name": "Jerry Ying",
        "character": "Photographer"
      },
      {
        "name": "Jerry Hyman",
        "character": "Caricaturist"
      },
      {
        "name": "Nick Lee",
        "character": "Dylan's Neighbor"
      },
      {
        "name": "Jason Sung Lee",
        "character": "Dylan's Friend"
      },
      {
        "name": "Michael Morris",
        "character": "Carriage Driver"
      },
      {
        "name": "Brooklyn McLinn",
        "character": "Policeman"
      },
      {
        "name": "Timothy Bish",
        "character": "Dancer"
      },
      {
        "name": "LaJon Dantzler",
        "character": "Dancer"
      },
      {
        "name": "Angel Feliciano",
        "character": "Dancer"
      },
      {
        "name": "Laura Fremont",
        "character": "Dancer"
      },
      {
        "name": "Nicole Guidetti",
        "character": "Dancer"
      },
      {
        "name": "Alicia Mazepa",
        "character": "Dancer"
      },
      {
        "name": "Mayumi Miguel",
        "character": "Dancer"
      },
      {
        "name": "Jermaine Montell",
        "character": "Dancer"
      },
      {
        "name": "Joanna Numata",
        "character": "Dancer"
      },
      {
        "name": "Danielle Polanco",
        "character": "Dancer"
      },
      {
        "name": "Wes Pope",
        "character": "Dancer"
      },
      {
        "name": "Steven Rosa",
        "character": "Dancer"
      },
      {
        "name": "Seth Stewart",
        "character": "Dancer"
      },
      {
        "name": "DeAnna Walters",
        "character": "Dancer"
      },
      {
        "name": "Adam Zotovich",
        "character": "Dancer"
      },
      {
        "name": "Alexandra Gluck",
        "character": "Unaccompanied Minor #1"
      },
      {
        "name": "Taryn Gluck",
        "character": "Unaccompanied Minor #2"
      },
      {
        "name": "Kandé Amadou",
        "character": "Dancer (Flashmob) (uncredited)"
      },
      {
        "name": "Christopher Baskerville",
        "character": "Airport Traveler (uncredited)"
      },
      {
        "name": "Barry Bradford",
        "character": "Basketball Player (uncredited)"
      },
      {
        "name": "Jennifer Brito",
        "character": "FlashMob (uncredited)"
      },
      {
        "name": "William Patrick Brown",
        "character": "Passenger (uncredited)"
      },
      {
        "name": "Jorga Caye",
        "character": "Tour Guide (uncredited)"
      },
      {
        "name": "Tammy Dugen",
        "character": "DeeDee (uncredited)"
      },
      {
        "name": "Teresa Hui",
        "character": "Dancer (uncredited)"
      },
      {
        "name": "Rashida Jones",
        "character": "Maddison (uncredited)"
      },
      {
        "name": "Paul Marra",
        "character": "Tommy's Package Guy (uncredited)"
      },
      {
        "name": "Andrea-Rachel Parker",
        "character": "Flashmob Dancer (uncredited)"
      },
      {
        "name": "Evelina Pereira",
        "character": "Belgian Girl (uncredited)"
      },
      {
        "name": "Alex Phillip",
        "character": "Classmate / Reception Guest (uncredited)"
      },
      {
        "name": "Shane Schoeppner",
        "character": "Airport Diner (uncredited)"
      },
      {
        "name": "Jason Segel",
        "character": "Brice (uncredited)"
      },
      {
        "name": "Uzimann",
        "character": "Hallal Food Vendor (uncredited)"
      },
      {
        "name": "Barbara Vincent",
        "character": "Flash Mob (Grand Central) (uncredited)"
      },
      {
        "name": "James Wallington",
        "character": "Photographer's Assistant (uncredited)"
      },
      {
        "name": "Ryan Dodson",
        "character": "Airport Passenger (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Tia Nolan",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Harley Peyton",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Michael Grady",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Clay Cullen",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Will Gluck",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Will Gluck",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Jimmy N. Roberts",
        "department": "Crew",
        "job": "Stunt Driver"
      },
      {
        "name": "Keith Merryman",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "David A. Newman",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Marcia Hinds",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Bo Johnson",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Lance Gilbert",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Erik Rondell",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Lisa Miller Katz",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Troy Gilbert",
        "department": "Crew",
        "job": "Stunts"
      }
    ]
  },
  "keywords": [
    "friendship",
    "jealousy",
    "job interview",
    "orgasm",
    "love",
    "friends",
    "hospital",
    "beach house",
    "hollywood sign",
    "job hunting",
    "aftercreditsstinger",
    "duringcreditsstinger"
  ],
  "mpaa": "R",
  "summaries": [
    "A young man and woman decide to take their friendship to the next level without becoming a couple, but soon discover that adding sex only leads to complications.",
    "Jamie Rellis (Mila Kunis) is a New York City head-hunter trying to sign Los Angeles-based art director Dylan Harper (Justin Timberlake) for her client. When he takes the job and makes the move, they quickly become friends. Their friendship turns into a friendship with benefits, but with Jamie's emotionally damaged past and Dylan's history of being emotionally unavailable, they have to try to not fall for each other the way Hollywood romantic comedies dictate.—napierslogs",
    "Jamie Rellis and Dylan Harper, on opposite coasts, break up with their lovers: each separately vows to stay out of emotional entanglements. So when Jamie recruits Dylan to manage GQ's art department in New York City - and she's the only person he knows in Manhattan - they decide to become friends with sexual benefits. It works well until Jamie meets a pediatric cardiologist who just might be a match, and Dylan invites her to come home with him to Los Angeles for Thanksgiving. He may be jealous of the doctor, she may be sending new vibes in Dylan's direction, but can either see the signals? And is it inevitable that life imitates art?—<jhailey@hotmail.com>"
  ],
  "synopsis": "Jamie Reillis (Mila Kunis) is an Executive Recruiter for a leading job agency in New York City and Dylan Harper (Justin Timberlake) works as an art director for a small internet company in Los Angeles. Both have recently broken up and are sick of the Hollywood cliche of \"perfect love\" & want to be emotionally unavailable. Jamie has the task of trying to recruit Dylan to interview for a job with GQ magazine and begin working in New York City. Dylan comes to New York and after interviewing for the position learns from Jamie that he has been given an offer to work for GQ. At first Dylan is hesitant to accept and move from his home in Los Angeles to New York, but in an effort to get Dylan to accept the job, Jamie spends the evening taking him around the city trying to sell him on the opportunity and the city.After a fun night together exploring the city (including staring a 'flash mob' to dance to a pop tune in Times Square) Dylan agrees to take the job. The next day Jamie presents Dylan with the contract to sign so she can land her commission for recruiting him. Not knowing anyone else in the city he and Jamie quickly develop a friendship. One night, while hanging out at Jamie's apartment watching a romantic comedy, they get on the topic of sex and relationships. They come to the conclusion that sex should not come with so many emotional attachments. Both feeling the need for a physical connection they agree to have sex without emotion or commitment involved. After several sex related trysts together, Jamie comes to the realization that this isn't really what she wants, and she would like to start dating again and informs Dylan that they need to stop.A few days later, Jamie meets Parker (Bryan Greenberg) and they begin dating. After five dates they consummate their relationship but the next morning Parker leaves and informs Jamie he really wasn't looking for anything more. Furious, Jamie tells Parker off, assuring the end of their relationship. Trying to be sympathetic and to help Jamie get over the pain of the situation Dylan suggests she come with him to California over the July 4th weekend while he visits his family. Jamie is very hesitant but agrees after much persistence from Dylan. They fly to California where Jamie meets his older sister Annie (Jenna Elfman) and father (Richard Jenkins).While in California emotional feelings for each other begin to form and they share a passionate kiss, which leads to a night of close intimacy unlike any they had shared before. However, the next day Jamie overhears a conversation between Annie and Dylan indicating he has no real feelings for her. Hurt, she flies back to New York, alone. A few days later Dylan returns to New York trying to reconcile his friendship with Jamie and find out why she has been ignoring him. He finally finds Jamie and she informs him she overheard everything he said and has no interest in maintaining any kind of a friendship with him.Soon after this Jamie discovers that Dylan may be leaving the GQ position for another job, which would affect her commission. She confronts Dylan about this which leads to another argument. Both begin to do some soul searching trying to come to terms with their feelings about their relationship. Jamie spends time with her mother (Patricia Clarkson), while Dylan discusses it with his sister over the phone. His sister informs him that their father, who suffers from the early stages of Alzheimer's disease, will be flying to New York and he needs to be picked up at the airport. While eating at the airport with his father, his father, in a moment of Alzheimer's-induced confusion, incorrectly recognizes a passerby as a woman from his past. Dylan asks him about this woman, and his father, upon regaining his lucidity, says that she was a woman he met in the Navy, that she was the love of his life, and regrets decisions he made in his youth to let her go.Dylan realizes how he feels about Jamie and after a talk with his friend and coworker, Tommy (Woody Harrelson), decides to go after her. He calls Jamie's mother to set up an excuse to get Jamie to go to Grand Central Station thinking she will be picking her mother up and arranges to have another flash mob scene set up to surprise Jamie at Grand Central. When the moment comes, he catches up with Jamie and tells her how he really feels. Surprised and happy by this turn of events Jamie tells him to kiss her. After sharing a kiss Dylan suggests it is time they go on their first real date.\nThey go to the cafe across the street, and although they attempt to keep the date casual and relaxed, the film ends with them in a sensual embrace and passionate kiss."
}