{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/mzFlwK2WN5KGCgEc4ExJmooJy97.jpg",
  "id": 539681,
  "title": "DC League of Super-Pets",
  "poster_path": "https://image.tmdb.org/t/p/w500/qpPMewlugFaejXjz4YNDnpTniFX.jpg",
  "release_date": "2022-07-27",
  "vote_average": 7.296,
  "vote_count": 1416,
  "popularity": 52.623,
  "overview": "When Superman and the rest of the Justice League are kidnapped, Krypto the Super-Dog must convince a rag-tag shelter pack - Ace the hound, PB the potbellied pig, Merton the turtle and Chip the squirrel - to master their own newfound powers and help him rescue the superheroes.",
  "imdb_id": "tt8912936",
  "budget": 90000000,
  "homepage": "https://www.dcleagueofsuperpets.com",
  "revenue": 203000000,
  "runtime": 105,
  "tagline": "Sit, stay, save the world.",
  "genres": [
    "Animation",
    "Action",
    "Family",
    "Comedy",
    "Science Fiction"
  ],
  "production_companies": [
    "Warner Bros. Pictures Animation",
    "DC Entertainment",
    "Seven Bucks Productions",
    "Warner Bros. Pictures"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Dwayne Johnson",
        "character": "Krypto the Superdog (voice)"
      },
      {
        "name": "Kevin Hart",
        "character": "Ace the Bat-Hound (voice)"
      },
      {
        "name": "John Krasinski",
        "character": "Clark Kent / Superman (voice)"
      },
      {
        "name": "Keanu Reeves",
        "character": "Bruce Wayne / Batman (voice)"
      },
      {
        "name": "Kate McKinnon",
        "character": "Lulu (voice)"
      },
      {
        "name": "Vanessa Bayer",
        "character": "PB (voice)"
      },
      {
        "name": "Natasha Lyonne",
        "character": "Merton (voice)"
      },
      {
        "name": "Diego Luna",
        "character": "Chip (voice)"
      },
      {
        "name": "Jameela Jamil",
        "character": "Diana Prince / Wonder Woman (voice)"
      },
      {
        "name": "Marc Maron",
        "character": "Lex Luthor (voice)"
      },
      {
        "name": "Dascha Polanco",
        "character": "Jessica Cruz / Green Lantern (voice)"
      },
      {
        "name": "Olivia Wilde",
        "character": "Lois Lane (voice)"
      },
      {
        "name": "Jemaine Clement",
        "character": "Arthur Curry / Aquaman (voice)"
      },
      {
        "name": "Daveed Diggs",
        "character": "Victor Stone / Cyborg (voice)"
      },
      {
        "name": "John Early",
        "character": "Barry Allen / The Flash (voice)"
      },
      {
        "name": "Ben Schwartz",
        "character": "Mark / Fire Guinea Pig (voice)"
      },
      {
        "name": "Thomas Middleditch",
        "character": "Keith / Ice Guinea Pig (voice)"
      },
      {
        "name": "Maya Erskine",
        "character": "Mercy Graves (voice)"
      },
      {
        "name": "Yvette Nicole Brown",
        "character": "Patty (voice)"
      },
      {
        "name": "Alfred Molina",
        "character": "Jor-El (voice)"
      },
      {
        "name": "Lena Headey",
        "character": "Lara (voice)"
      },
      {
        "name": "Keith David",
        "character": "Dog-El (voice)"
      },
      {
        "name": "Busy Philipps",
        "character": "Foofy Dog (voice)"
      },
      {
        "name": "Dan Fogler",
        "character": "Carl / Pilot / Racer (voice)"
      },
      {
        "name": "Winona Bradshaw",
        "character": "Whiskers (voice)"
      },
      {
        "name": "David Pressman",
        "character": "Corgi (voice)"
      },
      {
        "name": "Sam Levine",
        "character": "Waffles / Robot Guards (voice)"
      },
      {
        "name": "Jared Stern",
        "character": "Bathtub Guy / JLA Hotline (voice)"
      },
      {
        "name": "Michelle Morgan",
        "character": "Mech Suit (voice)"
      },
      {
        "name": "Amanda Ames",
        "character": "Guinea-Pigasus (voice)"
      },
      {
        "name": "Gavin McCrillis",
        "character": "Black Kitten (voice)"
      }
    ],
    "crew": [
      {
        "name": "Bob Kane",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Ruth Lambert",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Steve Jablonsky",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Dwayne Johnson",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Jerry Siegel",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Joe Shuster",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Allison Abbate",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Nicholas Stoller",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Glenn Ficarra",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "John Requa",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Jared Stern",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Jared Stern",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Jared Stern",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Bill Finger",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Brian Lynch",
        "department": "Production",
        "job": "Co-Producer"
      },
      {
        "name": "Dany Garcia",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "William Moulton Marston",
        "department": "Writing",
        "job": "Characters"
      },
      {
        "name": "Kathleen Shugrue",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Régis Schuller",
        "department": "Visual Effects",
        "job": "Layout Supervisor"
      },
      {
        "name": "Bill R. Dean",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Sam Levine",
        "department": "Directing",
        "job": "Co-Director"
      },
      {
        "name": "Hiram Garcia",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Kristen Anderson",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "John Whittington",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Season Kent",
        "department": "Sound",
        "job": "Music Supervisor"
      },
      {
        "name": "Courtenay Valenti",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Sharon Taylor",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "David Egan",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Daniela Kriston",
        "department": "Production",
        "job": "Researcher"
      },
      {
        "name": "Camilo Castro",
        "department": "Visual Effects",
        "job": "Character Designer"
      },
      {
        "name": "Jhoanne Reyes",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Emmanuel Blasset",
        "department": "Crew",
        "job": "CG Supervisor"
      },
      {
        "name": "Patricia Hicks",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "David Burgess",
        "department": "Visual Effects",
        "job": "Animation Supervisor"
      },
      {
        "name": "Miles Green",
        "department": "Visual Effects",
        "job": "Effects Supervisor"
      },
      {
        "name": "Feargal Stewart",
        "department": "Crew",
        "job": "CG Supervisor"
      },
      {
        "name": "Joshua Nunn",
        "department": "Lighting",
        "job": "Lighting Supervisor"
      },
      {
        "name": "Kim Taylor",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Vi-Dieu Nguyen",
        "department": "Writing",
        "job": "Head of Story"
      },
      {
        "name": "Tod C. Marsden",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Ryan Carlson",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Chris Leahy",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "John Rix",
        "department": "Crew",
        "job": "CG Supervisor"
      },
      {
        "name": "Eddy Lowinski",
        "department": "Visual Effects",
        "job": "Effects Supervisor"
      }
    ]
  },
  "keywords": [
    "superhero",
    "based on comic",
    "super power",
    "aftercreditsstinger",
    "duringcreditsstinger",
    "evil mastermind",
    "talking animal"
  ],
  "mpaa": "PG",
  "summaries": [
    "Krypto the Super-Dog and Superman are inseparable best friends, sharing the same superpowers and fighting crime side by side in Metropolis. However, Krypto must master his own powers for a rescue mission when Superman is kidnapped.",
    "When the Justice League are captured by Lex Luthor, Superman's dog, Krypto, forms a team of shelter-pets who were given super-powers: A hound named Ace, who becomes super-strong, a pig named PB, who can grow to giant-size, a turtle named Merton, who becomes super-fast, and a squirrel named Chip, who gains electric-powers.",
    "The Justice League are mysteriously kidnapped; it's up to the League of Super Pets to save their masters and defeat Lex Luthor at his own game. But can Krypto save Superman with the help of Batman's dog Ace the Bat-Hound? Standing United against a common threat, The Super Pets will do whatever it takes to save their humans once and for all.—Johnny-the-Film-Sentinel-2187",
    "A group of animals who have superpowers team up to rescue the Justice League as they are trying their best to defeat an evil guinea pig who wants to reunite with her partner and destroy everyone and everything in order to conquer the world.—RECB3"
  ],
  "synopsis": "During the destruction of the planet Krypton, a Kryptonian Labrador Retriever Krypto (Dwayne Johnson) comforts fellow infant survivor Kal-El as they head in an escape pod toward Earth.Years later, now known as the famous superheroes, Krypto and Superman (John Krasinski), they live in the city of Metropolis under their dual identities, Bark and Clark Kent. Clark is a reporter and journalist at the Daily Planet, a newspaper company, and dating Lois Lane (Olivia Wilde), a fellow journalist of whom Krypto is jealous. Whenever Superman is with Lois he tries to keep getting rid of Krypto, which makes him insecure.\nThinking that Krypto needs a friend to distract him, Clark heads to an animal shelter to find one. A Boxer named Ace tries to escape the shelter (he wanted to go to a place called the farm for his freedom), but Krypto stops him. Ace reveals to Krypto that Superman is inside the shelter trying to find a new companion for Krypto. This saddens him.\nLater, Superman and Krypto spot their archenemy, LexCorp CEO Lex Luthor (Marc Maron), reeling in a meteor strapped with orange kryptonite with a tractor beam, intending to gain superpowers (The Orange kryptonite gives powers, instead of taking them like the green one). He is easily defeated as the two are aided by the Justice League (AQuaman (Jemaine Clement) (an Atlantean demigod, superhero, and the king of Atlantis), Cyborg (Daveed Diggs) (a former football player and superhero who gained cybernetics after an accident), Wonder Woman (Jameela Jamil) (an Amazon princess and super-heroine from Themyscira), Green Lantern (Dascha Polanco) (a super-heroine and member of the Green Lantern Corps), The Flash (John Early) (a police forensic scientist and superhero who protects Central City with his immense super-speed) & Batman (Keanu Reeves) (A vigilante superhero who protects Gotham City)).During the fight, Lex manages to break off a small piece of the orange kryptonite while the rest is flung out into space.\nMeanwhile, Lulu (Kate McKinnon) (an evil hairless guinea pig who gains flight and telekinesis through Orange Kryptonite), a guinea pig test subject from LexCorp sent to the shelter, reels in a piece of orange kryptonite with her own tractor beam, which gives her flight and telekinesis. Lulu had figured out, working with Lex, that Orange Kryptonite doesn't work on people, it only works on pets. So, she took whatever parts she found in the shelter and built herself a tractor beam. Lulu uses her powers to escape with a kitten named whiskers, leaving the rest of the animals behind in the shelter.\nUnbeknownst to her, everyone else in the shelter also gains superpowers. Ace (Kevin Hart) is now super-strong and indestructible; PB (Vanessa Bayer), a potbellied pig, can change size; Merton (Natasha Lyonne), a nearsighted turtle, becomes super-fast; and Chip (Diego Luna), a paranoid squirrel, gains Electrokinesis.\nWhile at home, Superman and Krypto have an argument when the former plans to propose marriage to Lois. However, Clark is captured by Lulu who uses green kryptonite to rob Superman of his powers. Krypto tries to save him, but due to a piece of Jarlsberg cheese inside a Batman toy he ate laced with green kryptonite, he loses his powers. As Krypto wanders the streets, Dog-El (Keith David), Krypto's father appears as a holographic form from Krypto's collar. Dog-El had codified his persona in Krypto's collar before he left kryptonite. Dog-El encourages Krypto not to give up hope and continue finding Superman.\nLater, Krypto comes across the shelter pets (who were enjoying their freedom in the park), who agree to help him, with Ace only agreeing after Krypto blackmails him (Ace had told the crew that they were going to a \"farm\", but Krypto knew that there was no farm and that Ace was bluffing). Krypto offers to take the entire crew to his farm, if they agree to help him save superman.Meanwhile, Lulu recruits a group of guinea pigs (whom she gives superpowers), captures the Justice League, and heads to Stryker's Island to free Luthor. The shelter pets try to stop her, but fail miserably. Krypto manages to get close to Lulu and tells her that Lex tested on her.. She was never Lex's colleague and he only used her to perfect his weapons. But Lulu tells Krypto that Superman was going to marry Lois and leave Krypto. She then tosses Krypto and his team aside.\nThey regroup in the Hall of Justice, where Ace tells a distraught Krypto he used to be the puppy of a family with a toddler. One day, the toddler nearly fell down the stairs when Ace bit her arm and pulled her to safety. Upon seeing the bite-marks, the parents assumed Ace attacked her and sent him to the shelter. However, Ace stands by his actions and ideals. Encouraged, Krypto leads the pets to LexCorp.\nWhile there, a kitten named Whiskers (Winona Bradshaw), who Lulu rescued from the shelter and can now create weapons at will, attacks them and pins them down. Krypto finally learns how to get the pets working together like a team and they trap whiskers. At Stryker's Island, the shelter pets confront Lulu, but put themselves in prison cells when she threatens to kill Krypto. Lulu frees Luthor, who betrays her and locks her in his cell while freeing Mercy Graves (Maya Erskine) (Lex Luthor's Hench-woman and bodyguard). Lulu breaks out easily and decides to destroy the Justice League and Luthor herself. She plans to blow up the entire justice league by herself. If she cant have her owner, Lex, then Krypto wont have Superman.The Kryptonite passes through Krypto's system, restoring his powers. Fearing for their safety, he asks his friends to stay out of harm's way and heads to LexCorp. He defeats the guinea pigs while Lulu traps Luthor in a similar prison as the League's and launches a rocket from the building. The rocket will explode as it hits the atmosphere, killing the entire justice league and Lex with it.\nThis forces Krypto to choose between the Justice League or Lois, who is in a nearby helicopter. He decides to save Lois while his friends help the League. Enraged, Lulu puts the orange kryptonite in her brain, becoming a Kaiju-sized version of herself. The League and the pets team up to stop her. Realizing she has become too powerful, Krypto decides to use the \"Solar Paw Punch\" (you fly close to the sun to absorb enough energy and then slam into the villain to cause a massive explosion), a move that can defeat any super-villain, but will likely kill the user. The attack causes a massive explosion that removes the kryptonite from Lulu's brain and, shortly thereafter, her redeemed henchmen, Mark and Keith, trap her in a hot dog stand. Krypto accepts his fate, but Ace uses his invulnerability to save him.In the aftermath, Krypto allows Clark to marry Lois. The shelter pets, Mark, and Keith get adopted by the rest of the Justice League. Sometime later, the pets have formed their own superhero team called the \"League of Super-Pets\".\nIn a mid-credits scene, Luthor is still trapped in his prison asking any passing super-animals to free him. Meanwhile, Lulu is freed by Mercy, who adopts her.\nIn a post-credits scene, Krypto and Superman encounter Black Adam (Teth-Adam) and his dog, Anubis (Dwayne Johnson). Krypto tricks them into flying to Pluto."
}