{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/ijX7ntgafgVGUaT8I1HkXJcJ3Y0.jpg",
  "id": 657,
  "title": "From Russia with Love",
  "poster_path": "https://image.tmdb.org/t/p/w500/2jUOA4mUm2W7jP61DFeZ77kH0sA.jpg",
  "release_date": "1963-10-10",
  "vote_average": 7.077,
  "vote_count": 2794,
  "popularity": 38.789,
  "overview": "Agent 007 is back in the second installment of the James Bond series, this time battling a secret crime organization known as SPECTRE. Russians Rosa Klebb and Kronsteen are out to snatch a decoding device known as the Lektor, using the ravishing Tatiana to lure Bond into helping them. Bond willingly travels to meet Tatiana in Istanbul, where he must rely on his wits to escape with his life in a series of deadly encounters with the enemy.",
  "imdb_id": "tt0057076",
  "budget": 2500000,
  "homepage": "https://www.mgm.com/movies/from-russia-with-love",
  "revenue": 78900000,
  "runtime": 115,
  "tagline": "The world's masters of murder pull out all the stops to destroy Agent 007!",
  "genres": [
    "Action",
    "Thriller",
    "Adventure"
  ],
  "production_companies": [
    "United Artists",
    "EON Productions",
    "Danjaq"
  ],
  "production_countries": [
    "GB",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Sean Connery",
        "character": "James Bond"
      },
      {
        "name": "Daniela Bianchi",
        "character": "Tatiana 'Tanja' Romanova"
      },
      {
        "name": "Pedro Armendáriz",
        "character": "Ali Kerim Bey"
      },
      {
        "name": "Robert Shaw",
        "character": "Donald 'Red' Grant"
      },
      {
        "name": "Lotte Lenya",
        "character": "Rosa Klebb"
      },
      {
        "name": "Bernard Lee",
        "character": "M"
      },
      {
        "name": "Lois Maxwell",
        "character": "Miss Moneypenny"
      },
      {
        "name": "Eunice Gayson",
        "character": "Sylvia Trench"
      },
      {
        "name": "Walter Gotell",
        "character": "Morzeny"
      },
      {
        "name": "Francis de Wolff",
        "character": "Vavra"
      },
      {
        "name": "George Pastell",
        "character": "Train Conductor"
      },
      {
        "name": "Nadja Regin",
        "character": "Kerim's Mistress"
      },
      {
        "name": "Aliza Gur",
        "character": "Vida"
      },
      {
        "name": "Martine Beswick",
        "character": "Zora"
      },
      {
        "name": "Vladek Sheybal",
        "character": "Kronsteen"
      },
      {
        "name": "Anthony Dawson",
        "character": "Ernst Stavros Blofeld"
      },
      {
        "name": "Lisa Guiraut",
        "character": "Belly Dancer"
      },
      {
        "name": "Hasan Ceylan",
        "character": "Bulgarian Agent"
      },
      {
        "name": "Fred Haggerty",
        "character": "Krilencu"
      },
      {
        "name": "Neville Jason",
        "character": "Kerim's Chauffeur"
      },
      {
        "name": "Peter Bayliss",
        "character": "Benz"
      },
      {
        "name": "Nusret Ataer",
        "character": "Mehmet"
      },
      {
        "name": "Peter Brayham",
        "character": "Rhoda"
      },
      {
        "name": "Desmond Llewelyn",
        "character": "Boothroyd - 'Q'"
      },
      {
        "name": "Jan Williams",
        "character": "Masseuse"
      },
      {
        "name": "Peter Madden",
        "character": "McAdams"
      },
      {
        "name": "Fred Wood",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Bill Brandon",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Moris Farhi",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Alf Mangan",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Dido Plumb",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Ernie Rice",
        "character": "Gypsy (uncredited)"
      },
      {
        "name": "Andre Charisse",
        "character": "Hotel Concierge (uncredited)"
      },
      {
        "name": "Hugo de Vernier",
        "character": "Hotel Porter (uncredited)"
      },
      {
        "name": "Victor Harrington",
        "character": "Chess Tournament Spectator (uncredited)"
      },
      {
        "name": "Barbara Jefford",
        "character": "Tatiana Romanova (voice) (uncredited)"
      },
      {
        "name": "Jim Brady",
        "character": "Krilencu's Henchman (uncredited)"
      },
      {
        "name": "Eric Pohlmann",
        "character": "Ernst Stavro Blofeld (voice) (uncredited)"
      },
      {
        "name": "Bob Simmons",
        "character": "James Bond in Gunbarrel Sequence (uncredited)"
      },
      {
        "name": "Nikki Van der Zyl",
        "character": "Sylvia Trench / Receptionist (voice) (uncredited)"
      },
      {
        "name": "Michael Culver",
        "character": "Man in a Punt (uncredited)"
      },
      {
        "name": "Elizabeth Counsell",
        "character": "Woman in a Punt (uncredited)"
      },
      {
        "name": "Bedri Çavusoglu",
        "character": "Police (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "John Barry",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "John Barry",
        "department": "Sound",
        "job": "Conductor"
      },
      {
        "name": "Sol Gorss",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ian Fleming",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Albert R. Broccoli",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Albert R. Broccoli",
        "department": "Crew",
        "job": "Presenter"
      },
      {
        "name": "Harry Saltzman",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Harry Saltzman",
        "department": "Crew",
        "job": "Presenter"
      },
      {
        "name": "Ted Moore",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Weston Drury Jr.",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "William Hill",
        "department": "Production",
        "job": "Production Manager"
      },
      {
        "name": "Syd Cain",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Terence Young",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Richard Maibaum",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Johanna Harwood",
        "department": "Writing",
        "job": "Adaptation"
      },
      {
        "name": "Peter R. Hunt",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Lionel Bart",
        "department": "Sound",
        "job": "Songs"
      },
      {
        "name": "Jocelyn Rickards",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "John W. Mitchell",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "Paul Rabiger",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Matt Monro",
        "department": "Sound",
        "job": "Theme Song Performance"
      },
      {
        "name": "Frank Ernst",
        "department": "Production",
        "job": "Location Manager"
      },
      {
        "name": "Tex Fuller",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "David C. Anderson",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Frank Hayden",
        "department": "Crew",
        "job": "Stunt Double"
      },
      {
        "name": "Eileen Warwick",
        "department": "Costume & Make-Up",
        "job": "Hairdresser"
      },
      {
        "name": "Eddie Powell",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "John Stears",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Kay Mander",
        "department": "Directing",
        "job": "Continuity"
      },
      {
        "name": "Dinny Powell",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Freda Pearson",
        "department": "Art",
        "job": "Set Dresser"
      },
      {
        "name": "Basil Newall",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "John Winbolt",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "C. Le Mesurier",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "Frank George",
        "department": "Crew",
        "job": "Special Effects Assistant"
      },
      {
        "name": "Gerry Crampton",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Peter Perkins",
        "department": "Crew",
        "job": "Stunt Double"
      },
      {
        "name": "Eileen Sullivan",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Master"
      },
      {
        "name": "Michael White",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "Jack Cooper",
        "department": "Crew",
        "job": "Stunt Double"
      },
      {
        "name": "Robert Brownjohn",
        "department": "Art",
        "job": "Title Designer"
      },
      {
        "name": "Ernie Farrer",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Master"
      },
      {
        "name": "Jimmy Spoard",
        "department": "Camera",
        "job": "Grip"
      },
      {
        "name": "Sergio Strizzi",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Ilhan Filmer",
        "department": "Production",
        "job": "Production Assistant"
      }
    ]
  },
  "keywords": [
    "assassin",
    "london, england",
    "assassination",
    "based on novel or book",
    "venice, italy",
    "england",
    "gypsy",
    "secret mission",
    "spy",
    "secret intelligence service",
    "secret organization",
    "villain",
    "kgb",
    "orient express",
    "zagreb",
    "gondola",
    "phantom",
    "duringcreditsstinger"
  ],
  "mpaa": "PG",
  "summaries": [
    "James Bond willingly falls into an assassination plot involving a naive Russian beauty in order to retrieve a Soviet encryption device that was stolen by S.P.E.C.T.R.E.",
    "James Bond 007 is on the search for a Russian decoding machine, known as \"Lektor\". Bond needs to find this machine, before the evil S.P.E.C.T.R.E. organization discovers it. While being romantically linked with Russian girl, Tatiana Romanova, Bond sneaks his way around Istanbul, while each S.P.E.C.T.R.E. Agent tries to pick him off, including the over powering Donald \"Red\" Grant and ex K.G.B. Agent Rosa Klebb, who knows all of the tricks in the book, and even possesses an incredible poison tipped shoe.—simon_hrdng",
    "Trouble is brewing for James Bond after the death of delusional SPECTRE agent Julius No in Dr. No (1962) when criminal mastermind Number One sets a trap to lure the dangerous MI6 agent to his death. And thirsty for revenge, #1 enlists the help of feared Soviet counter-intelligence operative Colonel Klebb to finish the job. As the calculating chess master Kronsteen concocts a devilishly ingenious assassination plan, Klebb's pawn Tatiana Romanova, a statuesque Soviet Embassy cypher clerk, pretends to defect to help Bond steal a top-secret Lektor decoding device. Now, the promise of affection becomes a weapon in bustling Constantinople, and psychopathic SPECTRE henchman Red Grant is hot on their trail, bent on murder. Will Bond take the bait and meet his end in the fast Orient Express?—Nick Riganas",
    "British agent 007 James Bond has another mission. He must retrieve a device that was stolen by the evil agency SPECTRE. He is teamed up with a female who is forced by SPECTRE to turn against him and eliminate James Bond at all cost or else.—RECB3",
    "James Bond, 007, is sent on a mission to Istanbul to try and acquire a Russian cypher machine known as \"Lektor\" from a defecting Russian Agent. However, the Russians have no knowledge of this, as it is a S.P.E.C.T.R.E. ploy to lure James Bond into a trap, a fitting tribute to their now-dead Agent Dr. No.—Graeme Roy <gsr@cbmamiga.demon.co.uk>"
  ],
  "synopsis": "Seeking revenge against MI6 agent James Bond (Sean Connery) for the death of their agent Dr. No in Jamaica, international criminal organization SPECTRE begins training agents to kill him, before assigning the task to Irish assassin Donald Grant (Robert Shaw). To lure Bond into a trap, SPECTRE's chief planner, Czechoslovak chess grand-master Kronsteen (Vladek Sheybal) (#5), devises a plan to have Bond attempt to procure a Lektor cryptography device from the Soviets from their consulate in Istanbul. He knows the Brits will never pass on an opportunity to get their hands on a Lektor coding device, and that they will assign Bond for the mission.SPECTRE operative Rosa Klebb (Lotte Lenya) (#3), a former SMERSH (Soviet counter-intelligence) colonel, is assigned to oversee the mission and to ensure Grant can carry out Bond's assassination at the right moment. To set the trap, Klebb recruits a cipher clerk (who doesn't yet know that Klebb is no longer working for the Soviets) at the consulate, Tatiana Romanova (Daniela Bianchi) (a Soviet Consulate clerk and Bond's love interest), to unwittingly assist in the plan, tricking her into believing she is still working for SMERSH. Klebb tells Romanova that her job is to seduce Bond, which she accepts reluctantly.In London, Bond is called to a meeting with M (Bernard Lee) and informed that Romanova has requested Bond's help to defect to the West, in exchange for providing British intelligence a Lektor. Exactly as Kronsteen predicted, M suspects a trap but decides to honor Romanova's request. Before departing, Bond is given a special attache case by Q (Desmond Llewelyn), containing several defensive gadgets and an ArmaLite AR-7 sniper rifle, to help on his assignment. Upon arriving in Istanbul, Bond works alongside the head of MI6's branch in the city, Ali Kerim Bey (Pedro Armendáriz), while he awaits word from Romanova.During this time, Kerim is attacked by Soviet agent Krilencu (Fred Haggerty), who causes problems for the men (This was after Grant killed one of the Soviet agents and made it look like the Brits did it), unaware that Grant is shadowing Bond to protect him until he steals the Lektor. Kerim is perplexed as it is not the like the Soviets to disturb the peace like this. He uses a periscope he installed in the Soviet intelligence office (from underneath a 4th century water reservoir) to figure out that Krilencu is back in town..\nAfter an attack on the men while they hide out at a gypsy settlement (Grant intervenes at critical moments to keep Bond out of harm's way, although Kerim is shot in the hand), Kerim assassinates Krilencu with Bond's help before he can flee the city.Eventually, Romanova meets Bond at his hotel suite, where she agrees to provide plans to the consulate for him to help him steal the Lektor. The pair spend the night together, unaware SPECTRE is filming them as part of Kronsteen's plan. Upon receiving the consulate's floor plans from Romanova (Romanova gives them to Bond at the Saint Sofia church, but only after Grant dispatches the Soviet agent trailing her), Bond and Kerim make a plan to steal the Lektor, before all three make haste to escape the city aboard the Orient Express. Once aboard, Kerim discovers a Soviet security officer tailed them, forcing Bond to help him subdue them. While Kerim remains with him to prevent him escaping, Bond returns to Romanova to wait for their rendezvous with one of Kerim's men (Kerim was supposed to stop the train mid-way at the point where his men were supposed to meet him). However, Grant kills Kerim and the Soviet officer, forcing Bond to remain on the train and question Romanova's motive.When the train arrives in Belgrade, Bond passes on news of Kerim's death to one of his sons waiting for them and receives instructions to travel to Zagreb and rendezvous with a British agent named Nash. However, the man he meets is actually Grant, who has already killed Nash and assumed his identity. After drugging Romanova at dinner, Grant overpowers Bond. He quickly reveals that Romanova was a pawn in SPECTRE's plan to acquire the Lektor (while playing Brits and the Soviets against each other) and that he intends to kill both and stage it as a murder-suicide, leaving behind faked blackmail evidence that will scandalize the British intelligence community (the film of Romanova and Bond making love and a letter from ROmanova saying that Bond has to marry her else she will expose him). Bond tricks Grant (by promising him 50 gold coins in his case) into setting off a booby trap in his attache case (a tear gas canister explodes in his face when he opens it) before killing him. Taking the Lektor and the film of their night together, Bond and Romanova leave the train in Istria, Yugoslavia and use Grant's escape plan (Grant had eloquently described how he planned to get away!!). They evade helicopter and boat attacks by SPECTRE agents before reaching safety.Learning of Grant's death and Bond's survival, SPECTRE's enigmatic chairman Ernst Stavro Blofeld (Anthony Dawson) (#1) has Kronsteen executed for his plan's disastrous failure. As the organization promised to sell back the Lektor to the Russians (for a price), Klebb is ordered to recover it and kill Bond. Klebb reaches the pair, while they are resting in a hotel in Venice, and sneaks into their room disguised as a maid. Klebb orders Romanova to leave the room while holding Bond at gunpoint. Romanova then re-enters, tackling Klebb and knocking the pistol to the ground. Klebb and Bond struggle, and Romanova picks up the pistol and kills Klebb. With their mission accomplished, Bond and Romanova spend some time on a romantic boat ride and Bond throws the film into the canal."
}