{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/yQCaNJpqPtfMMvKt51rHghG1J2w.jpg",
  "id": 660,
  "title": "Thunderball",
  "poster_path": "https://image.tmdb.org/t/p/w500/lbi4GzwHe1X5jC5oE8x0RmkNgGH.jpg",
  "release_date": "1965-12-11",
  "vote_average": 6.656,
  "vote_count": 2153,
  "popularity": 39.041,
  "overview": "A criminal organization has obtained two nuclear bombs and are asking for a 100 million pound ransom in the form of diamonds in seven days or they will use the weapons. The secret service sends James Bond to the Bahamas to once again save the world.",
  "imdb_id": "tt0059800",
  "budget": 5500000,
  "homepage": "https://www.mgm.com/movies/thunderball",
  "revenue": 141195658,
  "runtime": 130,
  "tagline": "Look up! Look down! Look out! Here comes the biggest Bond of all!",
  "genres": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "production_companies": [
    "EON Productions"
  ],
  "production_countries": [
    "GB"
  ],
  "credits": {
    "cast": [
      {
        "name": "Sean Connery",
        "character": "James Bond"
      },
      {
        "name": "Claudine Auger",
        "character": "Dominique 'Domino' Derval"
      },
      {
        "name": "Adolfo Celi",
        "character": "Emilio Largo"
      },
      {
        "name": "Luciana Paluzzi",
        "character": "Fiona Volpe"
      },
      {
        "name": "Rik Van Nutter",
        "character": "Felix Leiter"
      },
      {
        "name": "Guy Doleman",
        "character": "Count Lippe"
      },
      {
        "name": "Molly Peters",
        "character": "Patricia Fearing"
      },
      {
        "name": "Martine Beswick",
        "character": "Paula Caplan"
      },
      {
        "name": "Bernard Lee",
        "character": "M"
      },
      {
        "name": "Desmond Llewelyn",
        "character": "Q"
      },
      {
        "name": "Lois Maxwell",
        "character": "Miss Moneypenny"
      },
      {
        "name": "Roland Culver",
        "character": "Foreign Secretary"
      },
      {
        "name": "Earl Cameron",
        "character": "Pinder"
      },
      {
        "name": "Paul Stassino",
        "character": "Palazzi"
      },
      {
        "name": "Rose Alba",
        "character": "Madame Boitier"
      },
      {
        "name": "Philip Locke",
        "character": "Vargas"
      },
      {
        "name": "George Pravda",
        "character": "Kutze"
      },
      {
        "name": "Michael Brennan",
        "character": "Janni"
      },
      {
        "name": "Leonard Sachs",
        "character": "Group Captain (uncredited)"
      },
      {
        "name": "Edward Underdown",
        "character": "Air Vice Marshall (uncredited)"
      },
      {
        "name": "Reginald Beckwith",
        "character": "Kenniston"
      },
      {
        "name": "Harold Sanderson",
        "character": "Hydrofoil Captain (uncredited)"
      },
      {
        "name": "Jack Gwillim",
        "character": "Senior RAF Staff Officer (uncredited)"
      },
      {
        "name": "Suzy Kendall",
        "character": "Prue (uncredited)"
      },
      {
        "name": "Mitsouko",
        "character": "Madame La Porte (uncredited)"
      },
      {
        "name": "Philip Stone",
        "character": "SPECTRE Number 5 (uncredited)"
      },
      {
        "name": "Kevin McClory",
        "character": "Man Smoking at Nassau Casino (uncredited)"
      },
      {
        "name": "Anthony Dawson",
        "character": "Ernst Stavro Blofeld (uncredited)"
      },
      {
        "name": "Bob Simmons",
        "character": "Colonel Jacques Bouvar - SPECTRE #6 (uncredited)"
      },
      {
        "name": "Richard Graydon",
        "character": "Largo's Henchman (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Tom Jones",
        "department": "Sound",
        "job": "Theme Song Performance"
      },
      {
        "name": "Robert Watts",
        "department": "Directing",
        "job": "Second Assistant Director"
      },
      {
        "name": "John Barry",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "John Barry",
        "department": "Sound",
        "job": "Conductor"
      },
      {
        "name": "Ian Fleming",
        "department": "Writing",
        "job": "Original Story"
      },
      {
        "name": "Albert R. Broccoli",
        "department": "Crew",
        "job": "Presenter"
      },
      {
        "name": "Harry Saltzman",
        "department": "Crew",
        "job": "Presenter"
      },
      {
        "name": "Ted Moore",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Terence Young",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Richard Maibaum",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Peter R. Hunt",
        "department": "Editing",
        "job": "Supervising Editor"
      },
      {
        "name": "Ken Adam",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Peter Murton",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Kevin McClory",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Kevin McClory",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Jack Whittingham",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Jack Whittingham",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "John Hopkins",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Ernest Hosler",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Anthony Mendleson",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Anthony Mendleson",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Designer"
      },
      {
        "name": "Michael Reed",
        "department": "Camera",
        "job": "Second Unit Director of Photography"
      },
      {
        "name": "David Middlemas",
        "department": "Production",
        "job": "Production Supervisor"
      },
      {
        "name": "Lamar Boren",
        "department": "Camera",
        "job": "Underwater Camera"
      },
      {
        "name": "Paul Rabiger",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Frank Ernst",
        "department": "Production",
        "job": "Location Manager"
      },
      {
        "name": "John Brady",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Master"
      },
      {
        "name": "Bert Ross",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "Dick Ziker",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Eileen Warwick",
        "department": "Costume & Make-Up",
        "job": "Hairdresser"
      },
      {
        "name": "John Stears",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Maurice Binder",
        "department": "Art",
        "job": "Main Title Designer"
      },
      {
        "name": "Freda Pearson",
        "department": "Art",
        "job": "Set Dresser"
      },
      {
        "name": "Basil Newall",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Maurice Askew",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "John Winbolt",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Joan Davis",
        "department": "Directing",
        "job": "Continuity"
      },
      {
        "name": "Gus Agosti",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Eileen Sullivan",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Master"
      },
      {
        "name": "Michael White",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "Jimmy Spoard",
        "department": "Camera",
        "job": "Grip"
      },
      {
        "name": "Lorraine Fennell",
        "department": "Production",
        "job": "Publicist"
      },
      {
        "name": "Willie Meyers",
        "department": "Art",
        "job": "Location Scout"
      },
      {
        "name": "Derek Watkins",
        "department": "Sound",
        "job": "Musician"
      }
    ]
  },
  "keywords": [
    "sea",
    "florida",
    "paris, france",
    "spy",
    "fighter pilot",
    "bahamas",
    "sanatorium",
    "secret organization",
    "nuclear missile",
    "coral reef",
    "secret agent",
    "scuba diving",
    "british spy",
    "shark",
    "scuba",
    "british secret service",
    "big ben"
  ],
  "mpaa": "PG",
  "summaries": [
    "James Bond heads to the Bahamas to recover two nuclear warheads stolen by S.P.E.C.T.R.E. Agent Emilio Largo in an international extortion scheme.",
    "James Bond continues on his fourth mission, with his aim to recover 2 stolen warheads. They've been taken by the SPECTRE organisation, and the world's held hostage as Bond heads to Nassau, Bahamas. Here, he meets Domino and is forced into a thrilling confrontation with SPECTRE agent Emil Largo on-board his boat, the Disco Volante.—simon_hrdng",
    "White Hall mobilizes, in coordination with the US, when the Paris-based criminal organization SPECTRE demands a 100 million pound ransom from NATO in diamonds for the two British nuclear bombs their 'number two' agent Emilio Largo's team stole from a Vulcan type RAF bomber by substituting French pilot Francois Derval, whom vamp agent Fiona Volpe seduced, with a plastic surgery-produced double. Bond sees a link to Deval's scuba diver sister Dominque 'Domino' and goes investigate around the Nassau, Bahamas enclosed villa estate of her domineering sugar daddy Largo, who keeps sharks to feed enemies to. Bond is assisted by local spy Pinder, CIA counterpart Felix Leitner and his team. Largo and Fiona aren't naive, so a complicated game of deceit ensues, but the deadline for a 'demonstration' whipping Miami Beach off the map approaches, preparations having started to delver the ransom.—KGF Vissers",
    "When SPECTRE leader Emilio Largo, the ruthless second-in-command Number Two, devises a diabolical scheme to steal a Royal Air Force strategic bomber loaded with two nuclear weapons, MI6 calls in all 00 agents to thwart his plans. And with the terrorist organisation holding NATO and the world to ransom, British secret agent James Bond goes to sun-kissed Nassau, Bahamas, to follow a faint trail of clues. But there, a chance encounter with statuesque brunette Domino spells trouble as a dangerous secret links the beautiful woman to Largo. What sunken mysteries harbour Nassau's shark-infested waters? Can Bond recover the warheads and prevent a nuclear holocaust in the name of profit?—Nick Riganas",
    "In order to keep multiple warheads out of the wrong hands, British agent 007 James Bond must find a criminal and stop him from using the warheads for destruction and murdering multiple people. James Bond must find another way to stop him at all cost.—RECB3"
  ],
  "synopsis": "SPECTRE operative (#2) Emilio Largo (Adolfo Celi) devises a plan to hold NATO to ransom (for $280 MM or 100 MM pounds) by hijacking two atomic bombs from a Royal Air Force (RAF) Avro Vulcan strategic jet bomber during a training exercise. To facilitate Largo's plans, SPECTRE operative Count Lippe (Guy Doleman) (#4) recruits Angelo Palazzi (Paul Stassino) to oversee the theft of the bombs, and with help from SPECTRE agent Fiona Volpe (Luciana Paluzzi), has him surgically alter his face to match that of French Air Force pilot François Derval (Paul Stassino) (François Derval is a French Air Force pilot assigned to the NATO staff), who is assisting in the exercise.Volpe and Angelo murder the real Derval, while they are staying at the Shrublands health resort. When Bond tried to investigate, there was an assassination attempt on him), only for the latter to demand more money (He wants $250K instead of $100K as agreed earlier). Fiona acquiesces, merely to have him continue with their operation. Following the plan, Angelo successfully hijacks the bomber, killing its crew (with a nerve gas which doesn't effect him as he had his own secret supply of oxygen) and lands it into shallow waters within the Bahamas. While the bombs are recovered by his men, Largo murders Angelo for reneging on his original deal with SPECTRE.British secret agent James Bond (Sean Connery), recuperating at Shrublands (Bond was curious about Lippe (who had curious tattoo on his arm) after a previous assignment, notices Lippe's presence and keeps him under observation, discovering Derval's body (which was brought back to the resort after he was killed in his apartment and replaced with Angelo).\nUpon being urgently recalled to London, Bond finds himself targeted by Lippe for trying to interfere. Before he can defend himself, Lippe is killed by Fiona for nearly jeopardizing Largo's scheme (by failing to see Angelo's betrayal) by a missile fired from her motorcycle.Once back in London, Bond learns that all 00 agents are being put on high alert following the theft of the bombs, after being informed a major city in the United States or the United Kingdom will be destroyed unless £100 million is paid to SPECTRE within seven days. While in talks with M (Bernard Lee) on his assignment, Bond requests he be assigned to Nassau, Bahamas, to contact Derval's sister Domino (Claudine Auger), after recognizing Derval from the photo given to the agents in their main briefing as the body he found at the resort.\nMoneypenny (Lois Maxwell)Bond meets with Domino, who he learns is the mistress of Largo when he visits a local casino. Both men recognize each other as adversaries and engage in a tense cat-and-mouse game while still pretending ignorance of each other's true nature. Following their initial meeting, Bond meets with his friend, CIA agent Felix Leiter (Rik Van Nutter), fellow agent Paula Caplan (Martine Beswick), and MI6 quartermaster Q (Desmond Llewelyn), to receive equipment to help with finding the bombs, including an underwater infrared camera and miniature underwater breathing apparatus.Investigating Largo's ship, Disco Volante, he notices an underwater hatch beneath her that intrigues him (Largo could have sent a whole team through that hatch to retrieve the bombs, and nobody would have seen a thing). But Bond is discovered and attacked by Largo's henchmen. They pursue Bond with hand grenades, but Bond manages to escape them and gets to shore.\nThe next day, he visits Largo at his estate during the night (when Paula went missing), only to find that Paula had been abducted and committed suicide before she could talk. Forced to escape, Bond reaches his room to find Volpe in his bathtub. He wants to attend the Jankanoo celebration, as Largo is going to be there, but Volpe tries to keep him in his room. Bond evades Largo's men when they come to pick him in his room (he is shot during his escape and Volpe is able to track him to a dancing club), killing Volpe in the process (Volpe corners Bond on the dance floor (where he was hiding in the crowd), but when Largo's men shoot at Bond, he brings Volpe in front forcefully, killing her).Suspecting the bombs were brought to the area, Bond and Leiter search for the Vulcan and find it camouflaged underwater, along with the body of Angelo. Upon returning to the island, Bond reveals to Domino that her brother was killed by Largo and gets her to help him search Disco Volante. However, Largo catches her in the act and has her imprisoned.\nMeanwhile, Bond replaces one of Largo's men, as SPECTRE prepares to move the bombs, and manages to learn where one of them is being moved to (Miami) before being forced to escape (he is locked inside the underwater cave where the bombs were stored, but manages to find a back way out of there). Contacting Leiter (he had swallowed a radioactive location beacon which Leiter followed in a copter), the pair gets the U.S. Navy to intercept Disco Volante and recover one of the bombs which was still on the underwater craft being used to transport the bombs..Bond pursues Largo, and grabs hold of Disco Volante (which had the other bomb) as she sheds the rear half to become a hydrofoil to escape. Bond gets on deck, defeats Largo's men and fights Largo, but Largo gets the upper hand and is about to shoot Bond, when Domino kills Largo in revenge after his hired nuclear physicist frees her (he did not like the fact that Largo was prepared to torture Domino for information). The group quickly flees Disco Volante just barely before her destruction, whereupon Bond and Domino are retrieved by a plane with the Fulton system."
}