{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
  "id": 665,
  "title": "Ben-Hur",
  "poster_path": "https://image.tmdb.org/t/p/w500/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
  "release_date": "1959-11-18",
  "vote_average": 7.882,
  "vote_count": 2551,
  "popularity": 35.884,
  "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
  "imdb_id": "tt0052618",
  "budget": 15000000,
  "homepage": "",
  "revenue": 164000000,
  "runtime": 212,
  "tagline": "The entertainment experience of a lifetime!",
  "genres": [
    "History",
    "Drama",
    "Adventure",
    "Action"
  ],
  "production_companies": [
    "Metro-Goldwyn-Mayer"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Charlton Heston",
        "character": "Judah Ben-Hur"
      },
      {
        "name": "Jack Hawkins",
        "character": "Quintus Arrius"
      },
      {
        "name": "Haya Harareet",
        "character": "Esther"
      },
      {
        "name": "Stephen Boyd",
        "character": "Messala"
      },
      {
        "name": "Martha Scott",
        "character": "Miriam"
      },
      {
        "name": "Cathy O'Donnell",
        "character": "Tirzah"
      },
      {
        "name": "Sam Jaffe",
        "character": "Simonides"
      },
      {
        "name": "Hugh Griffith",
        "character": "Scheich Ildirim"
      },
      {
        "name": "Finlay Currie",
        "character": "Balthasar"
      },
      {
        "name": "Frank Thring",
        "character": "Pontius Pilatus"
      },
      {
        "name": "George Relph",
        "character": "Tiberius Caesar"
      },
      {
        "name": "André Morell",
        "character": "Sextus"
      },
      {
        "name": "Terence Longdon",
        "character": "Drusus"
      },
      {
        "name": "Ady Berber",
        "character": "Malluch"
      },
      {
        "name": "Lando Buzzanca",
        "character": "Jewish Slave in the Desert (uncredited)"
      },
      {
        "name": "Giuliano Gemma",
        "character": "Roman Officer with Messala (uncredited)"
      },
      {
        "name": "Marina Berti",
        "character": "Flavia (uncredited)"
      },
      {
        "name": "Robert Brown",
        "character": "Chief of Rowers (uncredited)"
      },
      {
        "name": "Liana Del Balzo",
        "character": "Guest at Banquet (uncredited)"
      },
      {
        "name": "Enzo Fiermonte",
        "character": "Galley Officer (uncredited)"
      },
      {
        "name": "Richard Hale",
        "character": "Gaspar (uncredited)"
      },
      {
        "name": "Duncan Lamont",
        "character": "Marius (uncredited)"
      },
      {
        "name": "John Le Mesurier",
        "character": "Doctor (uncredited)"
      },
      {
        "name": "Ferdy Mayne",
        "character": "Captain of Rescue Ship (uncredited)"
      },
      {
        "name": "May McAvoy",
        "character": "Woman in crowd (uncredited)"
      },
      {
        "name": "Aldo Silvani",
        "character": "Man in Nazareth (uncredited)"
      },
      {
        "name": "Ralph Truman",
        "character": "Aide to Tiberius (uncredited)"
      },
      {
        "name": "Claude Heater",
        "character": "Christ"
      },
      {
        "name": "Joe Canutt",
        "character": "Sportsman (uncredited)"
      },
      {
        "name": "Richard Coleman",
        "character": "Metellus (uncredited)"
      },
      {
        "name": "Antonio Corevi",
        "character": "Senator (uncredited)"
      },
      {
        "name": "David Davies",
        "character": "Quaestor (uncredited)"
      },
      {
        "name": "Mino Doro",
        "character": "Gratus (uncredited)"
      },
      {
        "name": "Michael Dugan",
        "character": "Seaman (uncredited)"
      },
      {
        "name": "Franco Fantasia",
        "character": "Roman Soldier Who Brings Crown to Gratus (uncredited)"
      },
      {
        "name": "José Greci",
        "character": "Mary (uncredited)"
      },
      {
        "name": "John Horsley",
        "character": "Spintho (uncredited)"
      },
      {
        "name": "Howard Lang",
        "character": "Hortator (uncredited)"
      },
      {
        "name": "Stevenson Lang",
        "character": "Blind Man (uncredited)"
      },
      {
        "name": "Tutte Lemkow",
        "character": "Leper (uncredited)"
      },
      {
        "name": "Cliff Lyons",
        "character": "The Lubian (uncredited)"
      },
      {
        "name": "Tiberio Mitri",
        "character": "Roman at Bath (uncredited)"
      },
      {
        "name": "Remington Olmsted",
        "character": "Decurian (uncredited)"
      },
      {
        "name": "Laurence Payne",
        "character": "Joseph (uncredited)"
      },
      {
        "name": "Aldo Pini",
        "character": "Bad Thief on Cross (uncredited)"
      },
      {
        "name": "Diego Pozzetto",
        "character": "Villager (uncredited)"
      },
      {
        "name": "Stella Rho",
        "character": "Amrah (uncredited)"
      },
      {
        "name": "Edwin Richfield",
        "character": "Supplier to Leper Colony (uncredited)"
      },
      {
        "name": "Hector Ross",
        "character": "Officer (uncredited)"
      },
      {
        "name": "Maxwell Shaw",
        "character": "Rower No. 43 (uncredited)"
      },
      {
        "name": "Gianni Solaro",
        "character": "Galley Officer (uncredited)"
      },
      {
        "name": "Pietro Tordi",
        "character": "Pilate's Servant (uncredited)"
      },
      {
        "name": "Raimondo Van Riel",
        "character": "Old Man (uncredited)"
      },
      {
        "name": "Dervis Ward",
        "character": "Jailer (uncredited)"
      },
      {
        "name": "Joe Yrigoyen",
        "character": "The Egyptian - Chariot Racer (uncredited)"
      },
      {
        "name": "Nazzareno Zamperla",
        "character": "Roman Soldier with a Bow on Galley (uncredited)"
      },
      {
        "name": "Jerry Brown",
        "character": "The Corinthian (uncredited)"
      },
      {
        "name": "Eddie Jauregui",
        "character": "The Athenian (uncredited)"
      },
      {
        "name": "Gianni Di Segni",
        "character": "Galley Guard on Ship (uncredited)"
      },
      {
        "name": "Armando Fracassi",
        "character": "Arab (uncredited)"
      },
      {
        "name": "Osiride Pevarello",
        "character": "(uncredited)"
      },
      {
        "name": "Renzo Pevarello",
        "character": "(uncredited)"
      },
      {
        "name": "Amerigo Santarelli",
        "character": "Rower (uncredited)"
      },
      {
        "name": "Artemio Antonini",
        "character": "Galley Guard on Ship (uncredited)"
      },
      {
        "name": "Aldo Cecconi",
        "character": "Galley Guard on Ship (uncredited)"
      },
      {
        "name": "Mario Meniconi",
        "character": "Crucifixion March Guard (uncredited)"
      },
      {
        "name": "Terzo Monachesi",
        "character": "Nobleman at the Chariot Race (uncredited)"
      },
      {
        "name": "Giorgio Ubaldi",
        "character": "Rower (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Lee LeBlanc",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Sergio Leone",
        "department": "Directing",
        "job": "Second Unit Director"
      },
      {
        "name": "Miklós Rózsa",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "William A. Horning",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "William Wyler",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Lew Wallace",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Karl Tunberg",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Sam Zimbalist",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Robert Surtees",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "John D. Dunning",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Ralph E. Winters",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Edward C. Carfagno",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Hugh Hunt",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Elizabeth Haffenden",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Gabriella Borzelli",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Charles E. Parker",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Edward Woehler",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "William Steinkamp",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "Franklin Milton",
        "department": "Sound",
        "job": "Recording Supervision"
      },
      {
        "name": "A. Arnold Gillespie",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Harold E. Wellman",
        "department": "Camera",
        "job": "Additional Photography"
      },
      {
        "name": "Robert R. Hoag",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Alberto Cardone",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Piero Portalupi",
        "department": "Camera",
        "job": "Additional Photography"
      },
      {
        "name": "Sash Fisher",
        "department": "Sound",
        "job": "Sound Recordist"
      }
    ]
  },
  "keywords": [
    "epic",
    "governor",
    "middle east",
    "based on novel or book",
    "roman empire",
    "politics",
    "christianity",
    "jew persecution",
    "jewish life",
    "roman",
    "miracle",
    "jerusalem, israel",
    "prince",
    "chariot race",
    "leprosy",
    "redemption",
    "religious conversion",
    "ancient rome",
    "gay interest",
    "love",
    "friends",
    "remake",
    "revenge",
    "judaism",
    "religion",
    "historical fiction",
    "period drama",
    "dungeon",
    "galley",
    "hatred",
    "sheikh",
    "sea battle",
    "jewish family",
    "galley slave",
    "false inprisonment",
    "childhood sweetheart",
    "salvation",
    "1st century",
    "jesus christ",
    "judea",
    "subjugated people"
  ],
  "mpaa": "G",
  "summaries": [
    "After a Jewish prince is betrayed and sent into slavery by a Roman friend in 1st-century Jerusalem, he regains his freedom and comes back for revenge.",
    "Judah Ben-Hur lives as a rich Jewish prince and merchant in Jerusalem at the beginning of the 1st century. Together with the new governor his old friend Messala arrives as commanding officer of the Roman legions. At first they are happy to meet after a long time but their different politic views separate them. During the welcome parade a roof tile falls down from Judah's house and injures the governor. Although Messala knows they are not guilty, he sends Judah to the galleys and throws his mother and sister into prison. But Judah swears to come back and take revenge.—Matthias Scheler <tron@lyssa.owl.de>",
    "When Prince Judah Ben-Hur hears that his childhood friend Messala has been named to command the Roman garrison of Jerusalem, he is thrilled. He soon finds, however, that his friend has changed and has become an arrogant conqueror, full of the grandeur of Rome. After Judah refuses to divulge the names of Jews who oppose Roman rule, Messala decides to make an example of him and sends him off as a galley slave. Through fate and good fortune, Judah survives the galleys and manages to return to Jerusalem in the hopes of finding his mother and sister, who were also imprisoned, and to seek revenge against his one-time friend.—garykmcd",
    "Charlton Heston plays a Jew who is battling the Roman empire at the time of Christ. His actions send him and his family into slavery, but an inspirational encounter with Jesus changes everything. Heston finally meets his rival in a justly famous chariot race and rescues his suffering family.—Jwelch5742",
    "In A.D. 26-Jerusalem, the wealthy merchant and son of a Jewish family, Judah Ben-Hur, enjoys a comfortable life. However, the unexpected reunion after many years with his childhood best friend and now a Roman tribune, Messala, will lead to an eventual separation, banishing Judah to a life of slavery and imprisonment at a galley ship. Only an unforeseen and gracious act of pardon will set free the once noble prince, who is now bent on revenge, as the incendiary teachings of the Nazarene Jesus rapidly gain ground. Will Judah finally find peace in this revolutionary and enlightened new doctrine of kindness?—Nick Riganas"
  ],
  "synopsis": "Judah Ben-Hur (Charlton Heston) is a wealthy merchant living in Judea at the time of Christ. Under the influence of the oppressive Roman Empire, the land seethes with talk of revolt, and Caesar has sent more soldiers to quell the potential uprising. The new Tribune Messala (Stephen Boyd) once lived in Judea as a boy, and longs to rekindle his old friendship with Judah, but when they meet it is obvious that Messala has been changed by the years he has been away, fighting the enemies of the Empire. He is harsh and calculating, driven by ambition, and eager to prove himself to Caesar. Asking Judah for help in rounding up the local dissenters, they argue, and when Judah refuses to betray his own people Messala declares that they must be either friends or enemies, and leaves in anger.A few days later the Romans parade through the city in a show of force and to announce the arrival of the new governor of Judea. As they pass the house of Hur, Judah's sister, Tirzah (Cathy O'Donnell), leans out over the balcony for a better look. She dislodges a few roof tiles which fall near the new governor as he rides by, panicking his horse and throwing him off. Messala seizes an opportunity to frame the Hur family for an attempted assassination. Arresting Judah, his sister and mother, he throws them all into prison. Judah learns that he is to be condemned without trial or hearing, and flies into a desperate rage. Breaking free from his jailers, Judah smashes his way into Messala's chamber, demanding to know why he has done this evil deed. Messala calmly explains that by condemning an old friend without hesitation, he will show the rest of Judea that he is to be feared. \"I asked for your help Judah,\" says Messala, \"and now you've given it to me.\" He dismisses Judah to the death of a slave in the galleys, and leaves the mother and sister to rot in prison.Chained to a group of criminals, Judah is marched through the desert. Barely alive, they pass though a village called Nazareth, where a compassionate young man gives him water. Gazing into his eyes, Judah is filled with wonder, and receives the life-giving gift of a simple drink. When an angry Roman guard barks the young man rises and the guard stares into his face, perceiving something there that, perhaps for the first time in his life, forces the Roman to back down. Judah is marched away with the other condemned men, but continues to gaze back at the man who saved his life.Three years pass. Judah rows his life away in the galleys, his latest confinement is aboard a war armada. When the new admiral, Quintas Arrius (Jack Hawkins) comes aboard, he puts all the slaves to a test of endurance, looking for any with enough spirit to defy him. In the galley, he looks over his rowers, telling the guards to change one of them, seeing another who bears the scars of many whippings for insolence and finally Judah. He suddenly lashes Judah, seeing the anger and hate in his eyes but also the control not to attack the man. Later that night, during Judah's resting period, he is ordered to Arrius' quarters, finding him asleep. Arrius suddenly awakes, noting that Judah could have easily killed him. The two talk for a bit, Arrius mentioning that he owns some of the finest gladiator schools in the empire. Judah refuses and returns to the ship's hold.Soon the fleet engages the Macedonian armada in battle and in the mayhem, Arrius' ship is rammed. Shortly before the battle had begun, Arrius had ordered that Judah be unshackled. Arrius himself is cast overboard only to be saved by Judah. The two spend a few days floating at sea on a piece of flotsam, Arrius prevented from killing himself and bound by Judah. Finding his fleet victorious, he returns in triumph to Rome with Judah at his side and after a time adopts him as a son. A rich and influential man once again, Judah's thoughts return to Judea and the vengeance he has sworn on Messala.Along the road to Judea, Judah meets a Arab sheikh and an old wise man named Balthasar, one of those who followed the star of Bethlehem at the time of Christ's birth. Balthasar now seeks Christ grown into a man, and befriends Judah, sensing the goodness of his soul, but also the hatred for an old enemy. Finding that Judah is skilled in chariot racing, Sheikh Ilderim coaches Judah to ride his team of white horses in the upcoming race against Messala and his notorious blacks. Judah accepts and prepares to meet Messala in the arena. The sheikh meets with the lords of Rome, Messala included, and gets them to agree to four to one odds. When he learns of Judah's return, Messala is astonished, but quickly begins to plot again. In the arena, many fortunes can change. Judah meets with Messala, demanding to know where his mother and sister are. Messala claims not to know and Judah harshly tells him to find them and arrange for their release.When Judah arrives at the circus for the race, he spots Messala, who has equipped the wheels of his chariot with spinning, gouging blades. Entering the arena in a grandiose procession, the contestants line up and await the signal from the governor, Pontius Pilate. He drops a white cloth, and the race is on. In this spectacular contest many other teams crash, and Judah and Messala collide time and again, striving for the lead. Messala's spinning blades prove useful against several of his opponents, ripping their chariots and wheels to splinters. When Messala, consumed by his desire to defeat Judah, crashes his chariot into another, yanking off one of his wheels, he is thrown out and dragged behind the stampeding horses of the racer behind him, then thrown out to the rear, landing in a heap in the sand. Judah rides to a glorious victory, and the shattered body of Messala is carried away.Messala is bound to a table by Roman surgeons, who tell him they have to amputate his legs. He refuses to let them start until Judah comes, wanting to face his old friend whole. As his life ebbs, Messala confronts Judah one last time, and tells him that his mother and sister are not dead as was thought, but alive, condemned to lowest cell block of the Roman prison. As they both have endured solitary confinement since their arrest, they both have contracted leprosy. They were freed and sent to a nearby leper colony to live out their final days. Cackling at his final victory over Judah, Messala gasps his last. \"The game goes on Judah!\" he hisses as he dies. A stunned Judah goes forth, his victory hollow, the vengeance he'd sought meaningless.Seeking release from his hatred, Judah walks through the city, encountering Balthasar again, who has now found the living Christ he was seeking. Begging him to come and hear the words of Jesus, he tries to help Judah and ease his pain, but to no avail. Judah cannot live with the thought of his beloved mother and sister suffering in the valley of the lepers, and seeks them out. Tenderly carrying them into the city, he finds it empty, as everyone has gone to the trial of Jesus. Hiding in the shadows, they all witness the suffering of Christ as he is led to his crucifixion. As Jesus passes, Judah recognises him as the young man who'd saved his life with a simple drink of water in the desert. Amazed, he pushes through the guards, and as Jesus falls, Judah carries a gourd of water to him and helps him to drink. Gazing in wonder once more into his eyes, Judah is touched by Christ.At the site of the Crucifixion, Judah and Balthasar weep at the cruelty, and watch as the sky turns dark. Judah's mother and sister take shelter in a nearby cave, and cry out in terror as the Earth trembles, and lightning slashes the sky. A flash of light reveals their leprosy had been healed, a miracle they do not understand, but for which they thank God. Judah returns to his home, finding his family healed and restored to him, and finding also that the sacrifice of Christ has taken the hatred out of his heart and saved his soul."
}