{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/n4CvA50GBtIPrSqCl8nMNZCliYI.jpg",
  "id": 7214,
  "title": "Coach Carter",
  "poster_path": "https://image.tmdb.org/t/p/w500/y3HOTTyM5nLsdUzXFtFCohG28qj.jpg",
  "release_date": "2005-01-14",
  "vote_average": 7.561,
  "vote_count": 2722,
  "popularity": 48.499,
  "overview": "Based on a true story, in which Richmond High School head basketball coach Ken Carter made headlines in 1999 for benching his undefeated team due to poor academic results.",
  "imdb_id": "tt0393162",
  "budget": 30000000,
  "homepage": "",
  "revenue": 76700000,
  "runtime": 136,
  "tagline": "It begins on the streets. It ends here.",
  "genres": [
    "Drama",
    "History"
  ],
  "production_companies": [
    "Paramount",
    "MTV Films",
    "Tollin/Robbins Productions"
  ],
  "production_countries": [
    "DE",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Samuel L. Jackson",
        "character": "Ken Carter"
      },
      {
        "name": "Rob Brown",
        "character": "Kenyon Stone"
      },
      {
        "name": "Robert Ri'chard",
        "character": "Damien Carter"
      },
      {
        "name": "Rick Gonzalez",
        "character": "Timo Cruz"
      },
      {
        "name": "Nana Gbewonyo",
        "character": "Junior Battle"
      },
      {
        "name": "Antwon Tanner",
        "character": "Worm"
      },
      {
        "name": "Channing Tatum",
        "character": "Jason Lyle"
      },
      {
        "name": "Ashanti",
        "character": "Kyra"
      },
      {
        "name": "Texas Battle",
        "character": "Maddux"
      },
      {
        "name": "Lacey Beeman",
        "character": "Susan"
      },
      {
        "name": "Octavia Spencer",
        "character": "Mrs. Battle"
      },
      {
        "name": "Allison Kyler",
        "character": "Dancer"
      },
      {
        "name": "Cindy Chiu",
        "character": "Bay Hill Cheerleader"
      },
      {
        "name": "Adrienne Bailon-Houghton",
        "character": "Dominique"
      },
      {
        "name": "Dana Davis",
        "character": "Peyton"
      },
      {
        "name": "Sonya Eddy",
        "character": "Worm's Mother"
      },
      {
        "name": "Debbi Morgan",
        "character": "Tonya"
      },
      {
        "name": "Mel Winkler",
        "character": "Coach White"
      },
      {
        "name": "Paul Rae",
        "character": "Guardian"
      },
      {
        "name": "Ray Baker",
        "character": "St. Francis Coach"
      },
      {
        "name": "Roger Lim",
        "character": "Benson Chiu (uncredited)"
      },
      {
        "name": "Vincent Laresca",
        "character": "Renny"
      },
      {
        "name": "Sidney Faison",
        "character": "Ty Crane"
      },
      {
        "name": "Marc McClure",
        "character": "Susan's Dad"
      },
      {
        "name": "Jenny Gago",
        "character": "President Martinez"
      },
      {
        "name": "Ben Weber",
        "character": "Mr. Gesek"
      },
      {
        "name": "Floyd Levine",
        "character": "Taxi Driver"
      },
      {
        "name": "Robert Hoffman",
        "character": "Dancer"
      },
      {
        "name": "Denise Dowse",
        "character": "Principal Garrison"
      }
    ],
    "crew": [
      {
        "name": "Trevor Rabin",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Peter E. Berger",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Sarah Halley Finn",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Randi Hiller",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Van Toffler",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Thomas Carter",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Thomas Carter",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Mark Schwahn",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "John Gatins",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Brian Robbins",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Michael Tollin",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Caitlin Scanlon",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Sharla Sumpter",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Sharone Meir",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Carlos Barbosa",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Tim Beach",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Nancy Nye",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Debrae Little",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Camille Friend",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "David Gale",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Don Elliott",
        "department": "Art",
        "job": "Set Dresser"
      }
    ]
  },
  "keywords": [
    "high school",
    "scholarship",
    "sports",
    "black people",
    "violence in schools",
    "authoritarian education",
    "basketball",
    "teacher",
    "teachers and students"
  ],
  "mpaa": "PG-13",
  "summaries": [
    "Controversy surrounds high school basketball coach Ken Carter after he benches his entire team for breaking their academic contract with him.",
    "Based on a true story, a basketball coach coaches a high school basketball team. As soon as he finds out that the team of players are doing well in their studies, he suspends basketball until they get their grades up and the importance of what life really is.—RECB3",
    "In 1999, Ken Carter accepts the job of basketball coach for his old high school in a poor area of Richmond, CA. As much dismayed by the poor attitudes of his players as well as their dismal play performance, Carter sets about to change both. He imposes a strict regime typified in written contracts that demand respectful behavior, a dress code and good grades for players. Any initial resistance is soon dispelled as the team under Carter's tutelage becomes a undefeated competitor. However, when the overconfident team's behavior begins to stray with too many doing poorly in class, Carter takes immediate action. To the outrage of the team, the school and the community, Carter cancels all team activities and locks the court until the team shows acceptable academic improvement. In the ensuing debate, Carter fights to keep his methods, determined to show the boys that they need good values for their futures and eventually finds he has affected them more profoundly than he ever expected.—Kenneth Chisholm (kchishol@rogers.com)"
  ],
  "synopsis": "Coach Ken Carter (Jackson) takes over the head coaching job for the Oilers basketball team at his old high school Richmond, having played on the team himself, earning unbeaten records. Carter quickly learns that the athletes are rude and disrespectful, and are in need of discipline. He hands the players individual contracts, instructing them to attend all of their classes, wear dress shirts and ties on game days, refer to everyone (players and coach alike) as \"sir\", and maintain a minimum 2.3 (C+) grade point average, among other requirements. He also teaches them to play a disciplined brand of basketball which includes an emphasis on fundamentals, execution, defense, and conditioning.Carter also asks the school staff for progress reports on the players' attendance. However, three players including Timo Cruz (Rick Gonzalez) refuse to follow the contract and quit the team. Carter's son Damien (Robert Andrew Richard) later decides to join the team, after quitting the private school St. Francis to play for his father.Teammate Kenyon Stone (Rob Brown) struggles to come to terms with his girlfriend Kyra (Ashanti) being pregnant; unsure if he can juggle basketball and aspire for college. Later, Cruz makes a valiant effort to rejoin the basketball team after watching them perform at a game in an inspiring victory and also after witnessing his only family member- who happens to be his cousin (a drug dealer)- shot one night in the streets, which Carter accepts. The team goes on to post an undefeated record eventually winning a seasonal basketball tournament. However, Carter later discovers the progress reports filled out by the faculty reveal some of the students have been skipping classes and floundering academically.Carter initiates a lockdown on the gym, banning the team from playing until they improve their grades. The act angers the locals, as Carter is criticized by parents and academic personnel alike. The school board eventually confronts Carter, who justifies his actions, explaining he wants to give his team the opportunity and option to learn good values, which is far more important for the students' futures than winning basketball games. Although the national media praises Carter for his commitment to this priority, the school board, aside from Principal Garrison (Dowse) and the chairman, vote to end the lockout, much to Carter's dismay.Just when Carter is about to quit in disgust (after promising to do so if they vote to end the lockout), he is shocked to find his players in the gym with desks and teachers studying and working to bring their grades back up. The athletes decide to fulfill Carter's original intention of pursuing academic achievement before continuing to play their next game, with one explaining that the school board can force an end to the lockout, but the players can't be forced to play. They work hard in the classroom, study after school during practice time, and eventually raise their grade point average to a point that fulfills their end of the contracts they signed. The Oilers eventually end up competing in the regional high school playoffs, but ultimately lose to St. Francis. Nonetheless, Carter is proud that the players accomplished their goal of attaining a proper education with athletics. The film's epilogue displays a series of graphics stating that a number of players went on to attend college furthering their study."
}