{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/1Ds7xy7ILo8u2WWxdnkJth1jQVT.jpg",
  "id": 752623,
  "title": "The Lost City",
  "poster_path": "https://image.tmdb.org/t/p/w500/neMZH82Stu91d3iqvLdNQfqPPyl.jpg",
  "release_date": "2022-03-24",
  "vote_average": 6.557,
  "vote_count": 3230,
  "popularity": 75.348,
  "overview": "Reclusive author Loretta Sage writes about exotic places in her popular adventure novels that feature a handsome cover model named Alan. While on tour promoting her new book with Alan, Loretta gets kidnapped by an eccentric billionaire who hopes she can lead him to the ancient city's lost treasure that featured in her latest story. Alan, determined to prove he can be a hero in real life and not just on the pages of her books, sets off to rescue her.",
  "imdb_id": "tt13320622",
  "budget": 74000000,
  "homepage": "https://www.thelostcity.movie/",
  "revenue": 192907684,
  "runtime": 112,
  "tagline": "The adventure is real. The heroes are not.",
  "genres": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "production_companies": [
    "Paramount",
    "Fortis Films",
    "3dot Productions",
    "Exhibit A Film"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Sandra Bullock",
        "character": "Loretta Sage / Angela"
      },
      {
        "name": "Channing Tatum",
        "character": "Alan / Dash"
      },
      {
        "name": "Daniel Radcliffe",
        "character": "Abigail Fairfax"
      },
      {
        "name": "Da'Vine Joy Randolph",
        "character": "Beth Hatten"
      },
      {
        "name": "Brad Pitt",
        "character": "Jack Trainer"
      },
      {
        "name": "Oscar Nunez",
        "character": "Oscar"
      },
      {
        "name": "Patti Harrison",
        "character": "Allison"
      },
      {
        "name": "Bowen Yang",
        "character": "Ray the Moderator"
      },
      {
        "name": "Stephen Lang",
        "character": "Fantasy Villain"
      },
      {
        "name": "Joan Pringle",
        "character": "Nana"
      },
      {
        "name": "Héctor Aníbal",
        "character": "Rafi"
      },
      {
        "name": "Thomas Forbes-Johnson",
        "character": "Julian"
      },
      {
        "name": "Sli Lewis",
        "character": "Shades"
      },
      {
        "name": "Olga Buccarelli",
        "character": "Woman Singing in Village"
      },
      {
        "name": "Adam Nee",
        "character": "Officer Sawyer"
      },
      {
        "name": "Raymond Lee",
        "character": "Officer Gomez"
      },
      {
        "name": "Omar Patin",
        "character": "Limo Driver"
      },
      {
        "name": "Anthony Alvarez",
        "character": "Cigar Man"
      },
      {
        "name": "Ryan Orr",
        "character": "Biker"
      },
      {
        "name": "Alex Schoenauer",
        "character": "Biker"
      },
      {
        "name": "Edwin Polanco",
        "character": "Chef"
      },
      {
        "name": "Marcy Jarreau",
        "character": "Barb"
      },
      {
        "name": "Cynthia Guzmán",
        "character": "Audience Member"
      },
      {
        "name": "Carolina Rohana",
        "character": "Nerdy Teenage Girl"
      },
      {
        "name": "Jonathan Lev",
        "character": "Airline Employee"
      },
      {
        "name": "Katherine Montes",
        "character": "Dash Fan"
      },
      {
        "name": "Toussaint Merionne",
        "character": "Uniformed Man"
      },
      {
        "name": "Luinis Olaverria",
        "character": "Villager"
      },
      {
        "name": "Emerson Gonzalez",
        "character": "Local"
      },
      {
        "name": "Wilson Ureña",
        "character": "Consular Clerk"
      },
      {
        "name": "Roger Wasserman",
        "character": "Sound Person"
      },
      {
        "name": "Ryan Judd",
        "character": "PA Announcer (voice)"
      },
      {
        "name": "Zachary Steel",
        "character": "Meditation Leader (voice)"
      }
    ],
    "crew": [
      {
        "name": "Marlene Stewart",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Craig Alpert",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "James D. Bissell",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Liza Chasin",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Jonathan Sela",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Sandra Bullock",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Peter Lyons Collister",
        "department": "Directing",
        "job": "Second Unit Director"
      },
      {
        "name": "Paul Massey",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Dana Fox",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Pinar Toprak",
        "department": "Sound",
        "job": "Music"
      },
      {
        "name": "Seth Gordon",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Seth Gordon",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Alison Faulk",
        "department": "Crew",
        "job": "Choreographer"
      },
      {
        "name": "Mike Gunther",
        "department": "Directing",
        "job": "Second Unit Director"
      },
      {
        "name": "Adam Nee",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Adam Nee",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Aaron Nee",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Aaron Nee",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Tricia Wood",
        "department": "Production",
        "job": "Casting Director"
      },
      {
        "name": "Oren Uziel",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Wilhem Perez",
        "department": "Art",
        "job": "Supervising Art Director"
      },
      {
        "name": "Janine Rath",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Whitney James",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Jonathan Hook",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Hannah Betts",
        "department": "Crew",
        "job": "Stunt Double"
      },
      {
        "name": "Charlie Endean",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Stacey Panepinto",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Lisa Rodgers",
        "department": "Crew",
        "job": "Post Production Supervisor"
      },
      {
        "name": "Adam Walls",
        "department": "Costume & Make-Up",
        "job": "Key Makeup Artist"
      },
      {
        "name": "Lauren Shaw",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Karen Frick",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Analyn Cruz",
        "department": "Costume & Make-Up",
        "job": "Key Hair Stylist"
      },
      {
        "name": "María Fernanda Muñoz",
        "department": "Art",
        "job": "Supervising Art Director"
      },
      {
        "name": "Margaret Chernin",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Taschi Lynell",
        "department": "Costume & Make-Up",
        "job": "Hair Department Head"
      },
      {
        "name": "Mayret Velasquez",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Ashunta Sheriff",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Julia Gunn",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Ico Abreu",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "Shantalle Hungría",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Tommy Rodriguez",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "Aura Faulkner",
        "department": "Art",
        "job": "Set Designer"
      },
      {
        "name": "Tamara Medrano",
        "department": "Art",
        "job": "Set Designer"
      },
      {
        "name": "Miguel Fernandez",
        "department": "Production",
        "job": "Casting Director"
      },
      {
        "name": "Ana María Andrickson",
        "department": "Costume & Make-Up",
        "job": "Key Makeup Artist"
      },
      {
        "name": "Carlucy R. Perrone",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Selenia Hernandez",
        "department": "Costume & Make-Up",
        "job": "Assistant Hairstylist"
      },
      {
        "name": "Rebecca Deelo",
        "department": "Production",
        "job": "Production Supervisor"
      },
      {
        "name": "Julissapina",
        "department": "Production",
        "job": "Production Supervisor"
      },
      {
        "name": "Mila Ramirez",
        "department": "Production",
        "job": "Production Manager"
      },
      {
        "name": "Luis Alfaro",
        "department": "Production",
        "job": "Production Assistant"
      },
      {
        "name": "Maria Eliza Franco",
        "department": "Production",
        "job": "Assistant Production Manager"
      },
      {
        "name": "Ana Guerrero Guillen",
        "department": "Production",
        "job": "Production Manager"
      },
      {
        "name": "Shari Hanson",
        "department": "Production",
        "job": "Executive In Charge Of Production"
      },
      {
        "name": "Johnny Morales Jr.",
        "department": "Production",
        "job": "Production Assistant"
      },
      {
        "name": "Yve Figuereo",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Nathan Carlson",
        "department": "Art",
        "job": "Graphic Designer"
      }
    ]
  },
  "keywords": [
    "duringcreditsstinger"
  ],
  "mpaa": "PG-13",
  "summaries": [
    "A reclusive romance novelist on a book tour with her cover model gets swept up in a kidnapping attempt that lands them both in a cutthroat jungle adventure.",
    "Reclusive author Loretta Sage writes about exotic places in her popular adventure novels that feature a handsome cover model named Alan. While on tour promoting her new book with Alan, Loretta gets kidnapped by an eccentric billionaire who hopes she can lead him to an ancient city's lost treasure from her latest story. Determined to prove he can be a hero in real life and not just on the pages of her books, Alan sets off to rescue her.—Anonymous",
    "Struggling to find inspiration, reclusive, burnt-out romance author Loretta Sage tries her best to put the finishing touches on her latest work in time for a book tour. However, as if having her manager Beth breathing down her neck wasn't enough, insisting on completing her publicity tour, Loretta's world will turn upside down when an unstoppable billionaire kidnaps her. Now, it's up to Alan, Loretta's long-time cover model, to save the day. But the question remains. Is Alan hero material?—Nick Riganas"
  ],
  "synopsis": "Loretta Sage (Sandra Bullock) is a novelist known for writing sweeping adventures featuring a fictional hero named Dash. She's in the midst of writing her latest book, imagining herself and Dash in a dangerous situation involving snakes and henchmen. However, she notes certain things wrong with it and \"deletes\" it all. She finds herself pressured over the death of her explorer husband from years prior, along with her publicist (Da'Vine Joy Randolph), who's demanding to see the latest draft of her book.Later on, Loretta, dressed in a purple sequined jumpsuit, is invited to an expo to speak about the book, egged on by her publicist and her social media manager (Patti Harrison). She's hesitant to go when she learns that the cover model for Dash, Alan Caprison (Channing Tatum) will also be there. She goes anyway, and Alan comes on stage to huge applause from the fans, wearing a fake blonde wig. Somewhere over the midst of the presentation, a fan asks for \"Dash\" to dip Loretta. She attempts to go through the motions, but rips off Alan's blonde wig, ending the presentation abruptly.After being chewed out by her publicist, Loretta finds her way outside instead of going to the next interview she's supposed to be at. She separates from Alan after a fight. She calls for a car, and is suddenly picked up in a black SUV and surrounded by mysterious henchmen. Alan sees her driving away and tries to pursue them, to no avail.Loretta comes face to face with Abigail Fairfax (Daniel Radcliffe), an eccentric billionaire who tries to woo her with a bunch of cheeses. He explains that an artifact hints at a mysterious treasure off of a small island, which could be wiped away by a volcano ready to erupt at any second. He asks Loretta to name her price, but she refuses. He then reveals that they have a plane waiting for her, and he knocks her out.Back at the hotel, Alan feels guilt for what happened to Loretta. He, her publicist, and her social media manager try to track her down. He eventually calls an old buddy he did yoga with, Jack Trainer (Brad Pitt) to help locate her via her Smart Watch. He tells Alan to meet him on the island and he'll have her back \"within 48 hours.\"Loretta awakens, and is led to a campground where Abigail has set up shop to research the location of the treasure on the island. He has Loretta tied down and demands she get to work. Meanwhile, Alan makes his way to the island in pure touristy-fashion and meets up with Jack, and the two go off in a little car to Abigail's compound.After a short nap, Abigail pressures Loretta even more to translate the small piece he's found hinting at the treasure. She translates it, but he wants her to do it again. Meanwhile, Trainer dispatches of a number of his troops while Alan, locked out of the car he was supposed to stay in, serves as a useless backup, occasionally slapping a henchman or two.The pair eventually make their way to Loretta, but can't untie her out of the chair. They end up carrying her, chair and all, out of the compound as explosions go off. They make their way back to the car, but before they can leave, Jack is shot in the head, with his \"brains\" all over Alan's face. They eventually load into the car, with Loretta still in the chair, and take off. Abigail, furious that Loretta took the only puzzle piece with her, demands her recapture.Loretta and Alan pull over after a quick escape, after Loretta had fallen out of the car. Alan frees her from the chair, but after they return to the car, it falls over the side of the cliff, leaving them unable to contact the authorities. They eventually make their way to the car, but the phone is destroyed, and Alan suggests they go through the jungle to get to the airport to reach the authorities. Abigail's forces remain in hot pursuit.After a quick excursion in a small pound that leaves Alan covered with leeches (especially on his butt), Loretta picks them off and then eventually reaches a waterfall. It's here that Loretta uses the clue she stole from Abigail to decipher the rest of the mysterious puzzle he was trying to solve, indicating the treasure is hidden in somewhere with \"endless tears.\" The two then find themselves nearly caught by Abigail's henchmen, climbing up a mountain to escape them. Alan tries to help Loretta by pushing her from below, with his head between her legs. Eventually, they make it to the top.The two set up camp, talking about the adventure they've had while eventually falling asleep in a rather small hammock. Meanwhile, Abigail calls upon a trio of motorcycle-riding thugs to engage in the pursuit.In the morning, Loretta eventually tells Alan what she really thinks of him, explaining that he's just a cover model looking for attention. Alan actually reveals he came from a family and enjoys being Dash, as it makes the fans happy, and scorns Loretta for not trying to please the fans. The pair begin moving again, eventually making their way to a small village. After talking with the local police for protection, the duo get cleaned up and start to get acquainted with the village folk.All the while, the publicist has taken it upon herself to pursue Loretta and get her back. She takes a small charter to a tiny airport, where they eventually tell her there's no ride. It's here she meets Oscar (Oscar Nunez) and his goat, who are happy to take her there by transport. She eventually reaches a small police station, only for them to tell her they're \"closed.\" She eventually convinces them to help her.After a quick dance (egged on by a local woman), Loretta learns from her a clue where the pool of \"endless tears\" just might be, and requests Alan to come with her to hunt the treasure down. Excited to find her adventure spirit again, she convinces him and he goes to get some supplies. However, she finds Abigail waiting, who recaptures her and begins to drive off. Alan follows on a small motorbike.Following a brief chase, Loretta sets the inside of the vehicle on fire while Alan fights (poorly) against thugs up top. Eventually, the two are captured and led to the island, where Abigail furiously wants to find the treasure. They make their way inside, where one of his thugs falls off a cliff side after mocking Loretta. They work their way through a small tunnel and find a tomb waiting inside.After opening up a crypt by force, it's discovered that the treasure is nothing more than collected seashells, a show of love for a man to his beloved. Angry that they've found nothing. Abigail traps Loretta and Alan inside a tomb as the volcano begins to erupt, but not before his henchman leaves them a crowbar. Following a talk for a few minutes about the adventure they've had, Alan uses the crowbar to get the duo out.Abigail is met by the publicist and the police forces, where he pretends he's an innocent victim after his henchman takes off with the boat. Meanwhile, Loretta and Alan barely escape the tomb after many explosions, only to be recovered by the publicist. After telling the truth about Abigail, he attempts to escape but is tackled by Oscar, who says he has the publicist's back. Loretta and Alan recover on a nearby rock, recreating the cover for her next book, which publishes months later.In the final scene, the publicist, the social media manager, and Oscar are relaxing on an island following the launch of their book, while Loretta and Alan are nearby, talking about the relationship they've created over the course of their adventure. After a bit of odd conversation, they kiss.In a mid-credits sequence, Loretta and Alan are taking part in some relaxing yoga. It's here that Jack Trainer returns. They're in shock that he's still alive, and he can't help but give them odd glances as they get back to their relaxation."
}