{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/w2rWEjAMYErpNfoK2Z0GFh1LFhN.jpg",
  "id": 819,
  "title": "Sleepers",
  "poster_path": "https://image.tmdb.org/t/p/w500/yUpiEk2EojS9ZEXb3nIQonQCYYF.jpg",
  "release_date": "1996-10-18",
  "vote_average": 7.598,
  "vote_count": 3323,
  "popularity": 41.652,
  "overview": "Two gangsters seek revenge on the state jail worker who during their stay at a youth prison sexually abused them. A sensational court hearing takes place to charge him for the crimes.",
  "imdb_id": "tt0117665",
  "budget": 44000000,
  "homepage": "",
  "revenue": 165600000,
  "runtime": 147,
  "tagline": "Four friends have made a mistake that will change their lives forever.",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "production_companies": [
    "Propaganda Films",
    "Baltimore Pictures",
    "Warner Bros. Pictures",
    "PolyGram Filmed Entertainment"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Kevin Bacon",
        "character": "Sean Nokes"
      },
      {
        "name": "Robert De Niro",
        "character": "Father Bobby"
      },
      {
        "name": "Dustin Hoffman",
        "character": "Danny Snyder"
      },
      {
        "name": "Jason Patric",
        "character": "Lorenzo 'Shakes' Carcaterra"
      },
      {
        "name": "Brad Pitt",
        "character": "Michael Sullivan"
      },
      {
        "name": "Brad Renfro",
        "character": "Young Michael Sullivan"
      },
      {
        "name": "Minnie Driver",
        "character": "Carol Martinez"
      },
      {
        "name": "Billy Crudup",
        "character": "Tommy Marcano"
      },
      {
        "name": "Ron Eldard",
        "character": "John Reilly"
      },
      {
        "name": "Vittorio Gassman",
        "character": "King Benny"
      },
      {
        "name": "Terry Kinney",
        "character": "Ralph Ferguson"
      },
      {
        "name": "Bruno Kirby",
        "character": "Shakes' Father"
      },
      {
        "name": "Frank Medrano",
        "character": "Fat Mancho"
      },
      {
        "name": "Joe Perrino",
        "character": "Young Lorenzo 'Shakes' Carcaterra"
      },
      {
        "name": "Geoffrey Wigdor",
        "character": "Young John Reilly"
      },
      {
        "name": "Jonathan Tucker",
        "character": "Young Tommy Marcano"
      },
      {
        "name": "Peter Appel",
        "character": "Boyfriend"
      },
      {
        "name": "Joseph Attanasio",
        "character": "Male Juror (as Joe Attanasio)"
      },
      {
        "name": "Gerry Becker",
        "character": "Forensics Expert"
      },
      {
        "name": "Eugene Byrd",
        "character": "Rizzo"
      },
      {
        "name": "Pasquale Cajano",
        "character": "Superintendent"
      },
      {
        "name": "Robert W. Castle",
        "character": "Priest"
      },
      {
        "name": "John Di Benedetto",
        "character": "Tony"
      },
      {
        "name": "Jeffrey Donovan",
        "character": "Addison"
      },
      {
        "name": "George Georgiadis",
        "character": "Hot Dog Vendor"
      },
      {
        "name": "Marco Greco",
        "character": "Waiter"
      },
      {
        "name": "Saverio Guerra",
        "character": "Man #1"
      },
      {
        "name": "Paul Herman",
        "character": "Court Bailiff"
      },
      {
        "name": "Lennie Loftin",
        "character": "Styler"
      },
      {
        "name": "Chuck Low",
        "character": "Judge"
      },
      {
        "name": "Ruth Maleczech",
        "character": "Woman at Subway Station"
      },
      {
        "name": "Danny Mastrogiorgio",
        "character": "Nick Davenport"
      },
      {
        "name": "Mary B. McCann",
        "character": "Sister Carolyn (as Mary McCann)"
      },
      {
        "name": "Pat McNamara",
        "character": "Guard"
      },
      {
        "name": "Peter McRobbie",
        "character": "Lawyer"
      },
      {
        "name": "Dash Mihok",
        "character": "K.C."
      },
      {
        "name": "Michael P. Moran",
        "character": "Judge #1"
      },
      {
        "name": "Mick O'Rourke",
        "character": "Man in Tub"
      },
      {
        "name": "James Pickens Jr.",
        "character": "Marlboro"
      },
      {
        "name": "Wendell Pierce",
        "character": "Little Caesar"
      },
      {
        "name": "Sean Patrick Reilly",
        "character": "Young King Benny"
      },
      {
        "name": "Peter Rini",
        "character": "Frank Magciccio"
      },
      {
        "name": "Larry Romano",
        "character": "Man #2"
      },
      {
        "name": "Tom Signorelli",
        "character": "Confessional Man"
      },
      {
        "name": "John Slattery",
        "character": "Carlson"
      },
      {
        "name": "Patrick Tull",
        "character": "Jerry the Bartender"
      },
      {
        "name": "Aida Turturro",
        "character": "Mrs. Salinas"
      },
      {
        "name": "James Rosin",
        "character": "Neighbourhood Man"
      },
      {
        "name": "Ralph Tabakin",
        "character": "Warden"
      }
    ],
    "crew": [
      {
        "name": "John Williams",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Steve Golin",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Louis DiGiaimo",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Gary Rydstrom",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Richard Beggs",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Michael Ballhaus",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Barry Levinson",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Barry Levinson",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Barry Levinson",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Stu Linder",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Joseph P. Reidy",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Tim Holland",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Kristi Zea",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Gloria Gresham",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Lorenzo Carcaterra",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Lorenzo Carcaterra",
        "department": "Production",
        "job": "Co-Producer"
      },
      {
        "name": "Peter Giuliano",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Gerrit van der Meer",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Gerrit van der Meer",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Tim Galvin",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Beth A. Rubino",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Sam Hoffman",
        "department": "Directing",
        "job": "Second Assistant Director"
      },
      {
        "name": "Lora Hirschberg",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Ken Fischer",
        "department": "Sound",
        "job": "Sound Effects Editor"
      }
    ]
  },
  "keywords": [
    "child abuse",
    "sexual abuse",
    "court case",
    "court",
    "repayment",
    "sadistic",
    "pastor",
    "juvenile prison",
    "juvenile delinquent",
    "child"
  ],
  "mpaa": "R",
  "summaries": [
    "After a prank goes disastrously wrong, a group of boys are sent to a detention center where they are brutalized. Thirteen years later, an unexpected random encounter with a former guard gives them a chance for revenge.",
    "As children, Lorenzo Carcaterra - Shakes to his friends - Michael Sullivan, Tommy Marcano, and John Reilly were inseparable. They grew up in Hell's Kitchen, a far from perfect neighborhood, one filled as Shakes says with scams and shake downs, but one where the rules were known and easily understood by its residents. The one adult who they admired was Father Bobby Carelli, who understood them as kids more than most adults and more than he himself would like to admit. In 1967, their lives would change forever when a typical teenage prank went wrong which led to the four of them being sentenced to various terms at Wilkinson Home for Boys, a reformatory. There, they were physically, emotionally and sexually abused primarily by Sean Nokes, the predatory lead guard of their cell block, and fellow guards Ralph Ferguson, Henry Addison, and Adam Styler, although there were other decent figures of authority at the home, including a few other guards. Their time at the home affected the four, not all who were able to emerge from the experience to regroup their lives. In their want to forget about the experience, they made a vow not to talk about it either between themselves or with others. Fast forward thirteen years, with Tommy and Johnny being career criminals, Michael an assistant district attorney and Shakes a newspaper writer, their friendship on the surface more loose than it was when they were children. When Tommy and John unexpectedly spot Nokes at a local restaurant, it leads to Shakes and Michael banding together to exact revenge not only on Nokes but all four of the guards who abused them. Michael had long mapped out a plan even before Tommy and John saw Nokes, but that sighting and its aftermath alters the plan. Beyond the precarious position Tommy and John place themselves into, Michael has the most to lose even if the plan succeeds. Most of the plan implementation is left to Shakes who has to enlist the machine of Hell's Kitchen, including mob boss King Benny, and their childhood friend, social worker Carol Martinez, who currently is John's girlfriend. Beyond co-opting aging lawyer Danny Snyder, who admits he may not be the best choice as an alcoholic who is no longer near the top of his game, the plan is threatened by a key piece, the need for an unreproachable figure to perjure him or herself, that person who Michael and Shakes hopes will be Father Bobby. Father Bobby, even if he knew of the abuse, may not be able to do his friends this enormous favor of an illegal nature, he who has to balance the morality of the situation in his own mind in deciding what to do.—Huggo",
    "Set in Hell's Kitchen, Sleepers follows four young boys whose lives are forever changed when a prank goes disastrously wrong and they are sent to Wilkinson Home for Boys, a place for reform. Fast forward thirteen years, and a chance encounter brings the four boys together again for a chance at revenge - a dish best served cold.—BecksyKane",
    "Four boys growing up in Hell's Kitchen play a prank that leads to an old man getting hurt. Sentenced to no less than one year in the Wilkinson Center in upstate New York, the four friends are changed by the beating, humiliation and sexual abuse by the guards sworn to protect them. Thirteen years later and a chance meeting lead to a chance for revenge against the Wilkinson Center and the guards.—Albert@SaveKoalas.com"
  ],
  "synopsis": "Lorenzo \"Shakes\" Carcaterra (Jason Patric), Thomas \"Tommy\" Marcano (Billy Crudup), Michael Sullivan (Brad Pitt), and John Reilly (Ron Eldard) are four childhood friends who grew up in Hell's Kitchen, New York City in the mid-1960s. Hell's kitchen was an immigrant neighborhood and life was tough. Domestic violence was a daily occurrence, but the Kitchen also protected its own from outside criminals.\nDuring this time, the local priest, Father Bobby Carillo (Robert De Niro), plays a very important part in their lives and keeps an eye on them. They served as altar boys at the church.\nHowever, early on they start running small errands for a local gangster, King Benny (Vittorio Gassman).The boys also had a competition going on who could play the boldest prank. Mostly it was innocent stuff like sitting in the priest's chamber of the confession booth, or poking holes into walls to ogle at naked women changing clothes in the change rooms.\nOn a summer day in 1967, their lives take a sharp turn when they almost kill a man after pulling a prank on a hot dog vendor. They accidentally roll the cart down a set of subway stairs, severely injuring an elderly man. As punishment, they are all sentenced to serve time at the Wilkinson Home for Boys in Upstate New York. Shakes is given six-to-twelve months, while the others are given 12-to-18 months.The juvenile center is full of hard-core offenders, with no method for rehabilitation.\nThere, the boys are systematically beaten, abused, and sexually assaulted by guards Sean Nokes (Kevin Bacon), Henry Addison (Jeffrey Donovan), Adam Styler (Lennie Loftin), and Ralph Ferguson (Terry Kinney). These traumatic events change the boys and their friendship forever.\nFather Bobby visited the boys regularly, but Nokes warned them not to say anything else the reprisals would be severe. Father Bobby gives Shakes the strength to keep going.\nMr. Carlson (John Slattery) is the English teacher at the facility and appreciates the interest that Shakes shows in the subject. Guard Marlboro (James Pickens Jr.) is the only one who tries to protect the boys a little bit from the brutality of the predators.When at the facility, the boys participate in Wilkinson's annual football game between the guards and inmates. Michael convinces inmate Rizzo Robinson (Eugene Byrd) to help win the game. Humiliated, the guards move the boys to solitary confinement for weeks, where they are systematically beaten. Rizzo does not survive, and his family is told he had died of pneumonia.In spring 1968, shortly before Shakes's release from Wilkinson, he suggests the boys publicly report the abuse. The others refuse, with Michael asserting that no one would believe them or care, and they vow to never speak of it again. The night before Shakes is released, Nokes and the other guards arrange a \"farewell party\", in which the four boys are brutally sexually assaulted worse than they have been before.Fourteen years later in 1981, John and Tommy, now gangsters, find Sean Nokes in a Hell's Kitchen pub. When John and Tommy confront him, he dismisses the abuse he put them through. They both shoot him dead in front of several witnesses.\nMike, now an assistant District Attorney, arranges to be assigned to the case, secretly intending to botch the prosecution to use it as a means of getting revenge.Moreover, he and Shakes begin forging a plan to get their revenge on all the guards who abused them. Together with many of their lifelong friends, especially Carol (Minnie Driver), a social worker, and King Benny, they manage to carry out their revenge using information on all the Wilkinson guards compiled by Mike previously. Benny spreads the word not to touch Mike and forbids any hits on Mike for taking the case against John and Tommy.\nMike says that all Juvenile records are destroyed after 7 years, so there is no link between them and the guards anymore.They hire Danny Snyder (Dustin Hoffman), a washed-up, alcoholic lawyer, to defend John and Tommy to make it seem as if the case is hopeless, allowing them to carry out their plan without being watched.\nBenny gets involved and 2 of the 4 witnessed change their minds about testifying against John and Tommy.\nMike provides all the research to Danny to prove that one of the witnesses who testifies to have seen both John and Tommy walk out of the pub, was drunk at the time of the shooting.However, to clinch the case they need a key witness who can give John and Tommy an alibi. Shakes has a long talk with Father Bobby and tells him about the abuse they suffered at Wilkinson.\nMike calls Ralph Ferguson as a character witness in court. Again, Danny has been provided a detailed list of questions to expose Ferguson and Nokes as serial abusers of kids at the juvenile facility. Ferguson breaks down under the strain of the questions and his oath and admits to all accusations against him and Nokes.After a few days of soul-searching, Father Bobby agrees to lie on the stand about where John and Tommy were on the night of the shooting; the priest swears under oath that they were with him at Madison Square Garden at a New York Knicks basketball game.\nAs a result, they are acquitted.The remaining guards are also punished for their crimes: one, Henry Addison, is killed by the drug gang run by the older brother of Rizzo (who was informed by Benny about Addison's crimes against Rizzo), a boy killed years before in the Wilkinson Home; the other, Adam Styler, a corrupt policeman accused of extorting and killing a drug dealer, is exposed, and arrested. Mike and Shakes had provided all the evidence against Adam to a detective, who was Benny's cousin.After the case is over, Mike quits his job as an attorney and moves to the English countryside where he becomes a carpenter; John drinks himself to death and Tommy is eventually murdered, both within a few years of the acquittal."
}