{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/friU3sWmplu7NbBEQBUFHyulsyY.jpg",
  "id": 8456,
  "title": "Never Back Down",
  "poster_path": "https://image.tmdb.org/t/p/w500/8oRUTyP1QAtGDMvRpKZyuyFPG0U.jpg",
  "release_date": "2008-03-04",
  "vote_average": 6.747,
  "vote_count": 2193,
  "popularity": 38.946,
  "overview": "Jake, full of anger after his father's death, is just starting to find a place for himself at his new Orlando high school - until Ryan, head of an underground MMA fight club, picks Jake out as a prime opponent. After being trounced by Ryan in front of the entire school, Jake begins training under the firm, moral guidance of a MMA master, where he learns how to fight... and how to avoid a fight. But it becomes obvious that a rematch will be inevitable if Jake wants to stop Ryan and his bullying, once and for all.",
  "imdb_id": "tt1023111",
  "budget": 20000000,
  "homepage": "http://www.neverbackdownthemovie.com/",
  "revenue": 41627431,
  "runtime": 115,
  "tagline": "Win or lose... Everyone has their fight.",
  "genres": [
    "Drama",
    "Action"
  ],
  "production_companies": [
    "Summit Entertainment",
    "Mandalay Pictures",
    "Baumgarten Management and Productions (BMP)",
    "Mandalay Independent Pictures"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Sean Faris",
        "character": "Jake Tyler"
      },
      {
        "name": "Amber Heard",
        "character": "Baja Miller"
      },
      {
        "name": "Cam Gigandet",
        "character": "Ryan McCarthy"
      },
      {
        "name": "Djimon Hounsou",
        "character": "Jean Roqua"
      },
      {
        "name": "Evan Peters",
        "character": "Max Cooperman"
      },
      {
        "name": "Leslie Hope",
        "character": "Margot Tyler"
      },
      {
        "name": "Wyatt Smith",
        "character": "Charlie Tyler"
      },
      {
        "name": "Neil Brown Jr.",
        "character": "Aaron"
      },
      {
        "name": "Lauren Leech",
        "character": "Jenny"
      },
      {
        "name": "Nadine Avola",
        "character": "Bikini Party Girl (uncredited)"
      },
      {
        "name": "Tilky Jones",
        "character": "Eric"
      },
      {
        "name": "Steven Crowley",
        "character": "Ben"
      },
      {
        "name": "Tom Nowicki",
        "character": "Mr. Lloyd"
      },
      {
        "name": "Chele André",
        "character": "Max's Girl"
      },
      {
        "name": "Affion Crockett",
        "character": "Beatdown DJ"
      },
      {
        "name": "Chris Lindsay",
        "character": "Beat Down Referee"
      },
      {
        "name": "David W. Scott",
        "character": "Loading Dock Worker (uncredited)"
      },
      {
        "name": "Milissa Sears",
        "character": "Baja's Friend (uncredited)"
      },
      {
        "name": "Jonathan Eusebio",
        "character": "Dak Ho"
      },
      {
        "name": "Jocelyn Binder",
        "character": "Hot Tub Chick"
      },
      {
        "name": "Deon Stein",
        "character": "Hot Tub Chick"
      },
      {
        "name": "Andy Ussach",
        "character": "Man at Coffee Shop (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Sarah Halley Finn",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Ida Random",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Scott Jacobson",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Judy L. Ruskin",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Victor Du Bois",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Anna MacKenzie",
        "department": "Sound",
        "job": "ADR Editor"
      },
      {
        "name": "Craig Baumgarten",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Christopher Assells",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Lon Bender",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Randi Hiller",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Julianne Jordan",
        "department": "Sound",
        "job": "Music Supervisor"
      },
      {
        "name": "Jeff Wadlow",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Chris Hauty",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "David Zelon",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Lukas Ettlin",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Debra Weinfeld",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Jonathan Eusebio",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Jonathan Eusebio",
        "department": "Crew",
        "job": "Fight Choreographer"
      },
      {
        "name": "Michael Wandmacher",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Andrew White",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Bill Bannerman",
        "department": "Crew",
        "job": "Aerial Coordinator"
      },
      {
        "name": "Brown Cooper",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Onnalee Blank",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "John R. Woodward",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Jacques Jouffret",
        "department": "Camera",
        "job": "Steadicam Operator"
      },
      {
        "name": "Daniel Hernández",
        "department": "Crew",
        "job": "Fight Choreographer"
      },
      {
        "name": "Lee Grimes",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Melinda Taksen",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Jon Title",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Frederick H. Stahly",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "James L. Roberts",
        "department": "Visual Effects",
        "job": "Special Effects Supervisor"
      },
      {
        "name": "Damon Caro",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Damon Caro",
        "department": "Crew",
        "job": "Fight Choreographer"
      },
      {
        "name": "Ann Scibelli",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Gene Page",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Michelle Pazer",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "Deborah Palmer",
        "department": "Art",
        "job": "Set Designer"
      },
      {
        "name": "Karen Jarnecke",
        "department": "Production",
        "job": "Production Coordinator"
      },
      {
        "name": "Dan Cornwall",
        "department": "Lighting",
        "job": "Chief Lighting Technician"
      },
      {
        "name": "Peter Staubli",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Laura Harris Atkinson",
        "department": "Sound",
        "job": "Dialogue Editor"
      },
      {
        "name": "Dan Hegeman",
        "department": "Sound",
        "job": "Sound Editor"
      },
      {
        "name": "Marc Wostak",
        "department": "Lighting",
        "job": "Rigging Gaffer"
      },
      {
        "name": "Donald Dowd",
        "department": "Crew",
        "job": "Editorial Staff"
      },
      {
        "name": "Glynna Grimala",
        "department": "Sound",
        "job": "ADR Supervisor"
      },
      {
        "name": "James Harris",
        "department": "Art",
        "job": "Construction Coordinator"
      },
      {
        "name": "Jane Hassinger",
        "department": "Costume & Make-Up",
        "job": "Key Hair Stylist"
      },
      {
        "name": "Nancy Cummings",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Nicholas J. Romanac",
        "department": "Art",
        "job": "Property Master"
      },
      {
        "name": "Eddie Evans",
        "department": "Camera",
        "job": "Key Grip"
      },
      {
        "name": "Dan Whiting",
        "department": "Sound",
        "job": "Boom Operator"
      },
      {
        "name": "Justin A. Williams",
        "department": "Crew",
        "job": "Fight Choreographer"
      },
      {
        "name": "Frank Boone",
        "department": "Camera",
        "job": "Dolly Grip"
      },
      {
        "name": "Bruce Schluter",
        "department": "Art",
        "job": "Title Designer"
      },
      {
        "name": "Barnaby Smith",
        "department": "Costume & Make-Up",
        "job": "Costume Supervisor"
      },
      {
        "name": "Michael Charboneau",
        "department": "Art",
        "job": "Construction Foreman"
      },
      {
        "name": "Diane Maurno",
        "department": "Costume & Make-Up",
        "job": "Key Makeup Artist"
      },
      {
        "name": "Rod England",
        "department": "Art",
        "job": "Leadman"
      },
      {
        "name": "Brian P. Harris",
        "department": "Crew",
        "job": "Propmaker"
      },
      {
        "name": "Deborah Kruse",
        "department": "Art",
        "job": "Art Department Coordinator"
      },
      {
        "name": "Douglas Winters",
        "department": "Crew",
        "job": "Propmaker"
      },
      {
        "name": "Danny Mallory",
        "department": "Camera",
        "job": "Dolly Grip"
      },
      {
        "name": "Mariasoleoad McGrory",
        "department": "Costume & Make-Up",
        "job": "Seamstress"
      },
      {
        "name": "Stephanie Polo",
        "department": "Costume & Make-Up",
        "job": "Key Costumer"
      },
      {
        "name": "Howard Leder",
        "department": "Editing",
        "job": "Assistant Editor"
      },
      {
        "name": "Rick Callan",
        "department": "Production",
        "job": "Location Manager"
      },
      {
        "name": "Micha Liberman",
        "department": "Sound",
        "job": "Music Editor"
      }
    ]
  },
  "keywords": [
    "high school",
    "martial arts",
    "sports",
    "fight",
    "underground",
    "rebel",
    "training",
    "champion",
    "revenge",
    "nemesis",
    "club",
    "brawl"
  ],
  "mpaa": "PG-13",
  "summaries": [
    "A frustrated and conflicted teenager arrives at a new high school to discover an underground fight club, and meets a classmate who begins to coerce him into fighting.",
    "At his new high school, a rebellious teen Jake Tyler is lured into an ultimate underground fighting club in a Backyard Fight, where he finds a mentor in a mixed martial arts veteran. After receiving threats to the safety of his friends and family, Jake seeks the mentoring of a veteran fighter, to train his mind and body for one final no-holds-barred elimination fight with his unrelenting personal nemesis and local martial arts champion Ryan McCarthy.—Anthony Pereyra {hypersonic91@yahoo.com}"
  ],
  "synopsis": "Jake Tyler (Sean Faris) helps his high-school football team win an important game. A frustrated player from the opposing team makes taunts about Jake's father, who died while driving drunk. Infamously-hot-tempered Jake starts a brawl with the opposing player. Spectators capture the brawl with mobile phones and video-cameras. Soon, the brawl is uploaded to YouTube.Jake gets thrown off the team for brawling, but takes it in stride because he is leaving this school anyway. He and his younger brother Charlie (Wyatt Henry Smith) are moving with their widowed mom to Orlando, Florida where Charlie has received a tennis scholarship. The Tyler brothers are close despite Jake's penchant for fighting and getting into trouble, which greatly upsets their mom (Leslie Hope).At his new school, Jake has a hard time fitting in. He catches the eye of Baja Miller (Amber Heard), a pretty classmate who flirts with him. Later, Jake notices fellow student Max Cooperman (Evan Peters) getting beaten up on campus. Jake rushes to Max's aid, only to discover that the \"bullying\" he disrupted was actually a street-kickboxing match. Everybody present, including Max, demands that the astonished Jake leave.At school the next day, Max lets it be known that there are videos on the internet of Jake's football brawl, which has gained him a positive reputation on campus. Max invites Jake to come and learn mixed martial arts with his instructor, while Baja invites Jake to a party at her boyfriend Ryan McCarthy's mansion. Jake declines the former offer but accepts the latter. At McCarthy Manor that night, host Ryan (Cam Gigandet) - having seen the internet footage - challenges Jake to demonstrate his brawling prowess in a fight against...Ryan himself. When Jake refuses the challenge, letting Ryan know that Jake came to the party only because Baja invited him. Ryan kisses Baja in front of Jake to verify whose girlfriend she is. Jake realizes that he's being set up, and attempts to leave - until Ryan makes taunts about the disgraceful death of Jake's dad. An angry Jake accepts the challenge but is brutally defeated by Ryan. Baja appears disgusted with Ryan for continually beating on Jake, despite the fact that Jake was obviously down and out.A day later, Max comes to Jake's house, and repeats the invitation to come and learn Mixed Martial Arts from Max's instructor, Jean Roqua (Djimon Hounsou). This time, Jake accepts. He meets Max at Roqua's gym and is introduced to Roqua himself. Roqua briefly interviews Jake...who, he senses, is there for the wrong reasons. Nonetheless, Roqua allows Jake to train with him - both in class, and personally before classes - on the condition that Jake does not fight anybody for any reason outside the gym. Jake notices that Roqua apparently lives in the gym.The night after Jake's first training session, Baja comes over to his house to apologize for setting him up at the party. Jake quickly retorts after Baja tells him about her school life, saying \"Does that mean I'm meant to feel sorry for you because you're popular?\" The next day, Baja confronts Ryan and breaks up with him on account that he beat Jake up. In his anger, he grabs Baja's arm and refuses to let go, even after she pleads. Jake appears and attempts to stop it, only to which Ryan insults his late father, saying \"You're weak...like your old man...was\". This insult has a negative impact on Jake's training that afternoon. At the gym, he is too aggressive, and, Roqua, sensing this, tells him to go home to cool off. Max gives Jake a ride in his Ford Mustang. At a set of lights, three guys in a yellow Hummer relentlessly and annoyingly beep their horn at Max. Jake, still angry from Ryan's insult, and spurred on by the repetitive horn, goes out to confront the three guys. He beats them all up on the street, and the footage is filmed by Max, and uploaded and spread throughout the internet. This further improves his social profile within the school, now being the second-most popular boy after Ryan.The next training session, and unfortunately for Jake, Roqua sees that Jake has wounds on his knuckles which could have only come from fighting against his rules and banishes Jake from the gym. When Roqua goes grocery shopping, Jake confronts him and admits that Roqua was right: he signed up to train for the wrong reasons. Jake also tells Roqua the late Mr. Tyler's story; evidently, Jake feels that his mother blames him for her husband's demise. Roqua then tells his story: he had an younger brother, who was an excellent mixed-martial artist. One day in a bar, a local bully mouthed off at young Joseph, who was about to fight the bully himself. His brother won the brawl, only to be shot and killed by the bully's friends. Jean's father blames him for permitting the situation to escalate into violence which could have been avoided. Jean left home over that; he has not seen his father, or even set foot in Brazil, for the past seven years.Jake declines to enter The Beatdown. When Ryan discovers this turn of events he invites Max to McCarthy Manor on false pretenses. There Ryan engages Max in combat and beats him brutally. Fearing for his friends' safety, Jake reverses his decision and enters The Beatdown after all - only to face Ryan. Roqua hears of this as well, and confronts Jake with an ultimatum: Jake will never be allowed near the gym again if he even goes to The Beatdown, much less fights in it. Jake - realizing that Roqua is trying to prevent him from making the same mistake which Roqua himself made with his own father - answers that Roqua's only mistake was not doing what Jake himself is about to do. Said mistake wasn't brawling; it was evading the conflict at hand, rather than confronting and resolving it.At The Beatdown, both Jake and Ryan reach the semi-finals. Then Ryan is disqualified for eye-gouging. In view of this, Jake taps out one second into his semi-final bout (because his purpose for entering The Beatdown to begin with is no longer present). Outside the club, Ryan attacks Jake and they have a spectacular brawl in the club parking lot. Ultimately Jake wins the fight. (In the 2 Disc and Blu Ray versions, there is a deleted scene where Ryan tries to challenge Jake to a rematch.) Jake replies to this by bringing to light the fact the fans are chanting for the rematch unsatified with the fight they just saw, and subsequently they want to watch just simply two guys \"kill\" each other and do not care about the sport itself. This would cause Ryan to realize he had basically been a puppet to gladitorial combat for the amusment of others and not the one on top and in control he thought he was. Angered and embarrassed he yells at the crowd and runs off.Jake has won the respect of all his fellow students, up to and including Ryan. For the first time in a long while, Roqua closes the gym and goes to visit his family in Brazil."
}