{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/lcyippCCbZOliGxX7HbTNyWf98q.jpg",
  "id": 87827,
  "title": "Life of Pi",
  "poster_path": "https://image.tmdb.org/t/p/w500/iLgRu4hhSr6V1uManX6ukDriiSc.jpg",
  "release_date": "2012-11-20",
  "vote_average": 7.4,
  "vote_count": 12595,
  "popularity": 47.857,
  "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
  "imdb_id": "tt0454876",
  "budget": 120000000,
  "homepage": "https://www.20thcenturystudios.com/movies/life-of-pi",
  "revenue": 609000000,
  "runtime": 127,
  "tagline": "Believe The Unbelievable",
  "genres": [
    "Adventure",
    "Drama"
  ],
  "production_companies": [
    "Fox 2000 Pictures",
    "Dune Entertainment",
    "Ingenious Media",
    "Haishang Films",
    "Netter Productions",
    "India Take One",
    "Ingenious Film Partners",
    "Big Screen Productions"
  ],
  "production_countries": [
    "CA",
    "IN",
    "TW",
    "GB",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Suraj Sharma",
        "character": "Pi Patel"
      },
      {
        "name": "Irrfan Khan",
        "character": "Adult Pi Patel"
      },
      {
        "name": "Ayush Tandon",
        "character": "Pi Patel (11-12 Years)"
      },
      {
        "name": "Gautam Belur",
        "character": "Pi Patel (5 Years)"
      },
      {
        "name": "Adil Hussain",
        "character": "Santosh Patel"
      },
      {
        "name": "Tabu",
        "character": "Gita Patel"
      },
      {
        "name": "Ayaan Khan",
        "character": "Ravi Patel (7 Years)"
      },
      {
        "name": "Mohd Abbas Khaleeli",
        "character": "Ravi Patel (13-14 Years)"
      },
      {
        "name": "Vibish Sivakumar",
        "character": "Ravi Patel (18-19 Years)"
      },
      {
        "name": "Rafe Spall",
        "character": "Writer"
      },
      {
        "name": "Gérard Depardieu",
        "character": "Cook"
      },
      {
        "name": "James Saito",
        "character": "Older Insurance Investigator"
      },
      {
        "name": "Jun Naito",
        "character": "Younger Insurance Investigator"
      },
      {
        "name": "Andrea Di Stefano",
        "character": "Priest"
      },
      {
        "name": "Shravanthi Sainath",
        "character": "Anandi"
      },
      {
        "name": "Elie Alouf",
        "character": "Mamaji"
      },
      {
        "name": "T.M. Karthik",
        "character": "Science Teacher"
      },
      {
        "name": "Amarendran Ramanan",
        "character": "Indian History Teacher"
      },
      {
        "name": "Hari Mina Bala",
        "character": "Librarian"
      },
      {
        "name": "Wang Bo-chieh",
        "character": "Buddhist Sailor"
      },
      {
        "name": "Ko I-Chen",
        "character": "Tsimtsum Captain"
      },
      {
        "name": "Jag Huang Chien-Wei",
        "character": "Sailor"
      },
      {
        "name": "Ravi Natesan",
        "character": "Selvam"
      },
      {
        "name": "Adyant Balaji",
        "character": "Bully"
      },
      {
        "name": "Chirag Agarwal",
        "character": "Bully"
      },
      {
        "name": "Ahan André Kamath",
        "character": "Bully"
      },
      {
        "name": "Om Kamath",
        "character": "Bully"
      },
      {
        "name": "Srilekh Katta",
        "character": "Bully"
      },
      {
        "name": "Swati Van Rijswijk",
        "character": "Anandi's Friend #1"
      },
      {
        "name": "M. Keerthana",
        "character": "Anandi's Friend #2"
      },
      {
        "name": "Indumohan Poornima",
        "character": "Dancer"
      },
      {
        "name": "Josephine Nithya B.",
        "character": "Dancer"
      },
      {
        "name": "Samyuktha S.",
        "character": "Dancer"
      },
      {
        "name": "A. Deiva Sundari",
        "character": "Dancer"
      },
      {
        "name": "G. Vasantakumary",
        "character": "Dancer"
      },
      {
        "name": "A. Vithya",
        "character": "Dancer"
      },
      {
        "name": "Mythili Prakash",
        "character": "Pi's Wife"
      },
      {
        "name": "Raj Patel",
        "character": "Pi's Son"
      },
      {
        "name": "Hadiqa Hamid",
        "character": "Pi's Daughter"
      },
      {
        "name": "Iswar Srikumar",
        "character": "Muslim Worshipper"
      },
      {
        "name": "Padmini Ramachandran",
        "character": "Dance Master"
      }
    ],
    "crew": [
      {
        "name": "Avy Kaufman",
        "department": "Production",
        "job": "Casting"
      },
      {
        "name": "Anna Pinnock",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Ang Lee",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Ang Lee",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Tim Squyres",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Eugene Gearty",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "David Gropman",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Mychael Danna",
        "department": "Sound",
        "job": "Music"
      },
      {
        "name": "Arjun Bhasin",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Charles Croughwell",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "David Magee",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Ron Bartlett",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Dean Georgaris",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Gil Netter",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "David Womark",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Claudio Miranda",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Claudio Miranda",
        "department": "Camera",
        "job": "Camera Operator"
      },
      {
        "name": "Kevin Kaska",
        "department": "Sound",
        "job": "Orchestrator"
      },
      {
        "name": "Adil Hussain",
        "department": "Crew",
        "job": "Production Office Assistant"
      },
      {
        "name": "Yann Martel",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Al Hobbs",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Marcelo Pont Vergés",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Philip Stockton",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Drew Kunin",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Anthony Di Ninno",
        "department": "Crew",
        "job": "Digital Effects Supervisor"
      },
      {
        "name": "Doug Hemphill",
        "department": "Sound",
        "job": "Sound Re-Recording Mixer"
      },
      {
        "name": "Erik De Boer",
        "department": "Visual Effects",
        "job": "Animation Supervisor"
      },
      {
        "name": "Guillaume Rocheron",
        "department": "Visual Effects",
        "job": "Visual Effects Supervisor"
      },
      {
        "name": "Bill Westenhofer",
        "department": "Visual Effects",
        "job": "Visual Effects Supervisor"
      },
      {
        "name": "Sachin Bangera",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Alexander Fernandes",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Aravind Jayaraman",
        "department": "Visual Effects",
        "job": "Visual Effects"
      },
      {
        "name": "Dixie Pizani",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Rohit Kolhe",
        "department": "Visual Effects",
        "job": "Animation"
      },
      {
        "name": "Julie D'Antoni",
        "department": "Visual Effects",
        "job": "Visual Effects"
      },
      {
        "name": "Sagar Patil",
        "department": "Crew",
        "job": "Compositors"
      },
      {
        "name": "Terry Lewis",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Donald Elliott",
        "department": "Crew",
        "job": "Special Effects Coordinator"
      },
      {
        "name": "Ian Blum",
        "department": "Visual Effects",
        "job": "Animation Supervisor"
      },
      {
        "name": "Farhad Ahmed Dehlvi",
        "department": "Camera",
        "job": "Assistant Camera"
      },
      {
        "name": "Anup Kulkarni",
        "department": "Crew",
        "job": "Visual Effects Design Consultant"
      },
      {
        "name": "Christian Wood",
        "department": "Visual Effects",
        "job": "Compositing Lead"
      },
      {
        "name": "Frank Chen",
        "department": "Crew",
        "job": "Thanks"
      }
    ]
  },
  "keywords": [
    "sea",
    "faith",
    "loss of loved one",
    "1970s",
    "zebra",
    "survival",
    "young boy",
    "zookeeper",
    "orangutan",
    "teenage boy",
    "hyena",
    "meerkat",
    "magic realism",
    "cargo ship",
    "lifeboat",
    "injured animal",
    "storm at sea",
    "told in flashback",
    "wreckage",
    "loss of family",
    "teenage protagonist",
    "family loss",
    "flying fish"
  ],
  "mpaa": "PG",
  "summaries": [
    "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.",
    "In Canada, a writer visits the Indian storyteller Pi Patel and asks him to tell his life story. Pi tells the story of his childhood in Pondicherry, India, and the origin of his nickname. One day, his father, a zoo owner, explains that the municipality is no longer supporting the zoo and he has hence decided to move to Canada, where the animals the family owns would also be sold. They board on a Japanese cargo ship with the animals and out of the blue, there is a storm, followed by a shipwrecking. Pi survives in a lifeboat with a zebra, an orangutan, a hyena and a male Bengal tiger nicknamed Richard Parker. They are adrift in the Pacific Ocean, with aggressive hyena and Richard Parker getting hungry. Pi needs to find a way to survive.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "An aspiring Canadian author interviews the Indian storyteller Pi Patel to hear the firsthand account of his adventures. Pi recounts his upbringing in French-occupied India, where his father owned a zoo. When Pi's family business fails, they embark on a sea voyage to Canada to begin a new life. One night aboard their Japanese cargo ship in the middle of the ocean, a violent and deadly storm hits and sinks nearly all that Pi holds dear. He survives in a lifeboat with several of their zoo animals, including a fearsome Bengal tiger. In a struggle to survive, Pi and the tiger forge an unexpected connection that gives him daily motivation to live. Life of Pi is a tale of faith, hope, and the fight to survive.—ahmetkozan",
    "A writer, looking for a story idea, is visiting with South Asian-Canadian Pi Patel. They were brought together by Pi's deceased father's longtime friend Francis, who Pi calls Mamaji, who knew Pi's family when they lived in Pondicherry, India, where the writer met Mamaji. Mamaji felt Pi telling the writer his story would be karmic as the writer was a Canadian in French India, and Pi an Indian man in French Canada. Pi proceeds to tell him his life story, which starts in Pondicherry as the son of zookeepers, the zoo property where he grew up: how he was given his full name of Piscine Molitor Patel largely on Mamaji's suggestion which included Mamaji teaching him how to swim, why at age eleven he made a concerted and extraordinary effort to shorten his name to Pi, his concurrent belief in several religions as he was growing up which affected his relationships not only with humans but what he wanted it to be with the animals at the zoo, and his mid-teen burgeoning relationship with a dancer named Anandi just before his family decided to make the move to Canada. But the largest and most fascinating part of his story concerns how he ended up on a lifeboat in the middle of the Pacific with the zoo's Bengal tiger named Richard Parker, and the progression of their time and understanding of each other during that close connection, Richard Parker to who he attributes his survival despite they being initial adversaries as a human and a wild carnivorous beast.—Huggo",
    "Having half-heartedly decided to give up the family zoo in India, Santosh and Gita Patel board a Japanese freighter bound for Canada. And in search of a better future in another country with their 16-year-old son Pi, his older brother Ravi, and a few valuable animals, the uprooted family dreams of a fresh start. Instead, a violent tempest hammers the vessel and tragedy strikes. Suddenly, furious waves sweep away Pi in the vast ocean. With his life hanging by a thread aboard an open lifeboat, Pi must share the vessel with an unpredictable spotted hyena, an injured zebra, a female orangutan, and a ferocious Bengal tiger. As the days turn into weeks and the weeks drag into months, Pi must try every trick in the book to keep his justified fears at bay and learn how to coexist with the menacing animals. But few encountered the claws of a cornered tiger and lived to tell the tale. Do man and beast stand a chance of survival?—Nick Riganas"
  ],
  "synopsis": "Pi Patel (Irrfan Khan), an immigrant from Pondicherry in India living in Montreal, Canada, is approached by a local novelist (Rafe Spall) who has been referred to him by his \"uncle\" (a family friend), believing that Pi's life story would make a great book. Pi relates an extended tale:His parents had named him Piscine Molitor after a swimming pool in France. He changes his name to \"Pi\" (the mathematical symbol,) when he begins secondary school (Gautam Belur), even repeating numerous digits of pi, because he is tired of being taunted with the nickname \"Pissing Patel\". His family owns a local zoo, and Pi takes an interest in the animals, especially a Bengal tiger named Richard Parker because of a clerical error. Pi tries to feed the tiger, endangering himself to being attacked, and to teach him the reality of the tiger's nature as a carnivore, Pi's father, Santosh Patel (Adil Hussain) forces him to witness it killing a goat. He is raised Hindu and vegetarian, but at 12 years old, he is introduced to Christianity and then Islam, and starts to follow all three religions as he \"just wants to love God.\" When asked if he is also Jewish, he replies that he lectures in Kabbalah at the university.When Pi is 16 (Ayush Tandon), his father decides to close the zoo and move his family to Canada, and sell the zoo animals, to ensure a good future for his children. They book passage with their animals (to be sold in North America) on a Japanese freighter named the Tsimtsum. On board the ship, Pi's father gets into an argument with the ship's cook (Gerard Depardieu) when he speaks to Pi's mother, Gita Patel (Tabu) rudely. One night, the ship encounters a heavy storm and begins to sink while Pi is on deck marveling at the storm. He tries to find his family, but a crew member throws him into a lifeboat; from the rough sea, he watches helplessly as the ship sinks, killing his family and its crew.After the storm, Pi finds himself in the lifeboat with an injured zebra, and is joined by an orangutan, named Orange Juice, who lost her offspring in the shipwreck. A spotted hyena emerges from the tarp covering half of the boat, and kills the zebra. To Pi's distress, the hyena also mortally wounds the orangutan in a fight. Suddenly Richard Parker emerges from under the tarp, and kills and eats the hyena.Pi finds emergency food and water rations on the boat. He builds a small raft of flotation devices so that he can stay at a safe distance from the tiger. Realizing that he must feed the tiger to protect himself, Pi begins fishing, with some success. He also collects rain water for both to drink. At one point, he makes a board ladder for the tiger to climb back into the boat after it had jumped off to hunt fish. In a nighttime encounter with a breaching whale, Pi loses much of his supplies. Faced with starvation, he eats raw fish. After many days at sea, Pi realizes that he can no longer live on the tiny raft and trains the tiger Richard Parker to accept him in the boat. He also realizes that caring for the tiger is keeping him alive.After weeks longer at sea, near the end of their strength, they reach a floating island of edible plants, supporting a forest, fresh water pools, and a large population of meerkats. Both Pi and Richard Parker eat and drink freely and regain strength. But at night the island transforms into a hostile environment, with the fresh water turning acidic, digesting all the dead fish that died in the pools. The tiger returns to the lifeboat at night. Pi finds a human tooth inside a plant flower and concludes that the plants are carnivorous, requiring them to leave the island.The lifeboat eventually reaches the coast of Mexico. Finally back on land, Richard Parker stumbles away from Pi and stops at the edge of the jungle. Pi expects that the tiger will turn toward him and acknowledge him, but instead he looks into the jungle for a while and goes in. Pi, too weak to follow, lies in the sand. He is rescued by a group who carry him to hospital, but he weeps that the tiger had walked away without him.In hospital, insurance agents for the Japanese freighter come to hear his account of the incident. They find his story unbelievable, and ask him to tell them what \"really\" happened, if only for the credibility of their report. He answers with a less fantastic but detailed account of sharing the lifeboat with his mother, a sailor with a broken leg, and the cook. In this story, the cook kills the sailor to use him as bait and food. In a later struggle, Pi's mother pushes him to safety on a smaller raft, and the cook stabs her as she falls overboard to the sharks. Later, Pi returns to grab the knife and kills the cook.In the present, the writer notes parallels between the two stories: the orangutan was Pi's mother, the zebra was the sailor, the hyena was the cook, and Richard Parker, the tiger, was Pi himself. Pi asks him which story the writer prefers; he chooses the one with the tiger because it \"is the better story\", to which Pi responds, \"And so it is with God\". Glancing at a copy of the insurance report, the writer notices a closing comment about the remarkable feat of surviving 227 days at sea, especially with a tiger - meaning that the agents chose that story as well."
}