{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/c8Pi8F1FzpNebtgXcSjC9nWCdSW.jpg",
  "id": 914,
  "title": "The Great Dictator",
  "poster_path": "https://image.tmdb.org/t/p/w500/1QpO9wo7JWecZ4NiBuu625FiY1j.jpg",
  "release_date": "1940-10-15",
  "vote_average": 8.333,
  "vote_count": 3142,
  "popularity": 24.165,
  "overview": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
  "imdb_id": "tt0032553",
  "budget": 2000000,
  "homepage": "",
  "revenue": 11000000,
  "runtime": 125,
  "tagline": "Once again - the whole world laughs!",
  "genres": [
    "Comedy",
    "War"
  ],
  "production_companies": [
    "Roy Export Company Establishment",
    "United Artists",
    "Charles Chaplin Productions"
  ],
  "production_countries": [
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Charlie Chaplin",
        "character": "Adenoid Hynkel, Dictator of Tomania / A Jewish Barber"
      },
      {
        "name": "Paulette Goddard",
        "character": "Hannah"
      },
      {
        "name": "Jack Oakie",
        "character": "Benzino Napaloni, Dictator of Bacteria"
      },
      {
        "name": "Reginald Gardiner",
        "character": "Commander Schultz"
      },
      {
        "name": "Henry Daniell",
        "character": "Garbitsch"
      },
      {
        "name": "Billy Gilbert",
        "character": "Field Marshal Herring"
      },
      {
        "name": "Grace Hayle",
        "character": "Madame Napaloni"
      },
      {
        "name": "Carter DeHaven",
        "character": "Spook"
      },
      {
        "name": "Maurice Moscovitch",
        "character": "Mr. Jaeckel"
      },
      {
        "name": "Emma Dunn",
        "character": "Mrs. Jaeckel"
      },
      {
        "name": "Bernard Gorcey",
        "character": "Mr. Mann"
      },
      {
        "name": "Paul Weigel",
        "character": "Mr. Agar"
      },
      {
        "name": "Chester Conklin",
        "character": "Barber's Customer"
      },
      {
        "name": "Esther Michelson",
        "character": "Jewish Woman"
      },
      {
        "name": "Hank Mann",
        "character": "Storm Trooper Stealing Fruit"
      },
      {
        "name": "Florence Wright",
        "character": "Blonde Secretary"
      },
      {
        "name": "Eddie Gribbon",
        "character": "Tomanian Storm Trooper"
      },
      {
        "name": "Rudolph Anders",
        "character": "Tomanian Commandant at Osterlich / Robert O. Davis"
      },
      {
        "name": "Eddie Dunn",
        "character": "Whitewashed Storm Trooper"
      },
      {
        "name": "Nita Pike",
        "character": "Secretary"
      },
      {
        "name": "George Lynn",
        "character": "Commander of Storm Troopers"
      },
      {
        "name": "Wheeler Dryden",
        "character": "Heinrich Schtick / Translator (voice)"
      },
      {
        "name": "Fred Aldrich",
        "character": "Soldier (uncredited)"
      },
      {
        "name": "Richard Alexander",
        "character": "Tomainian Prison Guard in 1918 (uncredited)"
      },
      {
        "name": "Sig Arno",
        "character": "Compact Parachute Inventor (uncredited)"
      },
      {
        "name": "William Arnold",
        "character": "Tomanian Officer (uncredited)"
      },
      {
        "name": "Joe Bordeaux",
        "character": "Ghetto Extra (uncredited)"
      },
      {
        "name": "Don Brodie",
        "character": "Reporter from International Press (uncredited)"
      },
      {
        "name": "Gino Corrado",
        "character": "Sculptor (uncredited)"
      },
      {
        "name": "John Davidson",
        "character": "Hospital Superintendent (uncredited)"
      },
      {
        "name": "Max Davidson",
        "character": "Jewish Man (uncredited)"
      },
      {
        "name": "Lew Davis",
        "character": "Hospital Orderly (uncredited)"
      },
      {
        "name": "Pat Flaherty",
        "character": "Friendly Storm Trooper (uncredited)"
      },
      {
        "name": "Bud Geary",
        "character": "Storm Trooper (uncredited)"
      },
      {
        "name": "Sam Harris",
        "character": "Officer (uncredited)"
      },
      {
        "name": "Eddie Hart",
        "character": "Policeman (uncredited)"
      },
      {
        "name": "Leyland Hodgson",
        "character": "Big Bertha Gunnery Officer (uncredited)"
      },
      {
        "name": "William Irving",
        "character": "Man Seated on Bed (uncredited)"
      },
      {
        "name": "Charles Irwin",
        "character": "Banquet Butler (uncredited)"
      },
      {
        "name": "Ethelreda Leopold",
        "character": "Blonde Secretary (uncredited)"
      },
      {
        "name": "Torben Meyer",
        "character": "Bald Barbershop Customer (uncredited)"
      },
      {
        "name": "Bert Moorhouse",
        "character": "Hynkel's Staff Officer (uncredited)"
      },
      {
        "name": "Nellie V. Nichols",
        "character": "Jewish Woman (uncredited)"
      },
      {
        "name": "Manuel París",
        "character": "Dance Extra at Ball (uncredited)"
      },
      {
        "name": "Jack Perrin",
        "character": "Jewish Man (uncredited)"
      },
      {
        "name": "Lucien Prival",
        "character": "Storm Trooper Officer (uncredited)"
      },
      {
        "name": "Cyril Ring",
        "character": "Officer Extra (uncredited)"
      },
      {
        "name": "Henry Roquemore",
        "character": "Soldier (uncredited)"
      },
      {
        "name": "Tiny Sandford",
        "character": "Soldier in 1918 Tomainia (uncredited)"
      },
      {
        "name": "Hans Schumm",
        "character": "Soldier (uncredited)"
      },
      {
        "name": "Harry Semels",
        "character": "Jewish Fruit Stand Proprietor (uncredited)"
      },
      {
        "name": "Charles Sullivan",
        "character": "Prison Guard (uncredited)"
      },
      {
        "name": "Carl Voss",
        "character": "Officer (uncredited)"
      },
      {
        "name": "Leo White",
        "character": "Hynkel's Barber (uncredited)"
      },
      {
        "name": "Harry Wilson",
        "character": "Soldier in Field (uncredited)"
      },
      {
        "name": "Hans Conried",
        "character": "Undetermined Role (uncredited)"
      },
      {
        "name": "Francis Ernest Drake",
        "character": "Storm Trooper (uncredited)"
      },
      {
        "name": "Francesca Santoro",
        "character": "Aggie (uncredited)"
      },
      {
        "name": "Leonard Walker",
        "character": "Conductor (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Jack Cosgrove",
        "department": "Visual Effects",
        "job": "Visual Effects"
      },
      {
        "name": "Edward G. Boyle",
        "department": "Art",
        "job": "Set Decoration"
      },
      {
        "name": "Karl Struss",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Charlie Chaplin",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Charlie Chaplin",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Charlie Chaplin",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Charlie Chaplin",
        "department": "Writing",
        "job": "Writer"
      },
      {
        "name": "Carter DeHaven",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "Roland Totheroh",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Willard Nico",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "J. Russell Spencer",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Ed Voight",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Glenn Rominger",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Percy Townsend",
        "department": "Sound",
        "job": "Sound Designer"
      },
      {
        "name": "Carmen Dragon",
        "department": "Sound",
        "job": "Orchestrator"
      },
      {
        "name": "Max Terr",
        "department": "Sound",
        "job": "Orchestrator"
      },
      {
        "name": "Meredith Willson",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Wheeler Dryden",
        "department": "Crew",
        "job": "Second Unit"
      },
      {
        "name": "Wheeler Dryden",
        "department": "Directing",
        "job": "Assistant Director"
      },
      {
        "name": "Buster Wiles",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ted Tetrick",
        "department": "Costume & Make-Up",
        "job": "Costume Supervisor"
      },
      {
        "name": "Ralph Hammeras",
        "department": "Crew",
        "job": "Special Effects"
      }
    ]
  },
  "keywords": [
    "amnesia",
    "nazi",
    "hairdresser",
    "propaganda",
    "world war i",
    "dictator",
    "jewish ghetto",
    "fascism",
    "world war ii",
    "national socialism",
    "national socialist party",
    "satire",
    "speech",
    "black and white",
    "barbershop",
    "anti war",
    "fictitious country"
  ],
  "mpaa": "NR",
  "summaries": [
    "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
    "20 years after the end of WWI, in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state and the decimation of the Jews. This situation is unknown to a simple Jewish Tomainian barber who has been hospitalized since a WWI battle. Upon his release the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, whom he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a desire for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator of neighboring Bacteria. Ultimately Schultz, who has turned traitor against Hynkel's regime, and the barber may be able to join forces to take control of the situation, using Schultz's inside knowledge of the regime's workings and the barber's uncanny resemblance to one of those in power.—Huggo",
    "After dedicated service in the Great War, a Jewish barber (Chaplin) spends years in an army hospital recovering from his wounds, unaware of the simultaneous rise of fascist dictator Adenoid Hynkel (also Chaplin) and his anti-Semitic policies. When the barber, who bears a remarkable resemblance to Hynkel, returns to his quiet neighbourhood, he is stunned by the brutal changes and recklessly joins a beautiful girl (Goddard) and her neighbours in rebelling.",
    "During the last days of the First World War, a clumsy soldier saves the life of devoted military pilot Schultz. Unfortunately, their flight from the advancing enemy ends in a severe crash with the clumsy soldier losing his memory. After many years in the hospital, the amnesia patient gets released and reopens his old barber shop in the Jewish ghetto. But times have changed in the country of Tomania: Dictator Adenoid Hynkel, who accidentally looks very similar to the barber, has imposed his merciless grip on the country, and Jewish people are discriminated against. One day the barber gets in trouble and is brought before a commanding officer, who turns out to be his old comrade Schultz. The ghetto enjoys protection from then on. Meanwhile, Dictator Hynkel develops big plans: he wants to become Dictator of the whole world and needs a scapegoat for the public. Soon Schultz is being arrested for being too Jewish-friendly, and all Jews except those who managed to flee are transported into Concentration Camps. Hynkel is planning to march into Osterlich to show off against Napaloni, Dictator of Bacteria, who has already deployed his troops along the small country's other border. Meanwhile, Schultz and the barber manage to escape, disguised in military uniforms. Luckily, Schultz and the barber are picked up by Tomanian forces and the barber is mixed up with Hynkel himself. The small barber now gets the once-in-a-lifetime chance to speak to the people of Osterlich and all of Tomania, who listen eagerly on the radio.—Julian Reischl <julianreischl@mac.com>"
  ],
  "synopsis": "During a battle in the last months of World War I, the protagonist, an unnamed Hebrew private and a barber by profession (Charlie Chaplin), is fighting for the Central Powers in the army of the fictional nation of Tomainia, comically blundering through the trenches in combat scenes. Upon hearing a fatigued pilot pleading for help, the private attempts to rescue the exhausted officer, Commander Schultz (Reginald Gardiner). The two board Schultz's nearby airplane and fly off, escaping enemy fire in the nick of time. Schultz reveals that he is carrying important dispatches that could win the war. However, the plane loses fuel and crashes in a marsh. They both survive, but the private suffers from memory loss. As medics arrive, Commander Schultz gives them the dispatches, but is told that the war has just ended and Tomainia lost.Twenty years later, as the amnesiac private is released from the hospital, Adenoid Hynkel (also played by Chaplin), the ruthless dictator of Tomainia, has undertaken to persecute Hebrews throughout the land, aided by Minister of the Interior Garbitsch (Henry Daniell) and Minister of War Herring (Billy Gilbert). The symbol of Hynkel's fascist regime is the \"double cross\", and Hynkel himself speaks in a Macaronic parody of the German language, \"translated\" at humorously obvious parts in the speech by an overly concise English-speaking news voice-over.The Hebrew private/barber, unaware of Hynkel's rise to power, returns to his barbershop in the Hebrew ghetto and is shocked when storm troopers paint specific signs on the windows of his shop. In his ensuing slapstick scuffle with the storm-troopers, Hannah (Paulette Goddard), a beautiful resident of the ghetto, knocks both Stormtroopers on the head with a frying pan. The barber finds a friend and ultimately a love interest in Hannah. Soon, the barber is attacked again by Stormtroopers, but is saved when Commander Schultz, now a high official in Hynkel's government, intervenes. Schultz recognizes the barber, who is reminded of the war by Schultz and therefore regains his memory. Though surprised to find him a Hebrew, Schultz orders the storm troopers to leave him and Hannah alone.Hynkel relaxes his stance on Tomainian ancestry in an attempt to woo a Hebrew financier into giving him a loan to support his regime. Egged on by Garbitsch, Hynkel has become obsessed with the idea being Emperor of the world, dancing at one point with a large, inflatable globe, to the tune of the Prelude to Act I of Richard Wagner's Lohengrin.Against Garbitsch's advice to reinforce the violence against Hebrews, Hynkel plans to invade the neighboring country of Osterlich, and needs the loan to finance the invasion. When the Hebrew financier refuses, Hynkel reinstates and intensifies his persecution of the Hebrews. When Schultz, who is empathetic to the Hebrews, voices his objection to the pogrom, Hynkel denounces Schultz as a supporter of democracy and a traitor, and orders him placed in a concentration camp. Schultz flees to the ghetto and begins planning to overthrow the Hynkel regime with Hannah, the barber and other residents there. After discussing and then abandoning a proposed suicide mission, Schultz and the barber are captured and condemned to the camp.Hynkel is initially opposed by Benzino Napaloni (Jack Oakie), dictator of Bacteria, in his plans to invade Osterlich. Hynkel invites Napaloni to a military show to impress him with a display of military might and psychological warfare, but this ends in disaster. After some friction, a comedic food fight between the two leaders and a deal between the two leaders on which Hynkel immediately reneges, his invasion proceeds. Hannah had emigrated to Osterlich to escape Hynkel, but once again finds herself living under Hynkel's regime.Schultz and the barber escape from the camp wearing Tomainian uniforms. Border guards mistake the barber for Hynkel, to whom he is nearly identical in appearance. Conversely, Hynkel, on a duck-hunting trip, falls overboard and is mistaken for the barber and is arrested by his own soldiers.The barber, now assuming Hynkel's identity, is taken to the capital of Osterlich to make a victory speech. Garbitsch, in introducing \"Hynkel\" to the throngs, decries free speech and argues for the subjugation of the Hebrews. The barber then makes a rousing speech, reversing Hynkel's anti-Semitic policies and declaring that Tomainia and Osterlich will now be a free nation and a democracy. He calls for humanity in general to break free from dictatorships and use science and progress to make the world better instead.Hannah, now an impoverished laborer in a vineyard in Osterlich, hears the barber's speech on the radio, and is amazed when \"Hynkel\" addresses her directly: \"Hannah, can you hear me? Wherever you are, look up, Hannah. The clouds are lifting. The sun is breaking through. We are coming out of the darkness into the light. We are coming into a new world, a kindlier world, where men will rise above their hate, their greed and brutality. Look up, Hannah. The soul of man has been given wings, and at last he is beginning to fly. He is flying into the rainbow - into the light of hope, into the future, the glorious future that belongs to you, to me, and to all of us.Look up, Hannah. Look up!\" As she rises, an aged man (perhaps her employer) asks, \"Hannah, did you hear that?\" The girl silences him with a gesture, saying, \"Listen,\" and turns her face, radiant with joy and hope, toward the sunlight."
}