{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/v2LilmCylr3bL9TCZSj6syjowZh.jpg",
  "id": 937278,
  "title": "A Man Called Otto",
  "poster_path": "https://image.tmdb.org/t/p/w500/130H1gap9lFfiTF9iDrqNIkFvC9.jpg",
  "release_date": "2022-12-28",
  "vote_average": 7.8,
  "vote_count": 2166,
  "popularity": 73.604,
  "overview": "When a lively young family moves in next door, grumpy widower Otto Anderson meets his match in a quick-witted, pregnant woman named Marisol, leading to an unlikely friendship that turns his world upside down.",
  "imdb_id": "tt7405458",
  "budget": 50000000,
  "homepage": "https://www.amancalledotto.movie",
  "revenue": 108961677,
  "runtime": 126,
  "tagline": "Fall in love with the grumpiest man in America.",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "production_companies": [
    "Playtone",
    "SF Studios",
    "Artistic Films",
    "Columbia Pictures",
    "2DUX²"
  ],
  "production_countries": [
    "SE",
    "US"
  ],
  "credits": {
    "cast": [
      {
        "name": "Tom Hanks",
        "character": "Otto Anderson"
      },
      {
        "name": "Mariana Treviño",
        "character": "Marisol"
      },
      {
        "name": "Rachel Keller",
        "character": "Sonya"
      },
      {
        "name": "John Higgins",
        "character": "Hardware Store Clerk"
      },
      {
        "name": "Tony Bingham",
        "character": "Hardware Store Customer"
      },
      {
        "name": "Lily Kozub",
        "character": "Hardware Store Taylor"
      },
      {
        "name": "Mack Bayda",
        "character": "Malcolm"
      },
      {
        "name": "Cameron Britton",
        "character": "Jimmy"
      },
      {
        "name": "Juanita Jennings",
        "character": "Anita"
      },
      {
        "name": "Peter Lawson Jones",
        "character": "Reuben"
      },
      {
        "name": "Max Pavel",
        "character": "Andy"
      },
      {
        "name": "Kailey Hyman",
        "character": "Barb"
      },
      {
        "name": "Peter Sipla",
        "character": "Stimco Steel Boss"
      },
      {
        "name": "Patrick Stanny",
        "character": "Stimco Steel Terry"
      },
      {
        "name": "Dominick Marrone",
        "character": "Stimco Steel Co-Worker #1"
      },
      {
        "name": "Allyson R. Hood",
        "character": "Stimco Steel Co-Worker #2"
      },
      {
        "name": "Kristy Nolen",
        "character": "Stimco Steel Worker #3"
      },
      {
        "name": "Carl Clemons",
        "character": "Stimco Steel Worker #4"
      },
      {
        "name": "Connor McCanlus",
        "character": "Stimco Steel Worker #5"
      },
      {
        "name": "Cindy Jackson",
        "character": "Delivery Person"
      },
      {
        "name": "Manuel Garcia-Rulfo",
        "character": "Tommy"
      },
      {
        "name": "Christiana Montoya",
        "character": "Luna"
      },
      {
        "name": "Alessandra Perez",
        "character": "Abbie"
      },
      {
        "name": "Bodhi Wilson",
        "character": "Child Otto"
      },
      {
        "name": "Ira Amyx",
        "character": "Otto's Father"
      },
      {
        "name": "Greg Allan Martin",
        "character": "Lucas"
      },
      {
        "name": "Truman Hanks",
        "character": "Young Otto"
      },
      {
        "name": "Jon Osbeck",
        "character": "Army Doctor"
      },
      {
        "name": "Elle Chapman",
        "character": "Sarah, Train Ticketer"
      },
      {
        "name": "Bryant Carroll",
        "character": "Train Conductor '73"
      },
      {
        "name": "Mike Birbiglia",
        "character": "Dye & Merica Real Estate Agent"
      },
      {
        "name": "Julian Manjerico",
        "character": "Beppo The Clown"
      },
      {
        "name": "Jon Donahue",
        "character": "Officer Dudley"
      },
      {
        "name": "Aaron Marcus",
        "character": "Train Station Businessman"
      },
      {
        "name": "Jeff Hochendoner",
        "character": "Burly Train Commuter"
      },
      {
        "name": "Vance Tinsley",
        "character": "Train Commuter #1"
      },
      {
        "name": "Clay Davis",
        "character": "Train Commuter #2"
      },
      {
        "name": "Jared Frenke",
        "character": "Train Commuter #3"
      },
      {
        "name": "James Peyton",
        "character": "Train Commuter #4"
      },
      {
        "name": "Josephine Valentina Clark",
        "character": "Influencer Abbey"
      },
      {
        "name": "Josefine Lindegaard",
        "character": "Influencer Julia"
      },
      {
        "name": "Kathleen Regan",
        "character": "Train Station Commuter #5"
      },
      {
        "name": "Micah Southwood",
        "character": "Train Station Mother"
      },
      {
        "name": "Hunter Southwood",
        "character": "Train Station Child"
      },
      {
        "name": "Spenser Granese",
        "character": "Nick (Driving Lesson Muscle Head)"
      },
      {
        "name": "Emonie Ellison",
        "character": "Young Anita"
      },
      {
        "name": "Lavel Schley",
        "character": "Young Reuben"
      },
      {
        "name": "Kelly Lamor Wilson",
        "character": "Shari Kenzie"
      },
      {
        "name": "David Magee",
        "character": "Dye & Merica Rep '83"
      },
      {
        "name": "William Paul Clark",
        "character": "Dye & Merica Agent #2 '83"
      },
      {
        "name": "Rachel Layne",
        "character": "Dye & Merica Secret Agent"
      },
      {
        "name": "Mark Philip Stevenson",
        "character": "Funeral Minister"
      },
      {
        "name": "Joe Fishel",
        "character": "Doctor (uncredited)"
      },
      {
        "name": "Gina Aponte",
        "character": "Train Rider (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "Thomas Newman",
        "department": "Sound",
        "job": "Music"
      },
      {
        "name": "Tom Hanks",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Celia D. Costas",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Barbara Ling",
        "department": "Art",
        "job": "Production Design"
      },
      {
        "name": "Rita Wilson",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Marc Forster",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "Marc Forster",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "David Magee",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "David Magee",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Matt Chesse",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Gary Goetzman",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Louise Rosner-Meyer",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Steven Shareshian",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Fredrik Wikström",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Hannes Holm",
        "department": "Writing",
        "job": "Original Film Writer"
      },
      {
        "name": "Alan Tuskes",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Eric s Wilson",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Matthias Koenigswieser",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Frank L. Fleming",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Douglas Noe",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Jed Loughran",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "Simon Chase",
        "department": "Sound",
        "job": "Supervising Sound Editor"
      },
      {
        "name": "Darylin Nagy",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Brian Smyj",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Renee Wolfe",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Erica Stewart",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Fredrik Backman",
        "department": "Writing",
        "job": "Novel"
      },
      {
        "name": "Jessica Jade Jacob",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Rachel Kick",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Christopher Strollo",
        "department": "Sound",
        "job": "Sound Mixer"
      },
      {
        "name": "Eve Negley",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Tomas Blazukas",
        "department": "Sound",
        "job": "Sound Effects Editor"
      },
      {
        "name": "Maxi Spisak",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Christopher Patrick",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Sudie Smyth",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Bridget Gilfeather-Novick",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Tor Jonasson",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Tim King",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Michael Porseryd",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Neda Backman",
        "department": "Production",
        "job": "Executive Producer"
      },
      {
        "name": "Ian Orlando",
        "department": "Sound",
        "job": "Sound Mixer"
      },
      {
        "name": "Krystle Grandy",
        "department": "Production",
        "job": "Travel Coordinator"
      }
    ]
  },
  "keywords": [
    "friendship",
    "based on novel or book",
    "suicide attempt",
    "flashback",
    "remake",
    "miscarriage",
    "new neighbor",
    "mourning",
    "social media",
    "forced retirement",
    "death of wife",
    "bus accident",
    "grumpy man",
    "loss of wife",
    "transgender",
    "happy marriage"
  ],
  "mpaa": "PG-13",
  "summaries": [
    "Otto is a grump who's given up on life following the loss of his wife and wants to end it all. When a young family moves in nearby, he meets his match in quick-witted Marisol, leading to a friendship that will turn his world around.",
    "Otto Anderson is a grump who no longer sees purpose in his life following the loss of his wife. Otto is ready to end it all, but his plans are interrupted when a lively young family moves in next door, and he meets his match in quick-witted Marisol. She challenges him to see life differently, leading to an unlikely friendship that turns his world around. A heartwarming and funny story about love, loss, and life, A Man Called Otto shows that family can sometimes be found in the most unexpected places.—Sony Pictures",
    "Otto Anderson is a grumpy widower who is very set in his ways. When a lively young family moves in next door, he meets his match in quick-witted and very pregnant Marisol, leading to an unlikely friendship that will turn his world upside-down. Experience a funny, heartwarming story about how some families come from the most unexpected places.—Stage 6 Films",
    "Pittsburgh, Pennsylvania. With people finding it hard to like him, grizzled widower Otto Anderson has earned a reputation for being the neighbourhood's irascible, unbearable old grump. But what do they know? And then, just when life seemed to have lost its meaning, sunny new neighbour Marisol and her family move in across the street, interrupting the short-fused curmudgeon's secret plans to go out with a bang. And as the undaunted newcomer's generosity and compassion wear down the frigid misanthrope, melting his ice-cold heart one act of kindness at a time, a question emerges. Is Otto the grumpiest man in America?—Nick Riganas",
    "Otto is a curmudgeonly retiree with a low regard for everybody. His wife died recently and he has nothing left to live for. He is planning on committing suicide. New neighbours move into his street and after his usual disdain for them they start to chip away at his grumpiness.—grantss"
  ],
  "synopsis": "Otto Anderson (Tom Hanks), a 63-year-old widower, lives in suburban Pittsburgh, Pennsylvania. After retiring from a steel company, he plans suicide, having lost his wife Sonya (Rachel Keller), a schoolteacher, six months previously.\nOtto is a grumpy old man, who argues at the super store about being charged for 6 yards of rope, when he only took 5 yards, and the extra yard cost $ 0.33. 33 cents. Otto is a sociopath and doesn't like other people. Otto works for the neighborhood association and checks for every infraction by residents like bikes on lawns, parking permits not displayed correct inside cars and so on.\nOtto cancels his phone, electricity and gas accounts.. he vacuums his house.. He dresses immaculately. He has decided to commit suicide.During a suicide attempt by hanging, Otto has flashbacks to his past; years previously he tried to enlist in the army but was rejected due to his Hyper Trophic cardiomyopathy. He meets Sonya on a train after returning a book she dropped. During the attempt he is interrupted by his new neighbors: Marisol (Mariana Treviño) (who is pregnant), Tommy (Manuel Garcia-Rulfo) (her husband), and their two daughters, Abby (Alessandra Perez) and Luna (Christiana Montoya). They bring him some Mexican food and ask to borrow an Allen wrench. He again attempts hanging himself but the noose fastening falls from the ceiling. As he falls to the floor he spots a flower bouquet advertisement in the newspaper that he'd placed on the floor. He later visits Sonya's grave and tells her about the new neighbors.\nDye & Merika are a real estate company who is buying properties in the area to develop luxury condos.Otto attempts suicide again, this time via carbon monoxide poisoning. He experiences a flashback to a dinner with Sonya, he tells her he is passionate about cars and confesses to her that he is not enlisted in the army due to his heart condition and does not have a job, prompting Sonya to kiss him. Marisol disrupts Otto's suicide attempt, asking him to take her and her kids to the hospital after Tommy fell and broke his leg using a ladder Otto had lent to him. TOmmy was taken by ambulance, but Marisol doesn't have a driver's license. Otto reluctantly agrees and takes them to the hospital.\nAt the hospital Otto sits with the kids and a clown named Beppo comes and borrows a quarter from Otto for a trick. The quarter that Otto gives was a silver 1964 quarter that he got from Sonya, when he first met her. After the trick, Otto sees that Beppo returned a different quarter and Otto assaults him till he gets his original quarter back.\nMarisol is constantly in Otto's life. A few days later she finds a frozen cat in her driveway and brings it to Otto's home to revive it.Otto has a flashback to his graduation when he asked Sonya to marry him. During a suicide attempt by train, an old man faints and falls forward onto the railroad tracks. Otto saves the man and the incident goes viral and he is saved from an oncoming train by someone taking his hand from the platform and pulling him out of the tracks.\nMarisol wants Otto to give her driving lessons, but he refuses. Marisol gets the lessons from another neighbors who teaches her all wrong, prompting Otto to take charge of her driving instructions. Marisol has only ever driven automatic, but Otto insists that she learns to drive stick.Marisol asks Otto if he'd take her for a driving lesson and later they visit Sonya's favorite bakery, which the couple formerly frequented every weekend. Otto adopts a cat that keeps hanging about outside. At the bakery, he tells her about his friendship with a man named Reuben (Peter Lawson Jones), the two having worked together to establish rules and order, with Otto as chairman of the neighborhood association board. The two grew apart after Reuben's preference for Fords and Toyotas over Otto's Chevrolets and the \"coup\" of replacing Otto as chairman. Reuben, who had a stroke, now uses a wheelchair and is cared for by his wife Anita (Juanita Jennings) and neighbor Jimmy (Cameron Britton).A local transgender teen, Malcolm (Mack Bayda), recognizes Otto as Sonya's husband while delivering newspapers and circulars in the neighborhood. Malcolm cuts through Otto's disgruntlement at receipt of the newspapers and recounts that Sonya was his teacher, and one of the few people who accepted him as he was. A friendship forms between the pair and Otto fixes Malcolm's bicycle. After dodging a social media journalist named Shari Kenzie (Kelly Lamor Wilson) who is attempting to interview him in relation to the earlier viral video, Otto gets angry at both Marisol and a Dye & Merika real estate agent (Mike Birbiglia) (who always leaves the gates open and doesn't follow the rules of the society), not wanting to come to terms with Sonya's death. While chasing the agent away, Otto gets agitated and out of breath, but wont tell Marisol anything and shuts her out. He attempts to commit suicide by shotgun, but is interrupted by Malcolm, who asks to spend the night after his father kicked him out.Otto learns that Dye & Merika is planning to force Reuben into a nursing home and take their house, after illegally finding out (By calling their son Chris who had the power of attorney) that Anita was diagnosed with Parkinson's disease. So, Reuben has to move into a special needs place and ANita into a retirement home. This way the real estate company gets the house if Chris agrees to sell to them, which he does.\nOtto agrees to help Anita and Reuben. Marisol refuses to assist Otto (she is angry with him about shutting her out) until he tells her that he and Sonya went to Niagara Falls to celebrate Sonya's pregnancy. On the bus back home, they were involved in a crash, and Sonya became paralyzed and had a miscarriage. The neighborhood was not accessible to Sonya and Otto was voted out of the chairmanship after a heated confrontation with a Dye & Merika representative (David Magee) (who were building condos all around the society and none of it was wheelchair friendly). Otto wanted to put all of the real estate companies out of business (and wanted to sue the bus company who had a recall on the brakes of the bus, but never got it fixed) but decided against it to care for Sonya. With the help of the neighborhood and Shari Kenzie (Who questions the rep on how he has access to medical records of seniors), Reuben and Anita are able to keep their home.Otto collapses and is taken to the hospital, where he lists Marisol as his next of kin. After being told by a cardiologist that Otto's heart is too big, she laughs, before going into labor and gives birth to a son.\nOne day, Tommy notices that Otto did not shovel the snow on his walkway (which he did every single day of his life). Marisol and Tommy enter Otto's house to find him dead, having succumbed to his enlarged heart. A funeral is held, attended by his neighbors. In a letter to Marisol, Otto says that his lawyer will give her his bank accounts, providing them with enough money to take care of her family, along with his new car and house."
}