{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/mWQg2INejtX1PCWRAN4vseadA6H.jpg",
  "id": 9659,
  "title": "Mad Max",
  "poster_path": "https://image.tmdb.org/t/p/w500/5LrI4GiCSrChgkdskVZiwv643Kg.jpg",
  "release_date": "1979-04-12",
  "vote_average": 6.687,
  "vote_count": 4025,
  "popularity": 40.547,
  "overview": "In the ravaged near future, a savage motorcycle gang rules the road. Terrorizing innocent civilians while tearing up the streets, the ruthless gang laughs in the face of a police force hell-bent on stopping them. But they underestimate one officer: Max Rockatansky. And when the bikers brutalize Max's best friend and family, they send him into a mad frenzy that leaves him with only one thing left in the world to live for – revenge!",
  "imdb_id": "tt0079501",
  "budget": 350000,
  "homepage": "",
  "revenue": 100000000,
  "runtime": 91,
  "tagline": "When the gangs take over the highway...remember he's on your side.",
  "genres": [
    "Adventure",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "production_companies": [
    "Kennedy Miller Productions",
    "Crossroads",
    "Mad Max Films",
    "American International Pictures"
  ],
  "production_countries": [
    "AU"
  ],
  "credits": {
    "cast": [
      {
        "name": "Mel Gibson",
        "character": "Max Rockatansky"
      },
      {
        "name": "Joanne Samuel",
        "character": "Jessie Rockatansky"
      },
      {
        "name": "Hugh Keays-Byrne",
        "character": "Toecutter"
      },
      {
        "name": "Steve Bisley",
        "character": "Jim Goose, Main Force Patrol Officer"
      },
      {
        "name": "Tim Burns",
        "character": "Johnny the Boy"
      },
      {
        "name": "Roger Ward",
        "character": "Fifi"
      },
      {
        "name": "Lisa Aldenhoven",
        "character": "Nurse"
      },
      {
        "name": "David Bracks",
        "character": "Mudguts"
      },
      {
        "name": "Bertrand Cadart",
        "character": "Clunk"
      },
      {
        "name": "David Cameron",
        "character": "Underground Mechanic"
      },
      {
        "name": "Robina Chaffey",
        "character": "Singer"
      },
      {
        "name": "Stephen Clark",
        "character": "Sarse"
      },
      {
        "name": "Mathew Constantine",
        "character": "Toddler"
      },
      {
        "name": "Jerry Day",
        "character": "Ziggy"
      },
      {
        "name": "Reg Evans",
        "character": "Station Master"
      },
      {
        "name": "Howard Eynon",
        "character": "Diabando"
      },
      {
        "name": "Max Fairchild",
        "character": "Benno"
      },
      {
        "name": "John Farndale",
        "character": "Grinner"
      },
      {
        "name": "Peter Felmingham",
        "character": "Senior Doctor"
      },
      {
        "name": "Sheila Florance",
        "character": "May Swaisey"
      },
      {
        "name": "Nic Gazzana",
        "character": "Starbuck"
      },
      {
        "name": "Hunter Gibb",
        "character": "Lair"
      },
      {
        "name": "Vincent Gil",
        "character": "Nightrider"
      },
      {
        "name": "Andrew Gilmore",
        "character": "Silvertongue"
      },
      {
        "name": "Jonathan Hardy",
        "character": "Labatouche"
      },
      {
        "name": "Brendan Heath",
        "character": "Sprog"
      },
      {
        "name": "Paul Johnstone",
        "character": "Cundalini"
      },
      {
        "name": "Nico Lathouris",
        "character": "Grease Rat"
      },
      {
        "name": "John Ley",
        "character": "Charlie"
      },
      {
        "name": "Steve Millichamp",
        "character": "Roop"
      },
      {
        "name": "Phil Motherwell",
        "character": "Junior Doctor"
      },
      {
        "name": "George Novak",
        "character": "Scuttle"
      },
      {
        "name": "Geoff Parry",
        "character": "Bubba Zanetti"
      },
      {
        "name": "Lulu Pinkus",
        "character": "Nightrider's Girl"
      },
      {
        "name": "Neil Thompson",
        "character": "TV Newsreader"
      },
      {
        "name": "Billy Tisdall",
        "character": "Midge"
      },
      {
        "name": "Gil Tucker",
        "character": "People's Observer"
      },
      {
        "name": "Kim Sullivan",
        "character": "Girl in Chevvy"
      },
      {
        "name": "John Arnold",
        "character": "Man Selling Dog"
      },
      {
        "name": "Tom Broadbridge",
        "character": "Fat Nancy's Customer"
      },
      {
        "name": "Peter Culpan",
        "character": "Caravan Driver"
      },
      {
        "name": "Peter Ford",
        "character": "Arguing Couple"
      },
      {
        "name": "Clive Hearne",
        "character": "Tow Truck Driver in Diner"
      },
      {
        "name": "Telford Jackson",
        "character": "Tow Truck Driver in Diner"
      },
      {
        "name": "Christine Kaman",
        "character": "Arguing Couple"
      },
      {
        "name": "Joan Letch",
        "character": "Fat Nancy's Waitress"
      },
      {
        "name": "Kerry Miller",
        "character": "Gumchewer"
      },
      {
        "name": "Janine Ogden",
        "character": ""
      },
      {
        "name": "Di Trelour",
        "character": "Caravan Driver's Wife"
      },
      {
        "name": "Vernon Weaver",
        "character": "Fat Nancy's Customer"
      },
      {
        "name": "Paul Young",
        "character": "Fat Nancy's Customer"
      },
      {
        "name": "Brendan Young",
        "character": "Kid Outside Halls of Justice"
      },
      {
        "name": "Amanda Muggleton",
        "character": "Biker's Moll (uncredited)"
      },
      {
        "name": "James McCausland",
        "character": "Bearded Man in Apron (uncredited)"
      },
      {
        "name": "Lisa Dombroski",
        "character": "Moll on Beach"
      },
      {
        "name": "Malcolm Bruce",
        "character": "Kid Outside Halls of Justice (uncredited)"
      }
    ],
    "crew": [
      {
        "name": "George Miller",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "George Miller",
        "department": "Directing",
        "job": "Director"
      },
      {
        "name": "George Miller",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "David Eggby",
        "department": "Camera",
        "job": "Director of Photography"
      },
      {
        "name": "Bill Miller",
        "department": "Production",
        "job": "Associate Producer"
      },
      {
        "name": "James McCausland",
        "department": "Writing",
        "job": "Screenplay"
      },
      {
        "name": "Brian May",
        "department": "Sound",
        "job": "Original Music Composer"
      },
      {
        "name": "Cliff Hayes",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Tony Paterson",
        "department": "Editing",
        "job": "Editor"
      },
      {
        "name": "Gary Wilkins",
        "department": "Sound",
        "job": "Sound Recordist"
      },
      {
        "name": "Chris Murray",
        "department": "Crew",
        "job": "Special Effects"
      },
      {
        "name": "Jenny Day",
        "department": "Production",
        "job": "Production Coordinator"
      },
      {
        "name": "Grant Page",
        "department": "Crew",
        "job": "Stunt Coordinator"
      },
      {
        "name": "Ben Taylor",
        "department": "Costume & Make-Up",
        "job": "Hairstylist"
      },
      {
        "name": "Phil Brock",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Shirley Ballard",
        "department": "Directing",
        "job": "Script Supervisor"
      },
      {
        "name": "Byron Kennedy",
        "department": "Production",
        "job": "Producer"
      },
      {
        "name": "Byron Kennedy",
        "department": "Writing",
        "job": "Story"
      },
      {
        "name": "Jon Dowding",
        "department": "Art",
        "job": "Art Direction"
      },
      {
        "name": "Steve Amezdroz",
        "department": "Art",
        "job": "Assistant Art Director"
      },
      {
        "name": "David Bracks",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "John Hipwell",
        "department": "Production",
        "job": "Unit Production Manager"
      },
      {
        "name": "Tom Broadbridge",
        "department": "Production",
        "job": "Production Assistant"
      },
      {
        "name": "Chris Anderson",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Vivien Mepham",
        "department": "Costume & Make-Up",
        "job": "Makeup Artist"
      },
      {
        "name": "Clare Griffin",
        "department": "Costume & Make-Up",
        "job": "Costume Design"
      },
      {
        "name": "Mark J. Wasiutak",
        "department": "Sound",
        "job": "Boom Operator"
      },
      {
        "name": "George Novak",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ian Goddard",
        "department": "Directing",
        "job": "First Assistant Director"
      },
      {
        "name": "Lindsay Foote",
        "department": "Lighting",
        "job": "Gaffer"
      },
      {
        "name": "Richard Francis",
        "department": "Art",
        "job": "Props"
      },
      {
        "name": "David Cassar",
        "department": "Camera",
        "job": "Grip"
      },
      {
        "name": "Noel McDonald",
        "department": "Camera",
        "job": "Grip"
      },
      {
        "name": "Harry Glynatsis",
        "department": "Camera",
        "job": "Assistant Camera"
      },
      {
        "name": "Chic Stringer",
        "department": "Camera",
        "job": "Still Photographer"
      },
      {
        "name": "Jerry Gibson",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Garry Plunkett",
        "department": "Lighting",
        "job": "Best Boy Electric"
      },
      {
        "name": "Gerry Gauslaa",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Dale Bensch",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Steve Connard",
        "department": "Directing",
        "job": "Second Assistant Director"
      },
      {
        "name": "Des Sheridan",
        "department": "Directing",
        "job": "Third Assistant Director"
      },
      {
        "name": "Tim Smart",
        "department": "Camera",
        "job": "Second Unit Director of Photography"
      },
      {
        "name": "Tim Smart",
        "department": "Camera",
        "job": "Clapper Loader"
      },
      {
        "name": "Merran Kingsford-Smith",
        "department": "Costume & Make-Up",
        "job": "Wardrobe Coordinator"
      },
      {
        "name": "Michael Daniels",
        "department": "Crew",
        "job": "Stunts"
      },
      {
        "name": "Ned Dawson",
        "department": "Sound",
        "job": "Sound Effects"
      },
      {
        "name": "Bill Owen",
        "department": "Art",
        "job": "Title Designer"
      }
    ]
  },
  "keywords": [
    "australia",
    "baby",
    "chain",
    "dystopia",
    "post-apocalyptic future",
    "exploitation",
    "villain",
    "bridge",
    "matter of life and death",
    "benzine",
    "biker",
    "cop",
    "partner",
    "truck",
    "vigilante",
    "motorcycle",
    "motorcycle gang",
    "exploding car",
    "adventurer",
    "action hero",
    "good versus evil"
  ],
  "mpaa": "R",
  "summaries": [
    "In a self-destructing world, a vengeful Australian policeman sets out to stop a violent motorcycle gang.",
    "Taking place in a dystopian Australia in the near future, Mad Max tells the story of a highway patrolman cruising the squalid back roads that have become the breeding ground of criminals foraging for gasoline and scraps. After some grisly events at the hands of a motorcycle gang, Max sets out across the barren wastelands in search of revenge.—Cole Matthews",
    "As a perpetual energy crisis brings a post-apocalyptic Australia to its knees, only fragments of law, civilisation, and order remain, and the brutal Night Rider's marauding motorcycle gang of outlaws terrorise the remaining outback communities. When Max Rockatansky, a hard-boiled officer of the elite Main Force Patrol, kills the blood-lusting cop-killer, his comrades, led by the sadistic Toe-cutter, embark on a mindless killing spree. Now, it's Max's turn to mourn his loved ones and take the law into his own hands. Who can stand in the way of Mad Max, the road warrior?—Nick Riganas",
    "It is a couple of years in the future. The highways of Australia are ruled by violent gangs who have turned the highways into a battleground as they loot gasoline and terrorize the innocent. Max Rockatansky is a policeman who had everything, until a murderous motorcycle gang led by the evil Toecutter kills his partner Jim Goose, after Max killed their leader \"The Knight Rider\". Losing his rocker, Max sets out to get his revenge on the motorcycle gang and become \"Mad Max\".—Daniel Williamson",
    "In a dystopic future Australia, a vicious violent biker gang murder nicknamed the Nightrider, a cop's family and make his fight with them personal. He escapes from police custody by killing an officer and stealing his vehicle. Max pursues the Nightrider in a high-speed chase, which results in the Nightrider's death by fiery explosion. Following the dangerous chase, which resulted in injuries for a number of officers, the police chief warns Max who thinks nothing of it at the time that now the bandits are out for him because of the death of the Nightrider. The biker gang, which is led by the Toecutter plans to avenge Nightrider's death by killing MFP officers. Toecutter's young protegé, the biker Johnny the Boy, sets a trap for Max's close friend and fellow officer, Jim Goose. When Goose's vehicle is flipped over, the bikers burn him alive in retaliation for the Nightrider's death.—Anthony Pereyra {hypersonic91@yahoo.com}"
  ],
  "synopsis": "The film is set in the near future of a bleak, dystopian and impoverished Australia that is facing a breakdown of civil order primarily due to widespread oil shortages. (This is not explained in this film but in the sequel, Mad Max 2: The Road Warrior.) Central to the plot is a poorly funded national police unit called the Main Force Patrol (MFP, derogatorily called \"The Bronze\" by their enemies), which struggles to protect the Outback's few remaining townspeople from violent motorcycle gangs. The MFP's \"top pursuit man\" is a young police officer, Max Rockatansky (Mel Gibson), badge number MFP4073.A member of one of the motorcycle gangs, Crawford Montazano (nicknamed Nightrider), escapes from police custody by killing an officer and stealing his vehicle. Max pursues Nightrider in a high-speed chase, which results in Nightrider's death in a fiery car crash. After the dangerous chase (which results in injuries to a number of officers), the police chief warns Max that Nightrider's gang will be out for him now because of Nightrider's death.Nightrider's gang, which is led by Toecutter (Hugh Keays-Byrne), plans to avenge Nightrider's death by killing MFP officers. Meanwhile, they vandalize property, steal fuel, and terrorize the citizenry. While chewing up a town where the Nightrider's remains arrived by train, the gang brutalizes a civilian couple that tried escaping to the road; the couple is overtaken, then both of them are sexually assaulted and the car is wrecked. Max and his close friend and fellow officer, Jim Goose (Steve Bisley), are informed about the incident and go to the crime scene. They find Toecutter's young protege, Johnny the Boy (Tim Burns), and the girl of the couple in the middle of the wreckage. Johnny's drug-fueled rantings reveal him as a member of Nightrider's gang; Goose looks on Johnny with particular disdain, as his leg was broken during the Nightrider pursuit. However, they do not kill Johnny, but arrest him and drag him away in chains.Johnny is held at the MFP's dilapidated Halls of Justice pending a visit from the Court. However, when the attorneys arrive, Johnny is ordered released: the judge has set Johnny free because no witnesses showed up for the trial. (Without the testimony of witnesses, no charges could be filed; the courts declared \"no contest\" for the case.) A shocked Goose attacks Johnny and must be physically restrained; both Goose and Johnny shout threats of revenge at each other. The second-in-command of the biker group, Bubba Zanetti (Geoff Parry) arrives at the courthouse to pick up Johnny, on orders from the Toecutter. Bubba does so begrudgingly, because he hates Johnny for his rowdiness and lack of style and hates the Toecutter's favoritism towards Johnny.Shortly thereafter, Johnny the Boy sabotages Goose's MFP motorcycle while Goose is attending a show at the Sugartown Cabaret. His rear wheel locks up at high speed the next day, throwing Goose from the bike; Goose, however, survives without even suffering \"road rash\". Goose borrows a Ute to haul his bike back to civilization. Unfortunately, Johnny throws a brake drum through the Ute's windshield, causing Goose to roll the vehicle over and gas leaks from the fuel tank, soaking the ground around the truck; Johnny, at the belligerent urging of the Toecutter himself, then burns him alive in the wreckage. Goose survives, but after seeing his charred body in the hospital's burn ward, Max becomes angry and disillusioned with the police force and resigns from the MFP with no intention of returning. He takes a road trip with his wife and infant son in the relatively peaceful coastal area north of their home.While on holiday, Max's wife, Jessie, (played by Joanne Samuel) runs into Toecutter's gang, who harass her. She escapes, but the gang manages to track her to the home where she and Max are staying. While attempting to escape from the gang again, Jessie and her son are run down by the gang, who leave their crushed bodies in the middle of the road. Max arrives too late to intervene. His son is pronounced dead on the scene, while his wife suffers massive injuries. (It is revealed in Mad Max 2: The Road Warrior that she later died from her injuries.)Filled with obsessive rage, Max once again dons his police outfit, straps on his cut-off shotgun, and steals a supercharged black Pursuit Special to pursue the gang. He methodically hunts down and kills the gang members: several gang members are forced off a bridge at high speed; Max shoots and shoots Bubba off his cycle with his shotgun (Bubba shoots Max in the leg with a pistol first, though, giving Max a limp that is consistent throughout the series, then runs over his exposed arm). Pursuing the Toecutter into a forbidden area, Max forces the gang's leader into the path of a speeding tractor trailer and he crushed in a head-on .Later, Max finds Johnny the Boy taking the boots off a dead driver at the scene of a crash. Johnny desperately tries to convince Max that the man was dead when he found him and that his drug addiction has made him mentally unbalanced. Max doesn't listen and handcuffs Johnny's ankle to the wrecked, overturned vehicle with a ruptured petrol tank. Max lights a crude time-delay fuse and gives Johnny a hacksaw, leaving him the choice of sawing through either the handcuffs (which will take 10 minutes) or his ankle (which will take 5 minutes), and then drives off into the desolate outback. As Max drives away, the camera shows Max's car from the front, with a large and fiery explosion in the distance behind it. Max blankly continues to drive in a rainstorm."
}