{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/5bzPWQ2dFUl2aZKkp7ILJVVkRed.jpg",
  "id": 105,
  "title": "Back to the Future",
  "poster_path": "https://image.tmdb.org/t/p/w500/fNOH9f1aA7XRTzl1sAOx9iF553Q.jpg",
  "release_date": "1985-07-03",
  "vote_average": 8.314,
  "popularity": 70.38,
  "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
  "imdb_id": "tt0088763",
  "budget": 19000000,
  "homepage": "http://www.backtothefuture.com/movies/backtothefuture1",
  "revenue": 381109762,
  "runtime": 116,
  "genres": [
    "Adventure",
    "Comedy",
    "Science Fiction"
  ],
  "summaries": [
    "Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.",
    "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.—Official Synopsis",
    "Small-town California teen Marty McFly is thrown back into the '50s when an experiment by his eccentric scientist friend Doc Brown goes awry. Traveling through time in a modified DeLorean car, Marty encounters young versions of his parents and must make sure that they fall in love or he'll cease to exist. Even more dauntingly, Marty has to return to his own time and save the life of Doc Brown.—Jwelch5742",
    "Hill Valley, California, 1985. Destined to follow in his wimpy dad's footsteps, average high school teenager Marty McFly is about to make history. And when his crackpot scientist friend Emmett \"Doc\" Brown fashions a time machine out of a 1982 DeLorean DMC-12, Marty inadvertently jumps back 30 years to do the unthinkable. But things were different in 1955. Like a fish out of water, Marty gives his all to keep the time/space continuum intact; however, unforeseen romantic complications stand in the way of a safe return. Now, a pressing question arises. What will it take to go back to the future?—Nick Riganas",
    "A male high school teenager accidentally finds himself in the past in a time machine that was invented by a scientist. He now has to find a way back to his own time with the help of the past version of the scientist while making sure that his parents get together to not be wiped away from existence.—RECB3"
  ],
  "synopsis": "Marty McFly (Michael J. Fox). Marty D is a friend of scientist, Doc (Christopher Llyod).Doc asks Marty to meet him that night at the Twin Pines Mall at 1:15 a.m.. Marty asks him where he's been all week.\nMarty's girlfriend Jennifer (Claudia Wells) is his classmate at high school where Marty is always in trouble for being friends with Doc. Marty's dad George is a big league loser. & puts up with all kinds of nonsense from his supervisor Biff who totally rides rod-shod over George. Marty's mum Lorraine behaves like a nun & doesn't allow Marty any kind of freedom with Jennifer. The town clock tower was stuck by lightening 30 yrs ago & has been shut ever since. Marty has brother Dave & sister Linda. Lorraine's brother Joey was in jail & is just being released. Lorraine also reveals how she met George. George was in a tree, & was hit by Lorraine's dad's car who brought him home when he fell. Lorraine asked George to prom out of sympathy & when George kissed him at the dance, she decided to marry him.at 1 am Marty heads to twin pines mall to meet Doc who is with his modified Delorean car. Doc demonstrates that his car is a time machine, works on Plutonium & starts at 88 mph. Doc reveals that he got the Plutonium from Libyan terrorists who wanted a bomb, but Doc delivered a fake. Libyans attack & kill Doc. Marty hide in the car & accelerate to 88 mph & travel back in time to 1955 (the year Doc discovered the time machine formula). Marty realizes he has landed in the past & tries to find Doc. He finds young George being bullied by young Biff. George has a penchant for peeping & falls from a tree on to the path on an oncoming car. Marty pushes him & gets hit himself. The car owner takes Marty home. Marty wakes to young Lorraine looking seductively at Marty.Marty finds Doc & shows him the car to prove that he is from future. Doc promises Marty to get him back to 1985. The car required 1.21 GW, & in absence of plutonium only a lightening bolt will work. MArty remembers that the clock tower was stuck by lightening in 1955 & tells Doc. Doc also tells Marty that his messing with events in 1955 can impact the future. Already Marty can see his brother disappear from his wallet family photo.Marty has to get George & Lorraine together, but Lorraine loves Marty. Marty foiling Biff's plans to humiliate George only endear Marty even more to Lorraine. Lorraine asks Marty to dance & Marty tells George that he will try to take advantage of Lorraine & George can step in & be a hero. At the night of the dance & the night of the lightening bolt, Marty slips a note into Doc's coat saying that he was killed by Libyans in 1985.Marty is with Lorraine when Biff pushes Marty & takes Lorraine into his car & starts molesting her. George arrives & starts to rescue Lorraine, but its Biff. George is humiliated again, but summons the strength to knock Biff out.\nMarty meets Doc who has hooked a cable from the clock tower to the car to provide the power. Marty drives the car & gets it to 88 mph, just as lightening strikes & gets back to 1985. He finds Doc who is on his back & is distraught. But Doc is OK as he was wearing a bullet proof vest based on Marty's note.George and Lorraine arrive home from a tennis match, happy and even a bit frisky. Lorraine asks Marty about the camping trip he has planned with Jennifer, to which Marty mentions that the car is wrecked. Everyone starts barking about it until George shows them that Biff is waxing the car (a BMW) in the driveway. Biff comes into the house carrying a box filled with copies of George's first published book."
}