{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/2P0toWq3feNvFAzf28j7vNc1IuZ.jpg",
  "id": 106646,
  "title": "The Wolf of Wall Street",
  "poster_path": "https://image.tmdb.org/t/p/w500/34m2tygAYBGqA9MXKhRDtzYd4MR.jpg",
  "release_date": "2013-12-25",
  "vote_average": 8.035,
  "vote_count": 22782,
  "popularity": 95.239,
  "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
  "imdb_id": "tt0993846",
  "budget": 100000000,
  "homepage": "http://www.thewolfofwallstreet.com/",
  "revenue": 392000000,
  "runtime": 180,
  "genres": [
    "Crime",
    "Drama",
    "Comedy"
  ],
  "summaries": [
    "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.",
    "Jordan Belfort (DiCaprio) is Long Island penny stockbroker who serves almost two years in prison for refusing to co-operate in a huge 1990s securities fraud case that involved widespread corruption on Wall Street and in the corporate banking world, including mob infiltration."
  ],
  "synopsis": "Jordan Belfort (Leonardo DiCaprio) narrates the film showing his monstrous success with his firm complete with ribaldry at work, a sumptuous home on the Gold Coast of Long Island and a trophy wife who is a former model. He then flashes back to 1987, where he began a low-level job at an established Wall Street firm. His boss Mark Hanna (Matthew McConaughey) advises him to adopt a lifestyle of casual sex and cocaine to succeed. However, shortly after he passes his exam to become a certified stockbroker, he loses his job on account of the firm's bankruptcy as a result of Black Monday.Now unemployed in an economy that is unaccommodating to stockbrokers and sufficiently discouraged to consider a new line of work, Jordan's wife Teresa (Cristin Milioti) encourages him to take a job with a Long Island boiler room dealing in penny stocks, which are also largely ignored by regulators. Belfort impresses his new boss with his aggressive pitching style, and earns a small fortune for the boiler room and himself as penny stocks have a much higher commission than blue chips. Jordan also befriends Donnie Azoff (Jonah Hill), a salesman living in the same apartment complex and they decide to go into business together. To facilitate this, his accountant parents are recruited as well as several of Jordan's friends, some of them experienced marijuana dealers. The basic method of the firm is a pump and dump scam. To cloak this, Belfort gives the firm the respectable WASP like sounding name of Stratton Oakmont. An article in Forbes dubs Jordan the \"Wolf of Wall Street\", and soon hundreds of ambitious young financiers flock to his company.A decadent lifestyle of lavish parties, sex and drugs follows. Jordan regularly uses prostitutes and becomes addicted to cocaine and Quaaludes. FBI Agent Patrick Denham (Kyle Chandler) begins investigating Stratton Oakmont. When Jordan meets Naomi Lapaglia (Margot Robbie) at one of his parties, he begins an affair with her, resulting in his divorce from Teresa. Jordan makes Naomi his second wife in an extravagant wedding and gives her a yacht aptly named Naomi, and soon they have a daughter, Skylar.Meanwhile, the Securities and Exchange Commission works jointly with the FBI to intensify the Stratton Oakmont investigation.\nJordan instantly makes US$22 million on his securing the IPO of Steve Madden Ltd. To hide his money, Jordan opens a Swiss bank account with the corrupt banker Jean-Jacques Saurel (Jean Dujardin) in the name of Naomi's aunt Emma (Joanna Lumley), who is a British citizen and outside the reach of American authorities. He uses friends with European passports to smuggle cash to Switzerland. When Donnie gets into a public fight with Brad Bodnick (Jon Bernthal), who is one of their money couriers, and Brad is arrested, their scheme is nearly exposed.Donnie offers Jordan a powerful brand of Quaaludes, hoping to ease the sting of the bad news. The pills are old and seem to have lost their potency, so they take huge doses to compensate. Jordan then receives a call from Bo Dietl, his private investigator, who insists Jordan call him back from a payphone. Jordan drives to a country club to phone Bo, who warns Jordan of Brad's arrest and that his house phone has been wiretapped. At this point, the Quaaludes finally kick in with overwhelming effect. Severely debilitated, Jordan drives back home to prevent Donnie from using his phone. When Jordan arrives home Donnie (who is also high) is on the phone with Saurel. Jordan fights Donnie to make him get off the phone and tells him he found out what happened between him and Brad. Donnie starts choking on ham and nearly suffocates. Jordan snorts cocaine to counteract the effect of the Quaaludes in order to help save Donnie's life.With the shadow of law enforcement hanging over them, Jordan's father Max (Rob Reiner) attempts to convince his son to step down from Stratton Oakmont and escape the large amount of legal penalties. However, during his leaving party at the office, Jordan changes his mind and to the great acclaim of his employees vows to stay on.Jordan, Donnie and their wives on a yacht trip to Italy learn that Emma has died of a heart attack. Over his grieving wife's objections, Jordan decides to sail to Monaco so they can drive to Switzerland without getting their passports stamped at the border and settle the bank account, but a violent storm capsizes their yacht. After their rescue, the plane sent to take them to Geneva is destroyed by a seagull flying into the engine, exploding and killing three people. Witnessing this, Jordan considers this a sign from God and decides to sober up.Two years later, Denham arrests Jordan during the filming of an infomercial. Saurel, arrested in Florida over an unrelated charge, has told the FBI everything. Since the evidence against him is overwhelming, Jordan agrees to gather evidence on his colleagues in exchange for leniency.Jordan is optimistic about his sentencing but after one last bout of sex, Naomi tells Jordan she will divorce him and wants full custody of their children. Jordan throws a violent tantrum, gets high, and ends up crashing his car in his driveway during an attempt to abscond with their daughter.The next morning, Jordan wears a wire to work. Jordan silently slips Donnie a note warning him about the wire. The note finds its way to Agent Denham, who arrests Jordan for breaching his cooperation deal. The FBI raids and shuts down Stratton Oakmont.\nDespite this one breach, Jordan receives a much reduced sentence for his testimony and is sentenced to 36 months in a minimum security prison in Nevada. After his release, Jordan makes a living hosting seminars on sales technique."
}