{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/8KJMOKyl9rpgb9ELEwhfBMIaTHw.jpg",
  "id": 1139087,
  "title": "Once Upon a Studio",
  "poster_path": "https://image.tmdb.org/t/p/w500/hr8ZtwdbtjBquxlTCrczr685K5T.jpg",
  "release_date": "2023-09-24",
  "vote_average": 8.4,
  "popularity": 45.572,
  "overview": "Created for Disney's 100th anniversary, the short features Mickey Mouse corralling a gallery of legendary Disney characters for a group photo.",
  "imdb_id": "tt28035641",
  "budget": 0,
  "homepage": "",
  "revenue": 0,
  "runtime": 9,
  "genres": [
    "Animation",
    "Family",
    "Fantasy",
    "Comedy"
  ],
  "summaries": [
    "An all-star ensemble of beloved characters from Walt Disney Animation Studios come together for a joyful, entertaining and emotional reunion as they assemble for a spectacular group photo to mark Disney's 100th anniversary."
  ],
  "synopsis": "Taking place on October 16, 2023, when Walt Disney Animation Studios turned 100 years old, its employees are leaving the building as their usual work day is done and Burny Mattinson imagines about the walls of the studio after talking with an intern.Inside the studio, Mickey Mouse, as seen in a production cel for Mickey's Birthday Party, comes to life, and calls Tinker Bell. Mickey questions if all of the employees are gone, in which Tink nods with a yes. Excited, Mickey, with his girlfriend Minnie, jump out of the cel, and Minnie gets many characters from the studio's filmography with a \"Yoo-Hoo\" signal, traditionally or computer animated while enlisting Peter Pan to gather everyone from upstairs. Mickey reminds every character from the studio to take a group photo, all meeting in the lobby.During that, several gags of the characters interacting do happen such as:Sisu running happily down the hall, followed by Jim Hawkins riding on his Alponian Solar Cruiser, Maui flying in his hawk form, Aladdin and Abu sliding down the railing with them ending up with the trolls, Vanellope von Schweetz and Dodger riding on her candy kart, Elliott taking Cody on a fun ride, and Wayne and Lanny sliding down their ropes.\nMoana searching for water for Flounder, and with help from Merlin (who was at the Snuggly Duckling coffee area with his sugar bowl, the Mad Hatter, the March Hare, Cogsworth, Mrs. Potts, Chip, and Dr. Krunklehorn), he uses his magic to summon water in the Mad Hatter's hat for Flounder to swim in.\nElsa freezing Hans from his frame after Anna ask her if she thinks that all of the villains will be show up (most likely because she would be worried about seeing Hans again after he tried to kill them) after seeing an angry Stromboli trying to get a candy from the studio's snack machine.\nFlash taking his time walking to the elevator, much to the chagrin of Donald Duck, Humphrey, Ranger Woodlore, Terk, Carl, and Mother Gothel, with Baymax squeezing in the elevator after he makes it.\nOlaf drawing on a desk as the Robin Williams Lost Boy, Timon and Pumbaa walk by, with Timon telling him to shake a leg (in which Olaf replies that the leg won't make a difference) when Genie bursts out of the drawing, sending Olaf into pieces and he uses his magic to put Olaf back together.\nWhile Prince John, Thomas O'Malley, Chicken Little, Milo Thatch, Happy, the Headless Horseman, and Gaston are freshening up in the men's room, the Cheshire Cat appears in front of his face, laughing, when Minnie comes in while covering her eyes and tells them to move it.\nWhile Christopher Robin, Kanga, and Eeyore try to free Winnie the Pooh from his picture, Antonio Madrigal is seen speaking to Cinderella's bird friends, Meeko, Cri-kee, Pascal, and Pua while stopping Joanna the Goanna from eating Jaq and Gus before getting spooked by a barking Pluto.\nWhile MacBadger, Ratty, Mole, Ryder, Honeymaren, Sven, and Kristoff walk by, Kristoff warns some Dalmatian puppies, who are watching \"Night on Bald Mountain\" on a TV, that it'll give them nightmares when Chernabog pops out of the TV, scaring the puppies and they run away, while running over Scrooge McDuck, who drops his sacks of money, and Robin Hood and Little John grab them.\nUrsula was being followed and annoyed by a love struck Splat. Cinderella and Prince Charming follow down the stairs, where the prince is the one to drop his shoe, much to their humor. Max picks up the shoe and runs off with it. Charming calls for Eric while Cinderella cheers for Max. Mickey was amused by this when he sees Kaa leading Clarabelle Cow with his hypnosis. He tries to get him to stop, but Rapunzel has it covered, hitting Kaa with her frying pan off-screen.While all of this is happening, Mickey looks up at a photograph of studio co-founder Walt Disney and takes his hat off to fondly remember his legacy. Minnie reminds Mickey that everyone is at the lobby as Mickey speaks to the picture saying that he has to go.Everyone then ventures outside to take the group photo. However, things backfire as Goofy accidentally falls off the ladder, breaking the camera. Everyone prepares to leave in disappointment as the group photo is cancelled. Just then, Alan-a-Dale plays \"When You Wish Upon a Star\" on his lute joined in by Scat Cat on his trumpet and Mirabel Madrigal on her accordion.As everyone sings the song, Lewis Robinson cries, the brooms sweep up Goofy's camera, Fix-It Felix Jr. fixes it with his hammer, Hercules puts the ladder back in position, and the Fairy Godmother uses her magic wand to help Goofy up the ladder while setting the camera up for the photo. Everyone is prepared as the song comes to a close.The photo is taken, and Tinker Bell then cuts the scene to the group photo and the film ends with a tagline \"To all who imagined with us, laughed with us and dreamed with us, thank you\"."
}