{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/A9vrM4JXuIWPDf7KJan9D3WfMIQ.jpg",
  "id": 1150394,
  "title": "The Legend of the Spirits",
  "poster_path": "https://image.tmdb.org/t/p/w500/4f9ghI3utknpeBZSAzNuIKKATOA.jpg",
  "release_date": "2023-07-14",
  "vote_average": 8.403,
  "popularity": 39.991,
  "overview": "Five years after giving up his powers and separating from his friends, Leo San Juan has started a new life trying to focus on his family and their bakery, staying away from danger and adventures. However, Leo knows that his plans are rarely fulfilled and this time is no exception: while traveling with Nando to Veracruz, things start to get weird, and from the depths of the Tuxtlas jungle, an ancient curse has returned and only Leo can face it.",
  "imdb_id": "tt28283972",
  "budget": 1100000,
  "homepage": "",
  "revenue": 0,
  "runtime": 89,
  "genres": [
    "Animation",
    "Comedy",
    "Family",
    "Horror"
  ],
  "summaries": [
    "Five years after giving up his powers, Leo San Juan is accompanied by Nando on his way to Veracruz, when an ancient local curse strikes. This time Leo has no powers, no friends, no time, and apparently no opportunity."
  ],
  "synopsis": "At Veracruz, within the Tuxtla jungle, strange creatures are disturbing a small woodworking village's peace: a thick fog drowns the place, you can hear sharp screeching among the trees, plants move on their own and strange apparitions have begun taking the local villagers. Everyone, however, seems to be regaining hope after Leo San Juan, a renowned legend hunter, pops up around town alongside his brother Nando giving away provisions from his bakery.But it's been five years since Leo went on his last adventure and had to surrender his powers, and since he last saw his ghost friends who bid him farewell while trying to keep him away from harm. Since then, Leo had been living a normal life in Puebla with his family and has now decided for a change of scenery while looking for more mundane adventures: Leo wants to become a sailor and has asked his brother to take him to the port city of Veracruz where he can enroll for a job on a merchant boat. Leo has agreed to join Nando during his commercial stop as long as it doesn't delay him from reaching his own destination.It's then when Diego, a boy from the village, asks Leo and Nando to help him find his dad who was kidnapped by the mythical and dangerous chaneques. Leo doesn't want to accept the mission, he doesn't even want to hear about it, how will he ever help them without his powers, his friends, and having to rush to board a boat?Nando then decides, in the middle of the night, to venture out with Diego and help him, what if he also has powers? After all, he is the brother of the greatest legend hunter Mexico has ever seen. After seeing how Nando has joined Diego into the jungle, Leo can't help himself and decides to run after them before the chaneques get to them and it's too late.Just as he's entering the jungle, the chaneques trick Leo and he's attacked by creatures and trees... there seems to be no escape, but he's saved by a curandero that had been following him. The curandero tells him about the chaneque's cenote and tells him how important it is for him to accept his ghost friends' help and how, without their help, he won't be able to find his brother and beat them. But Leo finds it hard to let go of his fears, he just wants to find his brother so he can move on and become a merchant sailor at a new life... Although it seems like he will have no other choice but to invoke them.Will Leo be able to see his friends again? Will he be able to find Nando and Diego before it's too late? And most importantly, will he be able to beat the chaneques without his powers?"
}