{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/xvzxqKWltnj6qSiWBXRq6ZCdcrw.jpg",
  "id": 1151534,
  "title": "Nowhere",
  "poster_path": "https://image.tmdb.org/t/p/w500/cVxIX8JJJB179zh7wcUt0A6TpQQ.jpg",
  "release_date": "2023-09-29",
  "vote_average": 7.5,
  "vote_count": 1069,
  "popularity": 110.009,
  "overview": "A young pregnant woman named Mia escapes from a country at war by hiding in a maritime container aboard a cargo ship. After a violent storm, Mia gives birth to the child while lost at sea, where she must fight to survive.",
  "imdb_id": "tt15789472",
  "budget": 0,
  "homepage": "https://www.netflix.com/title/81449034",
  "revenue": 0,
  "runtime": 109,
  "genres": [
    "Thriller",
    "Drama"
  ],
  "summaries": [
    "A young pregnant woman named Mia escapes from a country at war by hiding in a maritime container aboard a cargo ship. After a violent storm, Mia gives birth to her child while lost at sea, where she must fight to survive.",
    "Set in a dystopian future, Spain has been turned into a dictatorship, where its government plans to eradicate children, pregnant women, and the elderly to deal with the lack of resources. The plot follows a pregnant woman separated from her husband while trying to flee the country to Ireland. She then finds herself trying to survive inside a shipping container in the heart of the sea."
  ],
  "synopsis": "Mia and Nico decide to leave Spain due to a crisis that has caused a shortage of necessities and a tyrannical government. They fear for their lives and the safety of their unborn child. The couple had previously lost their firstborn daughter, Uma, who the military took away from them and is presumed dead. Mia blames herself for Uma's disappearance and carries the guilt with her.Nico's plan is for them to escape to Ireland by being transported on a cargo ship. They both get onto a container to be carried by a truck. However, the military separates them when Nico is forced out of the container and onto another container. At a military checkpoint, the military kills everyone in the container but Mia as she hid on top of a stack of crates. Later, Mia tries to phone Nico to warn him of the danger but fails to reach him.All containers, including Mia's, are loaded onto a ship. A later storm causes the containers to fall into the ocean. Her container, slowly filling with water, has a cargo of Tupperware household containers, packaged earphones, packaged flatscreen TVs, bottled vodka, and packaged hoodies, all of which she uses to help herself survive, along with a drill, some tape, and a penknife she had managed to salvage from earlier. Upon hearing screams, she looks in a bullet hole, through which she spots another container, packed with people and sinking underwater, just a few meters away. After two days in the container, Nico phones her and tells her he is on the way to rescue her.That night, Mia gives birth during a storm to a daughter, Noa. Mia becomes determined to fight for their chances of survival despite being severely weakened, having delusions of Uma, and resorting to eating her placenta. As the water level inside the container rises, Mia manages to puncture a hole in the roof using the drill and the penknife, and she and Noa climb on top of it. While trying to capture the attention of a passing airplane, Mia severely gashes her leg. She stitches it using parts from the TVs and uses some vodka to sterilize the wound. She later manages to catch fish using a makeshift net.Nico phones Mia after roughly twenty days, revealing his precarious health condition after being shot and his unlikely chance of survival. Mia is devastated but shares the news of their daughter's birth with Nico in their final conversation. Nico urges Mia to continue fighting and reach Ireland, promising to always be with them in spirit.Mia constructs a makeshift raft using materials from the container and drifts in the ocean after the container sinks, hoping for a miracle. Eventually, a family on a fishing boat spots Noa on the floating raft. Mia, however, is unconscious and tied to the raft with a rope. They bring her on board their boat and perform CPR, successfully reviving her.Mia and Noa are rescued and brought to the shores of Ireland."
}