{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/v5xXTpfMT5NpjQeDMNYNLflaiuA.jpg",
  "id": 13002,
  "title": "Barbie in The 12 Dancing Princesses",
  "poster_path": "https://image.tmdb.org/t/p/w500/yBB7PwXRFJ29U8m8SnTcWVizFvM.jpg",
  "release_date": "2006-09-19",
  "vote_average": 7.6,
  "vote_count": 1093,
  "popularity": 39.53,
  "overview": "King Randolph sends for his cousin, Duchess Rowena, to help turn his daughters, Princess Genevieve and her eleven sisters, into royal material. But the Duchess strips the sisters of their fun, including their favorite pastime: dancing. When all hope may be lost, the sisters discover a secret passageway to a magical land where they can dance the night away.",
  "imdb_id": "tt0859594",
  "budget": 0,
  "homepage": "",
  "revenue": 0,
  "runtime": 82,
  "genres": [
    "Animation",
    "Family"
  ],
  "summaries": [
    "The widowed King Randolph enlists the help of his cousin to teach his daughters the proper royal etiquette. Instead, she bans all dancing in the palace. Can the twelve dancing princesses save the kingdom with their late mother's gift?",
    "All on his own, the kind widowed ruler, King Randolph, fears that his lively daughter, Princess Genevieve, and her eleven equally high-spirited sisters lack a mother figure. Intent on helping them transform into proper young ladies, the king enlists the help of his poor cousin, Duchess Rowena, to teach the girls a thing or two about manners and the royal etiquette. Instead, the cruel relative bans all singing and dancing in the palace; however, the girls discover a magical entrance to an enchanted world where everything is possible. Can the twelve dancing princesses save the kingdom with their late mother's gift?—Nick Riganas",
    "King Randolph sends for his cousin Duchess Rowena to help turn his daughters, Princess Genevieve and her 11 sisters, into better ladies. But the Duchess takes away all the sisters fun, including the sisters favorite pastime: dancing. Thinking all hope is lost they find a secret passageway to a magical land were they can dance the night away. But what happens when their father suddenly turns ill? Will they be able to save him in time?—AtreyuNukus"
  ],
  "synopsis": "Genevieve is one of twelve princesses who share a passion for dancing and live in a castle with their widowed father, King Randolph. Unbeknownst to the princesses, other people consider them improper for having unique but unladylike hobbies and interests. King Randolph summons his cousin, Duchess Rowena, to help educate them into proper ladies. However, the Duchess wants the throne and removes all color, music, and joy from the palace, trying to break the girls' spirits.On their youngest sisters' birthday, the other sisters gift a copy of their late mother's favorite story, wherein a princess discovers a magical land and dances there for three nights before it vanishes. Looking at the story and the tiles on their bedroom floor, Genevieve discovers how to open a portal into the magical land. Upon entering, they dance the night away. They learn the hanging golden flowers grant wishes, the statues can come to life, and the water has healing properties.The next day, the princesses appear tired and Rowena finds their new dancing shoes worn out, arousing her suspicions. King Randolph falls ill, so Genevieve asks the royal cobbler, Derek, to investigate Rowena's true intentions. That night, the princesses return to the magical land; Derek confronts a local apothecary and deduces that Rowena has been poisoning the King.The next morning, the sisters are again exhausted. Rowena, refusing to believe the sisters when they tell her the truth, forces them into servitude. After overhearing Rowena maneuver the King into referring to his daughters as burdens, the heartbroken princesses return to the magical land for a third time, and Rowena finds them missing the next morning.After learning that the princesses are missing, Derek figures out how to open the portal and makes his way into the magical land. Rowena's pet monkey, Brutus, spies on Derek and leads Rowena through after him; she steals one of the wish-granting flowers. The princesses decide to go home and help their father; however, Rowena returns to the palace ahead of them and has her henchman, Desmond, destroy the portal. Derek and Genevieve figure out how to activate another portal by dancing together, freeing the group.Once home, they find out that the King is dying and that Rowena has taken over as Queen. The Duchess uses the golden flower to wish for Genevieve to dance forever without rest, but Genevieve blows the magic dust back at her with a hand fan, forcing Rowena to dance uncontrollably. When Desmond tries to help Rowena, he is pulled into the spell, and the two dance their way out of the castle. Lacey uses the healing water she took from the magic land to revive her father. King Randolph affirms his unconditional love for his daughters and Genevieve and Derek celebrate their wedding."
}