{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/j5VUdrnRBya3KE40t0ucAN2YqDs.jpg",
  "id": 1607,
  "title": "A Bronx Tale",
  "poster_path": "https://image.tmdb.org/t/p/w500/sDbO6LmLYtyqAoFTPpRcMgPSCEO.jpg",
  "release_date": "1993-10-01",
  "vote_average": 7.858,
  "vote_count": 2244,
  "popularity": 39.306,
  "overview": "Set in the Bronx during the tumultuous 1960s, an adolescent boy is torn between his honest, working-class father and a violent yet charismatic crime boss. Complicating matters is the youngster's growing attraction - forbidden in his neighborhood - for a beautiful black girl.",
  "imdb_id": "tt0106489",
  "budget": 10000000,
  "homepage": "",
  "revenue": 17287898,
  "runtime": 121,
  "genres": [
    "Drama",
    "Crime"
  ],
  "summaries": [
    "Robert De Niro and Chazz Palminteri give captivating performances in this intense drama about a boy torn between his tough, hard-working father and a violent yet charismatic crime boss.",
    "The Bronx, New York, 1960. 9-year-old Calogero grows up admiring and fascinated by the local mob boss, Sonny. Calogero's father, Lorenzo, wants to have nothing to do with the mob and does his best to keep his son away from Sonny and mob business. However, it may prove a losing battle.—grantss",
    "After witnessing a murder in front of his house, nine-year-old Calogero forms a strong and lasting bond with the Bronx' local gangster Sonny, in spite of his father, Lorenzo's, disapproval. A Bronx Tale delivers a closer inspection of father/son relations, life choices and their consequences.—BecksyKane",
    "Set in the Bronx during the tumultuous 1960s, an adolescent boy is torn between his honest, working-class father and a violent yet charismatic crime boss. Complicating matters is the youngster's growing attraction forbidden in his neighborhood for a beautiful black girl.—yusufpiskin",
    "Gangster Sonny is the big man in the Bronx neighborhood of an Italian small boy named Calogero. A shooting witnessed by the boy (nicknamed C) is the starting point of a lasting bond between the gangster and the boy. Father (bus driver Lorenzo), however, disapproves. C grows up under the wing of both men, torn between his own natural honesty and his fascination with Sonny. C's neighborhood cronies get involved in theft, use of guns, and racial fights. When C falls for an African American girl, things don't get any easier. C's leap to manhood is marked by tragedy, but also by his recognition of the many faces of love.—Horacio Abeledo <horabe@ipcabe.uba.ar>"
  ],
  "synopsis": "This first appeared on www.realmoviereview.com\nRobert De Niro debuts as director in this feature and he does a fine job with obvious Scorsese influence. This is an excellent small-scale movie with a good story and well-developed characters, some excellent performances, along with subtle directorial flair.\nIn a lot of ways, this resembles a softer, gentler Goodfellas. The story revolves around Calogero Anello, (Lillo Brancato), a seventeen year old Italian growing up in a 1960s Bronx neighborhood. Calogero is befriended by the local mob boss (Palminteri) over the objections of his father (De Niro). And this movie tells the story of his coming of age in this environment. Francis Capra does a fine job as the nine year-old Calogero, and Palminteri and De Niro show excellence at their craft. Brancato does a respectable job, but suffers from comparison.\nThis is a personal favorite of mine and I recommend it whole-heartedly. There are some wonderful scenes, strong dialogue and enough action to balance out the story and make this enjoyable by all kinds of viewers."
}