{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/90ez6ArvpO8bvpyIngBuwXOqJm5.jpg",
  "id": 19404,
  "title": "Dilwale Dulhania Le Jayenge",
  "poster_path": "https://image.tmdb.org/t/p/w500/lfRkUr7DYdHldAqi3PwdQGBRBPM.jpg",
  "release_date": "1995-10-20",
  "vote_average": 8.5,
  "popularity": 36.854,
  "overview": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga.",
  "imdb_id": "tt0112870",
  "budget": 13200000,
  "homepage": "",
  "revenue": 100000000,
  "runtime": 190,
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "summaries": [
    "When Raj meets Simran in Europe, it isn't love at first sight but when Simran moves to India for an arranged marriage, love makes its presence felt.",
    "When Raj (Shah Rukh Khan) and Simran (Kajol) first met on an inter-rail holiday in Europe, it wasn't exactly love at first sight but when Simran is taken back to India for an arranged marriage, things change. Encouraged by his father Dharamvir (Anupam Kher), Raj decides to fly down from London to not just win his bride but her whole family and the blessings of her father Baldev Singh (Amrish Puri).—Official Source",
    "Of Indian-origin Chaudhry Baldev Singh is settled in London, England with his family consisting of his wife Lajwanti 'Lajjo' and daughters, Rajeshwari alias 'Chukti' and her big sister Simran. When Simran was much younger Baldev had set her marriage with his childhood friend's son Ajit back in India; but when Simran goes on a trip to Europe she meets Raj Malhotra and both fall in love. When she confides to her dad he is enraged about this and immediately takes Simran to India--where she must undergo preparations for her marriage to Ajit.—gavin (racktoo@hotmail.com)",
    "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiance'. Raj leaves for India with a mission at his hands, to claim his lady-love under the noses of her whole family. Thus begins a saga.",
    "Baldev Singh Chaudhary, an NRI living in London with his family, is a man of principles and a strict father. His daughter Simran asks to go on a European tour with her friends, and he allows it. Simran is about to miss her train but she is helped to board it by Raj, who is also on the Europe tour with his friends. Raj flirts with Simran a lot during their tour, following which she gets irritated with him. Raj and Simran get separated from their friends after they miss a train and end up spending time together during which they fall in love. After returning home Simran tells her mother about Raj but angered Baldev decides to go back to India and marry her to Kuljeet, son of his friend Ajit Singh. Raj to follows them to India and promises Simran that he will soon marry her. Raj befriends Kuljeet and enters their house trying to win hearts of everyone including Baldev Chaudhary.—alex.mjacko@gmail.com"
  ],
  "synopsis": "Raj Malhotra (Shah Rukh Khan) and Simran Singh (Kajol) are both non-resident Indians (NRI) living in London. Simran is raised by her parents, Baldev Singh (Amrish Puri) and Lajwanti (Farida Jalal). Baldev Singh is a strict and conservative father. Baldev lives in London for 22 yrs, but he still loves and yearns for India. Chutki (Pooja Ruparel) is Simran's younger sister.\nBaldev runs a 22/7 convenience store in London. Raj's friend is Pochy (Karan Johar)while Raj is raised by his father Dharamvir Malhotra (Anupam Kher), who is very liberal. Raj has just failed college and his dad pops the champagne as failing is a family tradition. Dharamvir wants Raj to join the office, but Raj wants a month off to go around Europe.\nSimran always dreams of meeting her ideal man; her mother Lajjo warns her against this, saying dreams are good, but one should not blindly believe they come true. One day, Baldev receives a letter from his friend Ajit (Satish Shah), who lives in Punjab, India. Ajit wants to keep the promise he and Baldev made to each other 20 years ago-to have Simran marry his son Kuljeet (Parmeet Sethi). Simran is disappointed, as she does not want to marry someone whom she has never met.One evening, Raj enters Baldev's shop after closing time to buy beer. Baldev refuses, but Raj grabs a case of beer, throws money on the counter, and runs away. An infuriated Baldev calls Raj a disgrace to India. Meanwhile, Raj's father agrees to his request to go on a train trip across Europe with his friends, and Simran's friends have invited her to go on the same trip. Simran asks her father to let her see the world before her marriage, and he reluctantly agrees (\"Ja, Jee Le Apni Zindagi\").On the trip, Raj and Simran meet. Raj constantly flirts with Simran, much to her irritation. The two miss their train to Zürich (Raj was buying a knife at the railway show while Simran was waiting for him to pay, so she could buy a cowbell) and are separated from their friends. Simran refuses to travel with Raj, especially after he tears her dress. Simran tries to hitch a ride, but the police want to see her passport. Raj is driving by in a rented car and rescues Simran by saying that she is his wife. They start to travel together, and the train from Zurich leaves at 11 30 am the next day. But the car stops working midway. They have to spend the night in a barn, and it starts snowing. Raj gives some brandy to Simran to help her survive the night, but she gets drunk. Raj then plays a prank on her pretending that they slept together.. When Simran starts crying, Raj convinces her that as an Indian he knows what an Indian girls honor means to her.. they become good friends.Raj falls in love with Simran on the journey. when they part ways in London, Simran realizes she is in love with him as well. At home, Simran tells her mother about the boy she met on her trip; Baldev overhears the conversation and becomes enraged with his daughter. He says the family will move to India the next day.\nMeanwhile, Raj tells his father about Simran and that she will soon get married. When Raj says he believes Simran loves him too, his father encourages him to go after her. Raj goes to her house to woo her and her father, but is informed by their neighbor that they have sold their house and moved to India.In India, Baldev is reunited with his relatives and his friend, Ajit. A miserable Simran and her younger sister Chutki take an instant dislike to Simran's fiance Kuljeet because of his arrogance. Simran pines for Raj, but her mother tells her to forget him because she knows Baldev will never accept their relationship. Preeti (Mandira Bedi) is Kuljeet's sister.\nThe next morning, Raj arrives outside of the house where Simran is staying and the two reunite. She begs him to elope with her, but Raj refuses and says he will only marry her with her father's consent.Raj befriends Kuljeet (Kuljeet was out hunting, when Raj snares him in a trap and then helps him escape. Then Raj says that he is from London and has come to acquire land for a factory with a budget of 10 MM pounds.. Kuljeet sees profits for himself and invites Raj to stay at his own house) and is quickly accepted by both families (Baldev recognizes Raj, but lets it go since he saved Kuljeet's life) (His charming ways win over all the ladies in the house, including Chutki and Lajwanti. He helps around the house and sweet talks Lajwanti.. But Preeti starts falling in love with Raj). Raj tries hard to impress Baldev. He gets up early in the morning to feed the pigeons with him and also helps him win at chess..\nAjit asks Raj if he will marry Preeti. Raj Says he would have to consult his dad. But Dharamvir just landed in Punjab the same morning. Dharamvir misunderstands and thinks Ajit is Simran's dad and readily agrees to the marriage.. He later understands the mess he made..Later, his father arrives in India and also becomes friends with Simran's and Kuljeet's families. Eventually, Lajjo (She saw them feeding each other after the fasting done for the well being of husbands) and Chutki discover that Raj is the boy Simran fell in love with in Europe. Lajjo also tells Raj and Simran to run away, but he still refuses.\nBaldev recognizes Raj from the beer incident but eventually accepts him. However, after he discovers a photograph of Raj and Simran together in Europe, he slaps and humiliates Raj and tells him to leave. Simran begs Raj to take her away, but Raj still refuses. He says Baldev is right, and agrees to leave.As Raj and his father wait at the railway station, Kuljeet, who is angry to learn of Raj's love for Simran, arrives with his friends and attack them. Eventually, Baldev and Ajit arrive and stop the fight, and Raj boards the departing train with his father.\nSimran then arrives with her mother and sister; she tries to join Raj on the train, but Baldev stops her. Simran begs him to let her go, saying she cannot live without Raj. Baldev, realizing nobody loves his daughter more than Raj does, lets her go, and she runs and catches the train as it departs."
}