{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/86l1gqKjhPn6Ypd8XSSIGx7ZikB.jpg",
  "id": 242828,
  "title": "When Marnie Was There",
  "poster_path": "https://image.tmdb.org/t/p/w500/at7lShVfMdohEzC1VZYTZXY0hzP.jpg",
  "release_date": "2014-07-19",
  "vote_average": 7.934,
  "vote_count": 1665,
  "popularity": 24.298,
  "overview": "Upon being sent to live with relatives in the countryside due to an illness, an emotionally distant adolescent girl becomes obsessed with an abandoned mansion and infatuated with a girl who lives there - a girl who may or may not be real.",
  "imdb_id": "tt3398268",
  "budget": 0,
  "homepage": "https://www.uphe.com/movies/when-marnie-was-there",
  "revenue": 34949567,
  "runtime": 103,
  "genres": [
    "Animation",
    "Drama"
  ],
  "summaries": [
    "Anna, a shy 12-year-old girl, is sent to spend time with her aunt and uncle who live in the countryside, where she meets Marnie. The two become best friends. But Anna gradually discovers that Marnie is not quite who she appears to be.",
    "A 12-year-old girl is sent to the country for health reasons, where she meets an unlikely friend in the form of Marnie, a young girl with long, flowing blonde hair. As the friendship unravels, it is possible that Marnie has closer ties to the protagonist than we might expect.—David On",
    "Twelve-year-old Anna believes she sits outside the invisible magic circle to which most people belong, and shuts herself off from everyone around her. Concerned for her health, Anna's foster mother decides to send her to rural Hokkaido to stay in a sleepy town by the sea. There she meets Marnie, an energetic young girl who seems to appear from nowhere. The pair quickly become inseparable.",
    "Anna, a creative 12-year-old misfit feeling isolated from everyone around her, leaves Sapporo to spend summer break with her mother's relatives in the rural seaside town of Kissakibetsu. There, the ailing, socially awkward schoolgirl stumbles upon the deserted Marsh House across the shore, where Anna spots Marnie, an enigmatic blonde girl longing for companionship and friendship. Little by little, a mysteriously profound bond between the two young ladies forms, blurring the delicate boundaries of reality and fantasy. But Anna must know. Who is the Girl in the Blue Window, the old mansion's cryptic, eerily charming inhabitant?—Nick Riganas"
  ],
  "synopsis": ""
}