{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/6C1U0cKK5zGjyUSwNc5GLSVCr7Y.jpg",
  "id": 25237,
  "title": "Come and See",
  "poster_path": "https://image.tmdb.org/t/p/w500/qNbMsKVzigERgJUbwf8pKyZogpb.jpg",
  "release_date": "1985-10-17",
  "vote_average": 8.287,
  "popularity": 23.427,
  "overview": "The invasion of a village in Byelorussia by German forces sends young Florya into the forest to join the weary Resistance fighters, against his family's wishes. There he meets a girl, Glasha, who accompanies him back to his village. On returning home, Florya finds his family and fellow peasants massacred. His continued survival amidst the brutal debris of war becomes increasingly nightmarish, a battle between despair and hope.",
  "imdb_id": "tt0091251",
  "budget": 0,
  "homepage": "",
  "revenue": 168817,
  "runtime": 142,
  "genres": [
    "Drama",
    "War"
  ],
  "summaries": [
    "After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
    "The feature film directed by Elem Klimov, shot in the genre of military drama. The action takes place on the territory of Belarus in 1943. In the center of the story is a Belarusian boy, who witnesses the horrors of the Nazi punitive action, turning from a cheerful teenager into a gray-haired old man for two days.—Peter-Patrick76 (peter-patrick@mail.com)",
    "Belarus, 1943. More than anything, young Flyora, the only son of an impoverished peasant family, wants to take up arms and do his part in defending the homeland from the invading Nazis. However, there's nothing romantic about World War II. Indeed, by the time the inexperienced teenager joined a local unit of battle-tested partisans, the all-out German invasion of Belarus had already begun. Now, unspeakable horrors lie hidden in the fog of war, crushing Flyora's juvenile oblivion. And as the unsettling, irrefutable evidence of war disfigures Flyora's once-rosy, youthful face, the urgent plea for peace becomes timeless.—Nick Riganas",
    "During WWII, a Belarusian boy is thrust into the atrocities of war, fighting with a hopelessly unequipped Soviet resistance movement against ruthless German forces. Witnessing scenes of abject terror and surviving horrifying situations, he loses his innocence and then his mind.—TheDistantPanic"
  ],
  "synopsis": ""
}