{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/wOfzdzC0QZyhUIlyjeMuUYSb8Ax.jpg",
  "id": 289,
  "title": "Casablanca",
  "poster_path": "https://image.tmdb.org/t/p/w500/5K7cOHoay2mZusSLezBOY0Qxh8a.jpg",
  "release_date": "1943-01-15",
  "vote_average": 8.2,
  "popularity": 34.38,
  "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
  "imdb_id": "tt0034583",
  "budget": 878000,
  "homepage": "",
  "revenue": 10462500,
  "runtime": 102,
  "genres": [
    "Drama",
    "Romance"
  ],
  "summaries": [
    "A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in French Morocco.",
    "The story of Rick Blaine, a cynical world-weary ex-patriate who runs a nightclub in Casablanca, Morocco during the early stages of WWII. Despite the pressure he constantly receives from the local authorities, Rick's cafe has become a kind of haven for refugees seeking to obtain illicit letters that will help them escape to America. But when Ilsa, a former lover of Rick's, and her husband, show up to his cafe one day, Rick faces a tough challenge which will bring up unforeseen complications, heartbreak and ultimately an excruciating decision to make.—Kyle Perez",
    "In World War II Casablanca, Rick Blaine, exiled American and former freedom fighter, runs the most popular nightspot in town. The cynical lone wolf Blaine comes into the possession of two valuable letters of transit. When Nazi Major Strasser arrives in Casablanca, the sycophantic police Captain Renault does what he can to please him, including detaining a Czechoslovak underground leader Victor Laszlo. Much to Rick's surprise, Lazslo arrives with Ilsa, Rick's one time love. Rick is very bitter towards Ilsa, who ran out on him in Paris, but when he learns she had good reason to, they plan to run off together again using the letters of transit. Well, that was their original plan....—Gary Jackson <garyjack5@cogeco.ca>",
    "During World War II, Europeans who were fleeing from the Germans, sought refuge in America. But to get there they would first have to go Casablanca and once they get there, they have to obtain exit visas which are not very easy to come by. Now the hottest spot in all of Casablanca is Rick's Cafe which is operated by Rick Blaine, an American expatriate, who for some reason can't return there, and he is also extremely cynical. Now it seems that two German couriers were killed and the documents they were carrying were taken. Now one of Rick's regulars, Ugarte entrusts to him some letters of transit, which he intends to sell but before he does he is arrested for killing the couriers. Captain Renault, the Chief of Police, who is neutral in his political views, informs Rick that Victor Laszlo, a resistance leader from Czechoslovakia, is in Casablanca and will do anything to get an exit visa but Renault has been \"told\" by Major Strasser of the Gestapo, to keep Laszlo in Casablanca. Laszlo goes to Rick's to meet Ugarte, because he was the one Ugarte was going to sell the letters to. But since Ugarte was arrested he has to find another way. Accompanying him is Ilsa Lund, who knew Rick when he was in Paris, and when they meet some of Rick's old wounds reopen. It is obvious that Rick's stone heart was because of her leaving him. And when they learn that Rick has the letters, he refuses to give them to him, because \"he doesn't stick his neck out for anyone\".—rcs0411@yahoo.com",
    "Rick Blaine, who owns a nightclub in Casablanca, Morocco, discovers his old flame Ilsa is in town with her husband, Victor Laszlo. Laszlo is a resistance leader from Czechoslovakia, and with Germans on his tail, Ilsa knows Rick can help them get out of the country - but will he?—Anonymous"
  ],
  "synopsis": "Rick Blaine (Humphrey Bogart) is a cynical American expatriate living in Casablanca in early December 1941. His upscale nightclub and gambling den, \"Rick's Cafe American\", attracts a mixed clientele: Vichy French, Italian, and Nazi officials; refugees desperately seeking to reach the United States, as yet not involved in the war; and those who prey on them. Although Rick professes to be neutral in all matters, it is later revealed he ran guns to Ethiopia to combat the 1935 Italian invasion and fought on the Loyalist side in the Spanish Civil War.Black-and-white film screenshot of several people in a nightclub. A man on the far left is wearing a suit and has a woman standing next to him wearing a hat and dress. A man at the center, wearing a military uniform and hat, is looking at the man on the left. A man on the far right is wearing a suit and looking to the other people.Petty crook Signor Ugarte (Peter Lorre) shows up and boasts to Rick of \"letters of transit\" he obtained through the murder of two German couriers. The papers allow the bearer to travel freely around German-controlled Europe and to neutral Portugal. The letters are almost priceless to the continual stream of refugees who end up stranded in Casablanca. Ugarte plans to sell them to the highest bidder at the club later that night. Before the exchange can take place, however, Ugarte is arrested by the local police under the command of Vichy Captain Louis Renault (Claude Rains), a self-confessed corrupt official. Ugarte dies in custody without revealing that he had entrusted the letters to Rick.At this point, the reason for Rick's bitterness re-enters his life. His ex-lover, Norwegian Ilsa Lund (Ingrid Bergman), walks into his establishment. Upon spotting Rick's friend and house pianist, Sam (Dooley Wilson), Ilsa asks him to play \"As Time Goes By\". When Rick storms over, furious that Sam has disobeyed his order never to perform that song, he is shocked to see Ilsa. She is accompanied by her husband, Victor Laszlo (Paul Henreid), a renowned fugitive Czech Resistance leader who has escaped from a Nazi concentration camp. They need the letters to leave for America, where he can continue his work. German Major Strasser (Conrad Veidt) arrives in Casablanca to see to it that Laszlo does not succeed.When Laszlo makes inquiries, Signor Ferrari (Sydney Greenstreet), a major underworld figure and Rick's friendly business rival, divulges his suspicion that Rick has the letters. In a private meeting, Rick refuses to sell at any price, telling Laszlo to ask his wife for the reason. They are interrupted when Strasser leads a group of officers in singing \"Die Wacht am Rhein\". Laszlo orders the house band to play \"La Marseillaise\". When the band looks to Rick for guidance, he nods his head. Laszlo starts singing, alone at first, then patriotic fervor grips the crowd, and everyone joins in, drowning out the Germans. In retaliation, Strasser has Renault close the club.That night, Ilsa confronts Rick in the deserted cafe. When he refuses to give her the letters, she threatens him with a gun, but then confesses that she still loves him. She explains that when they first met and fell in love in Paris, she believed that her husband had been killed attempting to escape from the concentration camp. Later, while preparing to flee with Rick from the imminent fall of the city to the German army, she learned that Laszlo was in fact alive and in hiding. She left Rick without explanation to tend to her ill husband.With the revelation, the lovers are reconciled. Rick agrees to help, leading her to believe that she will stay behind with him when Laszlo leaves. When Laszlo unexpectedly shows up, having narrowly escaped a police raid on a Resistance meeting, Rick has waiter Carl (S. K. Sakall) spirit Ilsa away.Laszlo reveals he is aware of Rick's love for Ilsa and tries to persuade him to use the letters to take her to safety. When the police arrest Laszlo on a minor, trumped-up charge, Rick convinces Renault to release him by promising to set him up for a much more serious crime: possession of the letters of transit. To allay Renault's suspicions, Rick explains he and Ilsa will be leaving for America.When Renault tries to arrest Laszlo as arranged, Rick forces him at gunpoint to assist in their escape. At the last moment, Rick makes Ilsa board the plane to Lisbon with her husband, telling her she would regret it if she stayed, \"Maybe not today, maybe not tomorrow, but soon and for the rest of your life.\"\nMajor Strasser, tipped off by Renault, drives up alone. Rick shoots Strasser when he tries to intervene. When his men arrive, Renault pauses, then tells them to \"round up the usual suspects.\" Once they are alone, Renault suggests to Rick that they join the Free French at Brazzaville as they walk away into the fog."
}