{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/uG1v9Hk1XKICd6IJChRR20mBh8i.jpg",
  "id": 431693,
  "title": "Spies in Disguise",
  "poster_path": "https://image.tmdb.org/t/p/w500/30YacPAcxpNemhhwX0PVUl9pVA3.jpg",
  "release_date": "2019-12-04",
  "vote_average": 7.614,
  "vote_count": 2636,
  "popularity": 31.566,
  "overview": "Super spy Lance Sterling and scientist Walter Beckett are almost exact opposites. Lance is smooth, suave and debonair. Walter is… not. But what Walter lacks in social skills he makes up for in smarts and invention, creating the awesome gadgets Lance uses on his epic missions. But when events take an unexpected turn, Walter and Lance suddenly have to rely on each other in a whole new way.",
  "imdb_id": "tt5814534",
  "budget": 100000000,
  "homepage": "https://family.foxmovies.com/movies/spies-in-disguise",
  "revenue": 171616764,
  "runtime": 102,
  "genres": [
    "Animation",
    "Action",
    "Adventure",
    "Comedy",
    "Family"
  ],
  "summaries": [
    "When the world's best spy is turned into a pigeon, he must rely on his nerdy tech officer to save the world.",
    "Super spy Lance Sterling and scientist Walter Beckett are almost exact opposites. Lance is smooth, suave and debonair. Walter is not. But what Walter lacks in social skills he makes up for in smarts and invention, creating the awesome gadgets Lance uses on his epic missions. But when events take an unexpected turn, Walter and Lance suddenly have to rely on each other in a whole new way. And if this odd couple can't learn to work as a team, the whole world is in peril.—krmanirethnam"
  ],
  "synopsis": "Lance Sterling (Will Smith), a cocky secret agent of H.T.U.V. (Honor, Trust, Unity and Valor), is sent to recover an attack drone from Japanese arms dealer Katsu Kimura (Masi Oka) in Japan. As soon as the buyer, Cybernetically enhanced terrorist Killian (Ben Mendelsohn) (a powerful technology-based terrorist mastermind with a left bionic arm which controls an array of weapons armed drones stolen from HTUV that threatens the world), arrives, Sterling breaks in against the orders of H.T.U.V. director Joy Jenkins (Reba McEntire), defeats Kimura and his gang, and manages to escape with the briefcase containing the drone.Sterling returns to H.T.U.V. headquarters to confront Walter Beckett (Tom Holland), a socially inept MIT graduate and outcast young scientist (scientific genius who graduated from MIT at age 15 and designs gadgets), for equipping nonlethal weapons into his suit. Walter tries to convince Sterling that there is a more peaceful way to save the world (Walter suggests to Sterling that he can make agents \"disappear\"), but Sterling fires him before he can explain his latest invention: \"biodynamic concealment\".Sterling discovers the briefcase to be empty and is confronted by Marcy Kappel (Rashida Jones), a security forces agent, who reveals footage of Sterling (actually Killian in a holographic disguise) leaving with the drone, labeling him as a traitor. Sterling escapes the H.T.U.V. and decides to track down Walter to help him disappear. Meanwhile, Killian breaks into the H.T.U.V. weapons facility.While searching Walter's home for his invention, Sterling unknowingly ingests the concoction and transforms into a pigeon. Before Walter can start making an antidote to change him back, Marcy and other H.T.U.V. agents chase the duo through the city, but they escape in Sterling's spy car. The two track down Kimura to a resort in Playa Del Carmen, Mexico. There, they learn of Killian's whereabouts in Venice, Italy before Marcy and the H.T.U.V. can capture them again. On their way to Venice, Walter attempts to make the antidote, but fails.Arriving in Venice, Walter is confronted by the H.T.U.V., who are unaware of Sterling's condition. Revealing that she knows about Wendy (Rachel Brosnahan), Walter's mother who was a police officer who died on duty, Marcy tries to convince him to help turn Sterling in, but Walter refuses. Suddenly, a drone distracts the H.T.U.V. and allows Walter and Sterling to escape. The two discover the drone carrying the H.T.U.V. agent database, and Walter manages to retrieve it. However, Killian shows up, takes the database, and prepares to kill Walter. With help from hundreds of pigeons in the surrounding area, they distract Killian and flee. Disguised as Sterling once more, Killian escapes the H.T.U.V., shaking Marcy's suspicions of Sterling upon her seeing him with a robot hand.Whilst underwater in a submarine, Walter reveals he planted a tracking device on Killian and locates him at the weapons facility. Walter manages to perfect the antidote and successfully turns Sterling human again. Reaching Killian's hideout, Sterling is concerned about Walter's safety and sends him away in the submarine. Once inside, Sterling confronts Killian, but is defeated and captured as Killian reveals he has mass produced hundreds of drones to target everyone at the agency using the database as revenge for killing his crew in a past mission led by Sterling. Noticing Walter returning in the submarine, Killian destroys it; unbeknownst to them, Walter survives with the help of one of his inventions, the inflatable hug.Once Walter frees Sterling, the two escape and contact Marcy for support as the drones approach H.T.U.V. headquarters in Washington D.C. Walter attempts to hack into Killian's bionic arm. When Killian realizes this, he tries to flee via air with a drone, but Walter catches up. Walter risks his life by trapping Killian in one of his protective gadgets and deactivates the villain's arm as Walter himself falls, but Sterling, who has turned himself back into a pigeon, successfully flies for the first time and carries him to safety with help from other pigeons, while Killian is found and arrested.Despite saving the world, Sterling, back in his human form (except for his right hand, which is temporarily remaining tiny), and Walter are fired for disobedience. However, they are quickly reinstated by the H.T.U.V. as the agency could learn from Walter's more peaceful ways of handling villainy."
}