{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/prVH6SyQ6yDmzVxxkcr57zhLM5C.jpg",
  "id": 433,
  "title": "Mary Poppins",
  "poster_path": "https://image.tmdb.org/t/p/w500/ei8hhYCMfURfPOXKBnyl61be2iV.jpg",
  "release_date": "1964-12-17",
  "vote_average": 7.6,
  "vote_count": 4436,
  "popularity": 31.984,
  "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
  "imdb_id": "tt0058331",
  "budget": 4650000,
  "homepage": "https://movies.disney.com/mary-poppins",
  "revenue": 103100000,
  "runtime": 139,
  "genres": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "summaries": [
    "In turn of the century London, a magical nanny employs music and adventure to help two neglected children become closer to their father.",
    "When Jane and Michael Banks are faced with the prospect of a new nanny, they are pleasantly surprised by the arrival of the magical Mary Poppins. Embarking on a series of fantastical adventures with her and her Cockney performer friend, Bert, they try to pass on some of her sunny attitude to their preoccupied parents.—Jwelch5742",
    "In Edwardian London, yet another nanny resigns from keeping an eye on George Banks' boisterous children, Jane and Michael. But then, as if by magic, a new one, the enchanting Mary Poppins, lands on their doorstep to take control of the situation as thrilling adventures along with her Cockney performer friend, Bert, pave the way for a wonderful transformation. Will she turn chaos into order?—Nick Riganas",
    "This movie combines songs, color, and sequences of live action blended with the movements of animated figures. Mary Poppins is a kind of a super nanny who flies in with her umbrella in response to the request of Jane and Michael Banks and proceeds to put things right with the aid of her rather extraordinary magical powers.—alfiehitchie"
  ],
  "synopsis": "Spoiled and bored upper crust Edwardian English family has their world turned upside down by an all nonsensical nanny who teaches them how to enjoy life. This movie is a musical and has both comedy and pathos and lots of imaginative scenes that are wonderful for adults and children alike. You'll be singing along in no time...\"in the most delightful way!\""
}