{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/bblKpucB0XbyQBmfXsaRN985Rgh.jpg",
  "id": 458220,
  "title": "Palmer",
  "poster_path": "https://image.tmdb.org/t/p/w500/xSDdRAjxKAGi8fUBLOqSrBhJmF0.jpg",
  "release_date": "2021-01-28",
  "vote_average": 8.159,
  "popularity": 33.992,
  "overview": "After 12 years in prison, former high school football star Eddie Palmer returns home to put his life back together—and forms an unlikely bond with Sam, an outcast boy from a troubled home. But Eddie's past threatens to ruin his new life and family.",
  "imdb_id": "tt6857376",
  "budget": 0,
  "homepage": "https://tv.apple.com/movie/palmer/umc.cmc.40qrv09i2yfh8iilyi4s8vfi",
  "revenue": 0,
  "runtime": 110,
  "genres": [
    "Drama"
  ],
  "summaries": [
    "An ex-convict strikes up a friendship with a boy from a troubled home.",
    "Eddie Palmer, (Justin Timberlake) recently released from prison after serving 12 years for attempted murder, moves in with his Grandmother and forms an unlikely bond with a young child named Sam, (Ryder Allen) who is being bullied for his identity, and also lives with a drug addicted mother and her abusive boyfriend.—Jakoby Kupidlowski",
    "After 12 years in prison, former high school football star Eddie Palmer returns home to put his life back together and forms an unlikely bond with Sam, an outcast boy from a troubled home. But Eddie's past threatens to ruin his new life and family.—yusufpiskin",
    "Eddie Palmer is a former high school football star and ex-felon who just got out of prison after 12 years. He lives with his grandmother Vivian, who also occasionally watches over a flamboyant young boy named Sam. Palmer eventually begins working at the local school as a janitor. After Vivian passes away, he is forced to become Sam's temporary guardian with his mom Shelly constantly leaving town. Although initially not wanting anything to do with him, Palmer soon bonds with Sam and his teacher, Maggie. But is Palmer the right person to take care of Sam?—Frank Liesenborgs"
  ],
  "synopsis": "Eddie Palmer is a former high school football star and ex-felon who just got out of prison after 12 year prison sentence. He lives with his grandmother Vivian, who also occasionally watches over a flamboyant young boy named Sam.Palmer eventually begins working at the local school as a janitor, and after Vivian passes away, is forced to become Sam's temporary guardian with his mom Shelly constantly leaving town. Although initially not wanting anything to do with Sam, Palmer soon bonds with the boy, taking him to the high school football game and bowling fundraiser, striking up a relationship with Sam's teacher, Maggie.One day, Sam comes home crying with makeup garishly smeared on his face. Palmer assumes it was Sam's classmates who did it, but finds out that it was his own friends (led by Daryl) who committed the act. Palmer beats one of them up at a bar. Shelly returns to reclaim Sam, but he is then taken by Child Protective Services. Palmer attempts to receive guardianship but is denied due to his parole status. The courts temporarily return Sam to Shelly but Palmer witnesses her abusive boyfriend physically abusing them both. Palmer intervenes, sees that both are using drugs in front of Sam, and flees with the boy.Shelly calls the police and Palmer is accused of kidnapping. He brings the boy back and is arrested, with Sam crying that he wants to be with Palmer instead of his own mother. Seeing this, Shelly refuses to press charges and chooses to give Palmer parental custody of Sam."
}