{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/1X7vow16X7CnCoexXh4H4F2yDJv.jpg",
  "id": 466420,
  "title": "Killers of the Flower Moon",
  "poster_path": "https://image.tmdb.org/t/p/w500/dB6Krk806zeqd0YNp2ngQ9zXteH.jpg",
  "release_date": "2023-10-18",
  "vote_average": 7.525,
  "vote_count": 2039,
  "popularity": 452.285,
  "overview": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
  "imdb_id": "tt5537002",
  "budget": 200000000,
  "homepage": "https://www.paramountmovies.com/movies/killers-of-the-flower-moon",
  "revenue": 156300000,
  "runtime": 206,
  "genres": [
    "Crime",
    "History",
    "Drama"
  ],
  "summaries": [
    "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one - until the FBI steps in to unravel the mystery.",
    "The story takes place in the 1920s around the Osage Indian tribe living in Oklahoma. Native Americans are being killed one by one after the tribe becomes rich by discovering oil. The Osage massacre attracts the attention of the FBI, which begins an investigation.—Tango Papa",
    "1919, Osage County, Oklahoma. Due to the discovery of oil on their land the Osage people are per capita the wealthiest people in the United States. Having just been discharged from the US Army, Ernest Burkhart returns to the area to work for his wealthy uncle, William Hale. Lately many Osage people have died in suspicious circumstances but nothing is being done about it.—grantss"
  ],
  "synopsis": "Osage Nation elders bury a ceremonial pipe, mourning their descendants' assimilation into white American society. Wandering through their Oklahoma reservation, which features the annual \"flower moon\" phenomenon of fields of blooms,[19] several Osage find oil gushing from the ground. The tribe becomes wealthy, as it retains mineral rights and members share in oil-lease revenues, though law requires white court-appointed legal guardians to manage the money of full and half-blood members, assuming them \"incompetent\".In 1919, Ernest Burkhart returns from World War I to live with his brother Byron and uncle William King Hale on Hale's large reservation ranch. Hale, a reserve deputy sheriff/cattle rancher popularly called \"King\", poses as a friendly benefactor of the Osage, speaking their language and bestowing gifts. He suggests that Ernest court Mollie Kyle, an Osage whose family owns oil headrights. Ernest, who alongside Byron has been committing armed robbery against the Osage, meets Mollie via his day job as a cab driver. A romance develops, and the two marry in a ceremony mixing Catholic and Osage elements. Over time, they raise three children.Hale secretly plans the deaths of several wealthy Osage. He tells Ernest he will inherit more headrights if more of Mollie's family dies. Mollie is diabetic, and her mother Lizzie is ill. After Mollie's sister Minnie dies of a mysterious illness, Hale orders Byron to kill Mollie's other sister, the rebellious Anna. Lizzie and the Osage council blame the reservation's white residents and urge the tribe to fight back.A newsreel of the 1921 Tulsa race massacre, in which white people destroyed a black community and killed numerous residents, causes further concern amongst the Osage that they could suffer similarly. Lizzie sees her ancestors welcome her to the afterlife as she dies. Hale has Ernest organize the death of Henry Roan, Mollie's first husband, to collect on his life insurance. However, Ernest botches it, causing Hale to brutally paddle him in a Masonic temple.The local sheriff and judges are corrupt; no investigations are made. An Osage Nation representative seeking to lobby Congress is murdered in Washington, D.C. Mollie hires private detective William J. Burns, but Ernest and Byron beat and chase him away from the reservation.Despite her illness, Mollie travels to Washington with an Osage delegation and asks President Calvin Coolidge for help. Because of this, Hale persuades Ernest to poison Mollie's insulin to \"slow her down\". Mollie's condition worsens, and Ernest sometimes swallows the poison himself from shame. Hale orders Ernest to arrange the murders of Reta, Mollie's last remaining sister, and her husband by having criminal Acie Kirby blow up her house. Mollie inherits all her family's headrights.Due to Mollie's lobbying, the Bureau of Investigation (BOI) sends Agent Thomas Bruce White Sr. and assistants to investigate; they quickly find out the truth. Hale tries to cover his tracks by murdering several of his own men, including Acie, but White arrests Hale and Ernest. The agents find Mollie severely ill and get her proper medical care.White persuades Ernest to confess and turn state's evidence against Hale. W. S. Hamilton, Hale's attorney, tries to convince Ernest to claim he was tortured and recant. However, after one of his and Mollie's daughters dies of whooping cough, Ernest testifies against his uncle. Hale unsuccessfully tries to have Ernest murdered. Mollie meets with Ernest after he testifies, but leaves him when he will not admit to poisoning her.A radio show later reveals the aftermath. Ernest and Hale were convicted and received life sentences. Both were paroled after years of incarceration, despite Osage protests to the parole board. Byron served no prison time due to a hung jury.[c] The Shoun brothers, who gave Ernest the poison for Mollie and were implicated in other \"wasting deaths\", were not prosecuted for lack of evidence. After the trial, Mollie divorced Ernest, remarried, and died of diabetes in 1937 at the age of 50. She was buried with her parents, sisters and daughter. Her obituary did not mention the Osage murders. A 21st century Osage powwow with a large dancing circle is later shown."
}