{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/kZZ9JuZ5CMvH0Y2LwboekvXIHqQ.jpg",
  "id": 49046,
  "title": "All Quiet on the Western Front",
  "poster_path": "https://image.tmdb.org/t/p/w500/2IRjbi9cADuDMKmHdLK7LaqQDKA.jpg",
  "release_date": "2022-10-07",
  "vote_average": 7.74,
  "vote_count": 3390,
  "popularity": 61.754,
  "overview": "Paul Baumer and his friends Albert and Muller, egged on by romantic dreams of heroism, voluntarily enlist in the German army. Full of excitement and patriotic fervour, the boys enthusiastically march into a war they believe in. But once on the Western Front, they discover the soul-destroying horror of World War I.",
  "imdb_id": "tt1016150",
  "budget": 20000000,
  "homepage": "https://www.netflix.com/title/81260280",
  "revenue": 0,
  "runtime": 148,
  "genres": [
    "Drama",
    "War"
  ],
  "summaries": [
    "A young German soldier's terrifying experiences and distress on the western front during World War I.",
    "The story follows teenagers Paul Bäumer and his friends Albert and Müller, who voluntarily enlist in the German army, riding a wave of patriotic fervor that quickly dissipates once they face the brutal realities of life on the front. Paul's preconceptions about the enemy and the rights and wrongs of the conflict soon crumble. However, amid the countdown to armistice, Paul must carry on fighting until the end, with no purpose other than to satisfy the top brass' desire to end the war on a German offensive.",
    "At the start of World War I, Paul Baumer (Thomas) is a young German patriot, eager to fight. Indoctrinated with propaganda at school, he and his friends eagerly sign up for the army soon after graduation. But when the horrors of war soon become too much to bear, and as his friends die or become gravely wounded, Paul questions the sanity of fighting over a few hundreds yards of war-torn countryside.",
    "Germany, 1917. With dreams of serving the Fatherland and Kaiser Wilhelm II, idealistic 17-year-old Paul Bäumer and his chest-thumping schoolmates enlist en masse in the Imperial German Army three years after the outbreak of World War I. And with a mind aflame with patriotic fervour instilled by their jingoistic teacher's rousing speeches, the unripe defenders fantasise about performing heroic feats as they march into battle-scarred Northern France. Instead, the chaos of trench warfare and the horrors of war await the inexperienced brothers-in-arms, who now risk life and limb for the glory of Germany. As the irrefutable certainty of death crushes the companions' romantic visions, Paul must fight tooth and nail to stay alive until the Armistice of 11 November 1918 takes effect and the guns on the Western Front fall silent. After all, war is a game for politicians and generals; for the common soldier, it is a waltz of death on the battlefield.—Nick Riganas",
    "Based on real world history, All Quiet on the Western Front shows the brutal battleground that was World War One; in unrestrained grittiness, desperation and hopelessness through the eyes of the soldiers fighting for Germany and how many of these fighters simply got lost to time.—Johnny-the-Film-Sentinel-2187"
  ],
  "synopsis": "In Spring 1917, three years into the First World War, 17-year-old Paul Bäumer enlists in the Imperial German Army alongside his school friends, Albert Kropp, Franz Müller, and Ludwig Behm. They listen to a patriotic speech by a school official and unknowingly receive uniforms from soldiers killed in a previous battle. After they are deployed in Northern France near La Malmaison, they are befriended by Stanislaus \"Kat\" Katczinsky, an older soldier. Their romantic view of the war is shattered by the realities of trench warfare on the Western Front, and Ludwig is killed by artillery on the first night.On November 7, 1918, German official Matthias Erzberger, weary of mounting losses, meets with German High Command to persuade them to begin armistice talks with the Allied powers. Meanwhile, Paul and Kat steal a goose from a farm to share with Albert, Franz, and another veteran, Tjaden Stackfleet, with whom they have grown close behind the front in Champagne. Kat, who is illiterate, gets Paul to read him a letter from his wife and worries that he cannot reintegrate into peacetime society. Franz spends the night with a French woman and brings back her scarf as a souvenir.On the morning of November 9, General Friedrichs drives Erzberger and the German delegation to a train bound for the Forest of Compiègne to negotiate a ceasefire. Paul and his friends go on a mission to find 60 missing recruits sent to reinforce their unit and discover that they were killed by gas after taking off their masks too soon. Friedrichs, who opposes the talks, orders an attack before French reinforcements arrive. That night, Erzberger's delegation reaches the Forest of Compiègne, and Paul's regiment is sent to the front to prepare to attack the French lines.On the morning of November 10, Ferdinand Foch, the Supreme Allied Commander, gives 72 hours for the Germans to accept the Allied terms, with no room for negotiation. Meanwhile, the German attack takes the French front line after hand-to-hand fighting but is routed by a combined arms counterattack with Saint-Chamond tanks, airplanes, and flamethrowers. Franz is separated from the group, and Albert is killed trying to surrender. Trapped in a crater in no man's land with a French soldier, Paul stabs him and watches him die slowly, becoming remorseful and asking forgiveness to his dead body. Erzberger learns of Kaiser Wilhelm II's abdication and receives instructions in the evening from field marshal Paul von Hindenburg to accept the Allied terms. Paul returns to his unit and sees them celebrating the imminent end of the war. He finds a wounded Tjaden, who gives him Franz's scarf. Paul and Kat bring him food but Tjaden, distraught at being crippled, kills himself.Around 5:00 AM on November 11, Erzberger's delegation signs the armistice set to take effect at 11 AM. After learning of the ceasefire, Paul and Kat steal from the farm one last time, but Kat is shot by the farmer's young son and dies as Paul carries him to the hospital. Friedrichs wants to end the war with a German victory and orders an attack to start at 10:45. A despondent, battle-hardened Paul kills many French soldiers before being speared through the chest by a bayonet seconds before 11:00 when the fighting stops, and the front falls silent. A short time later, a newly arrived German recruit that Paul had saved in the combat finds Paul's mud-caked body and retrieves Franz's scarf that was passed on to Paul from Tjaden."
}