{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/3IkChGhTllTULVWht55UDFHTg6Q.jpg",
  "id": 4977,
  "title": "Paprika",
  "poster_path": "https://image.tmdb.org/t/p/w500/bLUUr474Go1DfeN1HLjE3rnZXBq.jpg",
  "release_date": "2006-10-21",
  "vote_average": 7.803,
  "vote_count": 2180,
  "popularity": 55.722,
  "overview": "When a machine that allows therapists to enter their patient's dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika.",
  "imdb_id": "tt0851578",
  "budget": 0,
  "homepage": "https://www.sonypictures.com/movies/paprika",
  "revenue": 946590,
  "runtime": 90,
  "genres": [
    "Animation",
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "summaries": [
    "When a machine that allows therapists to enter their patients' dreams is stolen, all hell breaks loose. Only a young female therapist, Paprika, can stop it.",
    "Three scientists at the Foundation for Psychiatric Research fail to secure a device they've invented, the D.C. Mini, which allows people to record and watch their dreams. A thief uses the device to enter people's minds, when awake, and distract them with their own dreams and those of others. Chaos ensues. The trio - Chiba, Tokita, and Shima - assisted by a police inspector and by a sprite named Paprika must try to identify the thief as they ward off the thief's attacks on their own psyches. Dreams, reality, and the movies merge, while characters question the limits of science and the wisdom of Big Brother.—<jhailey@hotmail.com>"
  ],
  "synopsis": "In this Japanese anime epic, humanity's last bastion of privacy has finally been infiltrated by technology, the world of our dreams. The story centers on a new invention called the DC-Mini. With this revolutionary device, psychiatrists are now able to enter a patient's dreams in a therapeutic setting. But when an unknown assailant steals all of the devices, using them to enter peoples minds enacting mind control, chaos ensues as dreams begin to bleed into reality, and the thin line between the conscious and the unconscious begins to blur. Enter a young female researcher named Chiba, who takes it upon herself to delve into the newly anarchic dream world in order to set things straight. In this surreal realm her name is Paprika, and she's out to save the world. Bursting with fantastic imagery and breathtakingly innovative animation."
}