{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/ylqOWMU3nyZqg8hjJBG4EPdsGSk.jpg",
  "id": 49797,
  "title": "I Saw the Devil",
  "poster_path": "https://image.tmdb.org/t/p/w500/zp5NrmYp80axIGiEiYPmm1CW6uH.jpg",
  "release_date": "2010-08-12",
  "vote_average": 7.797,
  "vote_count": 2334,
  "popularity": 26.288,
  "overview": "Kyung-chul is a dangerous psychopath who kills for pleasure. Soo-hyeon, a top-secret agent, decides to track down the murderer himself. He promises himself that he will do everything in his power to take vengeance against the killer, even if it means that he must become a monster himself.",
  "imdb_id": "tt1588170",
  "budget": 6000000,
  "homepage": "http://www.isawthedevilmovie.com/",
  "revenue": 12900000,
  "runtime": 144,
  "genres": [
    "Thriller",
    "Horror"
  ],
  "summaries": [
    "A secret agent exacts revenge on a serial killer through a series of captures and releases.",
    "On a dark road, taxi driver Kyung-chul (Min-sik Choi) comes across a scared female motorist stranded in a broken-down vehicle. He pulls over -- but not to help her. When the woman's head is discovered in a local river, her devastated fiancé, Kim Soo-hyeon (Byung-hun Lee), a trained secret agent, becomes obsessed with hunting down her killer. Once he finds Kyung-chul, things get twisted. After brutally beating the murderer, Kim lets him go free, and a demented game of cat and mouse begins.—krmanirethnam",
    "Like a hellhound driven mad by the thrill of the hunt, pitiless serial killer Jang Kyung-chul prowls Seoul's ill-lit streets, searching for the next victim. Of course, no one is safe when the human-like monster is out for flesh. Jang's favourite prey, however, is unaccompanied ladies. But someone must end the murderer's reign of terror. When an innocent mother pays in blood, elite agent Kim Soo-hyun has no choice but to step up in the name of justice. However, he is about to play with fire: as the determined officer embarks on a dangerous mission to bring down the psychopath behind the law's back, a destructive transformation gradually occurs. After all, if you stare into the abyss, darkness stares back. Now, reason and pleas for mercy won't work. Because, in this world, some monsters are more horrifying than others. And when blind revenge rules the mind, what separates man from beast?—Nick Riganas"
  ],
  "synopsis": "Kyung-chul is a dangerous psychopath who kills for pleasure. He has committed infernal serial murders in diabolic ways that one cannot even imagine and his victims range from young women to even children. The police have chased him for a long time, but were unable to catch him. One day, Joo-yeon, daughter of a retired police chief becomes his prey and is found dead in a horrific state. Her fiance Soo-Hyun, a top secret agent, decides to track down the murderer himself. He promises himself that he will do everything in his power to take bloody vengeance against the killer, even if it means that he must become a monster himself to get this monstrous and inhumane killer."
}