{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/tintsaQ0WLzZsTMkTiqtMB3rfc8.jpg",
  "id": 522627,
  "title": "The Gentlemen",
  "poster_path": "https://image.tmdb.org/t/p/w500/jtrhTYB7xSrJxR1vusu99nvnZ1g.jpg",
  "release_date": "2020-01-01",
  "vote_average": 7.679,
  "vote_count": 5291,
  "popularity": 46.448,
  "overview": "American expat Mickey Pearson has built a highly profitable marijuana empire in London. When word gets out that he’s looking to cash out of the business forever it triggers plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
  "imdb_id": "tt8367814",
  "budget": 22000000,
  "homepage": "https://www.miramax.com/movie/the-gentlemen",
  "revenue": 115171795,
  "runtime": 113,
  "genres": [
    "Action",
    "Crime",
    "Comedy"
  ],
  "summaries": [
    "An American expat tries to sell off his highly profitable marijuana empire in London, triggering plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
    "A talented American graduate of Oxford, using his unique skills, and audacity, creates a marijuana empire using the estates of impoverished British aristocrats. However, when he tries to sell his empire to a fellow American billionaire, a chain of events unfolds, involving blackmail, deception, mayhem and murder between street thugs, Russian oligarchs, Triad gangsters and gutter journalists.—Peter-Patrick76 (peter-patrick@mail.com)",
    "Mickey Pearson is an American expatriate who became rich by building a highly profitable marijuana empire in London. When word gets out that he's looking to cash out of the business, it soon triggers an array of plots and schemes, including bribery and blackmail from shady characters who want to steal his domain.—yusufpiskin",
    "Oxford graduate and marijuana entradionaire mickey person makes a killing selling ganja and makes it Big almost becoming mad while at it however when he wants to chill out and enjoy hell starts to unravel around him as gangster's and any body wanting to make a killing out of doing nothing comes at him for his prize."
  ],
  "synopsis": "Big Dave (Eddie Marsan), editor of the Daily Print tabloid, is snubbed by cannabis baron Mickey Pearson (Matthew McConaughey) at a party and hires private investigator Fletcher (Hugh Grant) to investigate Pearson's links to Lord Pressfield (Samuel West), a minor Royal with a heroin-addicted daughter Laura Pressfield (Eliot Sumner). Fletcher offers to sell his findings (typed up as a screenplay entitled Bush) to Pearson's right-hand man Raymond (Charlie Hunnam) for £20 million.Born in poverty in the US, Pearson won a Rhodes Scholarship to Oxford University, where he began selling marijuana to privileged fellow students before dropping out and building his empire by violence. He plans to sell his business to American billionaire Matthew Berger (Jeremy Strong) for $400 million so he can retire peacefully with his wife Rosalind (Michelle Dockery). Pearson shows Berger one of the labs where he grows his cannabis under the estates of aristocratic landlords, who need cash for the upkeep of their stately homes. Pearson is later approached by Dry Eye (Henry Golding), an under-boss for Chinese gangster Lord George (Tom Wu). Dry Eye offers to buy out Pearson's business, but he refuses. Pearson's lab is then raided by amateur boxers who film their encounter defeating the lab's guards and stealing the marijuana before uploading it online as a rap video. The boxers' coach later orders them to delete the video.Pearson begins transferring his cannabis-growing out of the estates. He also agrees to bring home Pressfield's wayward daughter Laura. Raymond retrieves Laura, however, in a brawl with her room-mates one of Raymond's men accidentally pushes Aslan, a young Russian man, out of the window to his death. Laura later dies of a heroin overdose. Coach (Colin Farrell) visits Raymond, apologizes for his students' actions, and offers his services as penance. Coach has captured Phuc (Jason Wong), a henchman of Dry Eye's who had informed Coach's crew about the lab location, although Phuc is accidentally killed during a botched escape attempt. Pearson threatens Lord George for going after his lab, and destroys one of his heroin labs in retaliation. George chastises Dry Eye for his insubordination in attacking Pearson and offering to buy him out; George nods to a henchman to execute Dry Eye, but the man executes George instead.Unknown to Pearson, Dry Eye is in league with Berger, who had wanted Pearson's business disrupted to reduce the price. Dry Eye has taken Lord George's place and still hopes to take Pearson's empire for himself. Dry Eye tries to kidnap Rosalind, who kills Dry Eye's men before she runs out of bullets in her 2-shot derringer. Raymond kills an assassin sent to kill Pearson; the two rush to Rosalind and Pearson kills Dry Eye as he is about to sexually assault Rosalind. Fletcher ends his story and Raymond orders him to leave his house. Fletcher wants 20 MM Pounds or he will share all his evidence with Dave, who will publish it all and Mickey will have to leave the country for ever.Fletcher has merely confirmed Pearson's suspicions about the link between Dry Eye and Berger. Raymond orders Coach's students to capture Big Dave. They drug him and film him having sex with a pig, threatening to post it online unless he drops his investigation. Pearson and Berger meet up again in a frozen fish plant, actually a cover for Pearson's European distribution operation. Berger drops his offer to $130 million, but Pearson reveals his knowledge of Berger's plan, shows him Dry Eye's frozen body and tells him he is keeping his business. Pearson forces Berger inside a refrigerator, where he will freeze to death unless he transfers $270 million compensation and, for the assault on Rosalind, cuts \"a pound of flesh\" from his own body.Fletcher approaches Raymond again for his payment, but Raymond reveals that he was tailing Fletcher all along. The boxers have stolen his stashes of evidence after Raymond placed a tracker on him during their last encounter. Fletcher reveals that he has also sold info to Aslan's father, a Russian oligarch and former KGB agent. The assassin that Raymond earlier (who was send to kill Mickey to account for Aslan's death) killed was one of the Russians. Coach kills two Russian hit-men sent to kill Raymond, while Fletcher escapes in the chaos. Pearson is kidnapped by two other Russians, but they are quickly ambushed by Coach's students who want to \"solve Coach's problem\". They assault the car with bullets, killing the Russians and allowing Pearson to escape. Later, Fletcher decides to pitch the story as a film to Miramax. After his meeting, he gets into a cab only to realize that Raymond is the driver. Upon learning of Fletcher's capture, Pearson and Rosalind return to their cannabis empire and celebrate in each other's company."
}