{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/oIwfoUFfWfESn0Y8u8jv9lc8li1.jpg",
  "id": 562,
  "title": "Die Hard",
  "poster_path": "https://image.tmdb.org/t/p/w500/yFihWxQcmqcaBR31QM6Y8gT6aYV.jpg",
  "release_date": "1988-07-15",
  "vote_average": 7.783,
  "vote_count": 10533,
  "popularity": 51.603,
  "overview": "NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her office, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
  "imdb_id": "tt0095016",
  "budget": 28000000,
  "homepage": "https://www.foxmovies.com/movies/die-hard",
  "revenue": 140767956,
  "runtime": 132,
  "genres": [
    "Action",
    "Thriller"
  ],
  "summaries": [
    "A New York City police officer tries to save his estranged wife and several others taken hostage by terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles.",
    "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands.—Sam",
    "New York City policeman John McClane (Bruce Willis) is visiting his estranged wife (Bonnie Bedelia) and his daughter and son Christmas Eve. He joins her at a holiday party in the headquarters of the Japanese-owned business she works for. But the festivities are interrupted by a group of terrorists who take over the exclusive high-rise, and everyone in it. Very soon McClane realizes that there's no one to save the hostages -- but him.—ahmetkozan",
    "John McClane, a New York City cop flies to LA to visit his wife at a Christmas party. But when twelve terrorists attack the building the same night, McClane is the only hope of saving everybody. With nothing but a handgun and his wits, he is forced to take on Hans Gruber and his fellow terrorists.—daniel lacey",
    "In the midst of the corporate executive Christmas party on Christmas Eve, NYPD detective John McClane arrives direct from the airport to the Nakatomi Corporation headquarters in Los Angeles so that he can spend Christmas with his two children, his wife Holly who is the successful number 2 at the company. While they still love each other, John never supported Holly's move to Los Angeles, Holly assuming her maiden surname of Gennaro, about which John was unaware until now, and he not staying with them indicative of the strained state of their marriage. While John is cleaning up in one of the executive washrooms, a dozen or so heavily armed men ambush the party, those in the room assuming they being terrorists against some aspect of the company, whether it be their corporate policy or their ties to Japan, only two of the many possibilities. Out of his element, John believes the best way to save who end up being the hostages at the party and himself is not to make himself known to the assailants, until he discovers who they are and what they want, they who seemed to be aware of everyone who was supposed to be in the building, such as security guards, he not among those known. The assailants also seemed to have organized it so that not only has all communication having been cut in and out of the building, their only communication with each other being through their own radios, but if any communication is made specifically to the LAPD that such communication would be deemed crank calls by the police. While John can only keep himself unknown to the assailants for so long in a kill or be killed scenario, John has to hope that he can keep one step ahead of the assailants and that they don't discover his identity, especially that Holly, one of the hostages, is his wife. The one wild card, at least known to John, is Argyle, the hipster limo driver on his first job organized by the company, in the underground parking garage, he waiting for John's call about if his service as said driver is required further that evening.—Huggo"
  ],
  "synopsis": "On Christmas Eve, NYPD Detective John McClane (Bruce Willis) arrives in Los Angeles, hoping to reconcile with his estranged wife, Holly (Bonnie Bedelia), at a party held by her employer, the Nakatomi Corporation. He is driven to Nakatomi Plaza by limo driver, Argyle (De'voreaux White), who says he will wait for McClane in the garage. While McClane changes his clothes, the tower is seized by a German radical, Hans Gruber (Alan Rickman), and his heavily armed team, including Karl (Alexander Godunov) and Theo (Clarence Gilyard Jr.). Everyone in the tower is taken hostage, except for McClane, who slips away.\nGruber's men seal the building from the inside and take control of all elevators. They also cut off all communications to the outside.Gruber is posing as a terrorist to steal the $640 million in untraceable bearer bonds in the building's vault; he tries to get executive Joseph Takagi (James Shigeta) to reveal the access code but Takagi refuses; Gruber executes him and tasks Theo with breaking into the vault. McClane witnesses the murder and one of Gruber's group, Tony (Andreas Wisniewski), is sent after him. McClane gets on an under-construction floor and triggers the fire alarm to attract the police. But Hans calls 911, gives the fire code and cancels the alarm and disables the system.\nHolly's co-worker Harry Ellis (Hart Bochner) and Holly discuss in whispers that McClane is behind the events in the tower. Ellis has a thing for Holly.McClane kills Tony and takes his weapon and his radio which he uses to contact the skeptical Los Angeles Police Department (LAPD); Sergeant Al Powell (Reginald VelJohnson) is sent to investigate.\nMcClane kills two terrorists and discovers a bag of C-4 and detonators. Powell, having found nothing amiss, is leaving when McClane drops a body onto his car. After Powell calls for back-up, Dwayne T. Robinson (Paul Gleason), the LAPD Deputy Chief arrives with his team. Dwaye refuses to believe Powell's hunch that the person on the radio might be a cop (to protect his identity, McClane had given an alias Roy since he knew Hans could hear the radio transmissions).\nA SWAT team attempts to storm the building but is assaulted by the terrorists (with rocket launched grenades and other heavy arms). McClane throws some C-4 down an elevator shaft, causing an explosion that kills some of the terrorists and ends the assault.News media picks up the story and unscrupulous reporter Richard Thornburg (William Atherton) arrives on the scene with a truck.\nHolly's co-worker Harry Ellis attempts to negotiate with Hans and gives him McClane's identity, but when McClane refuses to surrender (Ellis wants McClane to hand over the detonators back to Hans), Gruber kills Ellis. Gruber calls the police and tells them to release captured terrorists around the world and wants choppers on the roof to take his men and the hostages to LAIA.\nMcClane catches Gruber checking explosives on the roof, but Hans pretends he is an escaped hostage and McClane gives him a gun; when Gruber attempts to shoot him, he finds it is not loaded. Gruber is saved by the intervention of other terrorists. McClane escapes but is injured by shattered glass and loses the detonators. Outside, FBI agents take control; they order the power to be shut off which, as Gruber had anticipated, and this disables the final vault lock so his team can collect the bonds.The FBI agrees to Gruber's demand for a helicopter, intending to send gunship helicopters to eliminate the group. McClane checks the roof and realizes Gruber plans to blow the roof to kill the hostages and fake his team's deaths. Karl, enraged by the death of his brother Tony, attacks McClane and is apparently killed. Gruber sees a news report by reporter Richard Thornburg on McClane's children and deduces that he is Holly's husband. The hostages are taken to the roof while Gruber keeps Holly with him. McClane drives the hostages from the roof just before Gruber detonates it and destroys the approaching FBI helicopters. Meanwhile, Theo retrieves a van from the parking garage but is neutralized by Argyle, who has been following events on his car radio.A weary and battered McClane finds Holly with Gruber and his remaining henchman. McClane surrenders to Gruber and is about to be shot, but grabs a concealed pistol taped to his back and uses his last two bullets to wound Gruber and kill his accomplice. Gruber crashes through a window but grabs onto Holly's wristwatch. Gruber makes a last-ditch attempt to kill the pair as McClane unclasps the watch and Gruber falls to his death.Outside, McClane and Holly meet Powell. Karl emerges and attempts to shoot McClane but is killed by Powell. Holly punches Thornburg when he attempts to interview McClane. Argyle crashes through the parking garage door in the limo and leaves with McClane and Holly."
}