{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/9guoVF7zayiiUq5ulKQpt375VIy.jpg",
  "id": 592350,
  "title": "My Hero Academia: Heroes Rising",
  "poster_path": "https://image.tmdb.org/t/p/w500/zGVbrulkupqpbwgiNedkJPyQum4.jpg",
  "release_date": "2019-12-20",
  "vote_average": 8.178,
  "popularity": 26.598,
  "overview": "Class 1-A visits Nabu Island where they finally get to do some real hero work. The place is so peaceful that it's more like a vacation … until they're attacked by a villain with an unfathomable Quirk! His power is eerily familiar, and it looks like Shigaraki had a hand in the plan. But with All Might retired and citizens' lives on the line, there's no time for questions. Deku and his friends are the next generation of heroes, and they're the island's only hope.",
  "imdb_id": "tt11107074",
  "budget": 0,
  "homepage": "",
  "revenue": 29900000,
  "runtime": 104,
  "genres": [
    "Animation",
    "Action",
    "Fantasy",
    "Adventure"
  ],
  "summaries": [
    "A group of youths aspiring to become professional superheroes, fight in a world full of people with abilities, also known as quirks. Deku and his fellow classmates from Hero Academy face Nine, the strongest villain yet.",
    "After the events of Season 4 of the Anime, Izuku Midoriya and Katsuki Bakugo go from fighting against each other to fighting side by side as they face the biggest threat that dares to dominate the domain: NINE.",
    "Mankind has developed superpowers known as \"Quirks\"; this is the power the vast majority possesses, those who do not, are being discriminated against and looked down on. Indeed, villains have the superpower, too and want to rebuild the world for it to look the way they see it. However, a prestigious school known as the The Hero Academy trains its students for them to become heroes and to help those who have less powerful Quirks, or those who do not have them at all, as well as to stand against the plans of the villains. The series focuses on a middle school student Izuku Midoriya, who has no superpowers. Will he be able to become a hero and somehow to contribute to the peace and stability in the world, where the weak is the minority that needs to be defended.—Scientiiaa"
  ],
  "synopsis": ""
}