{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/1PnRPz4A4AguUEVOTcprIyctrax.jpg",
  "id": 59440,
  "title": "Warrior",
  "poster_path": "https://image.tmdb.org/t/p/w500/iM8n4nZJPR2abpnyZ36FUgHiRjr.jpg",
  "release_date": "2011-09-09",
  "vote_average": 7.844,
  "vote_count": 4268,
  "popularity": 34.174,
  "overview": "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament – a path that puts the fighter on a collision course with his estranged, older brother.",
  "imdb_id": "tt1291584",
  "budget": 25000000,
  "homepage": "",
  "revenue": 23300000,
  "runtime": 140,
  "genres": [
    "Drama",
    "Action"
  ],
  "summaries": [
    "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.",
    "Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, winner-takes-all battle of their lives.—MConnell",
    "Organized fighting was a part of the Conlons' lives when brothers, Tommy Conlon and Brendan Conlon, were kids, with their father, Paddy Conlon, their trainer. Tommy has been estranged from both Brendan and Paddy for fourteen years, when Tommy ran off with his mother due to the abuse exacted by alcoholic Paddy. Tommy's gripe with Brendan was not running off with them - which Tommy saw as support for Paddy - instead starting life with his now wife, Tess. To support his family, Brendan now teaches high school science and has largely left his fighting life behind him. After his mother's death, Tommy served time in the military. Tommy returns home to find a changed Paddy, one who has been clean and sober for almost three years and who has rediscovered religion, both which he feels has completely turned his life around from who he was when Tommy left fourteen years ago, although Tommy is not convinced. The lives of the Conlons may intersect when they all fall back into mixed martial arts (MMA), Tommy in trying to discover what his post-military life holds, and as Brendan finds that his teaching is insufficient to pay all the family bills, with fighting and teaching seemingly incompatible. With a $5 million winner-takes-all prize for a MMA tournament as the carrot, Tommy and Brendan and by association Paddy's interrelationships may either be strengthen or further torn apart, both figuratively and literally, if they take part in this very public and potentially violent arena.—Huggo",
    "Two estranged brothers and Mixed Martial Arts fighters confront the forces that tore their family apart as they prepare to do battle in the ring in this drama from director Gavin O'Connor (Pride and Glory). Tommy Conlon (Tom Hardy) is an ex-Marine from Pittsburgh who's never quite shaken his troubled past. Upon learning that the purse in an upcoming MMA tournament is the largest in the league's history, Tommy recruits his father, Paddy (Nick Nolte), a former coach and recovering alcoholic, to whip him into shape in time for the competition. Meanwhile, as Tommy steadily ascends the ranks by defeating one powerful opponent after another, his brother, Brendan, struggles to provide for his family with his job as a public school teacher. A former MMA fighter with a devastating punch, Brendan begins to wonder if he, too, could have a shot at winning the coveted purse. In time, Brendan and Tommy both emerge as dark horse contenders in the competition, setting the two brothers on a brutal collision course. But Tommy and Brendan's biggest battle won't be fought in the ring -- it will be fought in their hearts and minds.",
    "After a long decade of estrangement with his repentant alcoholic father, the fresh-out-of-Iraq ex-Marine, Tommy Conlon, returns to his hometown of Pittsburgh, bent on getting back to the ring of Sparta: a winner-takes-all, no-holds-barred mixed martial arts tournament. As Tommy trains for the title and the $5 million purse, the underdog, Brendan--Tommy's alienated older brother, and high school science teacher who struggles to eke out a living--fights his way into the warlike tournament to save his family. Now--against the backdrop of bitter resentment, mutual animosity, and a troubled past--the two brothers will have to lock horns with each other in a brutal final battle. However, family is forever, through thick and thin. Amid pain and suffering, can Tommy and Brendan reconcile, and, maybe, find redemption?—Nick Riganas"
  ],
  "synopsis": "U.S. Marine Tommy Riordan (Tom Hardy) visiting his father, Paddy Conlon (Nick Nolte), a recovering alcoholic who has become a born-again Christian. Tommy becomes angry about his father's formerly abusive behavior and Paddy fails to convince him that he has truly changed. The next day, Tommy enters a gym where he beats a professional fighter named Pete \"Mad Dog\" Grimes (Erik Apple) unconscious in less than 30 seconds, in a fight which is filmed via a cell phone's video camera and later uploaded to the Internet, where it goes viral. Tommy learns about a winner-takes-all mixed martial arts tournament called Sparta in which the winner will receive $5,000,000. In order to provide for the family of his fallen friend in the Marine Corps, Tommy asks his father to help him train for the tournament, but only under the condition that Paddy does not try to reconcile their relationship.Meanwhile, Paddy's older son, Brendan Conlon (Joel Edgerton), a high school physics teacher and former UFC fighter, is struggling to financially provide for his wife Tess (Jennifer Morrison) and two daughters and faces the possibility of his home getting foreclosed due to mortgage re-financing to pay for his younger daughter's open heart surgery. To increase his income, Brendan risks returning to his former profession as a mixed martial arts fighter battling amateur fighters for money. Rumors of Brendan fighting in the ring begin spreading among his students. The school's superintendent, objecting to his participation in such dangerous activities, suspends him without pay. Left with no other option, Brendan seeks the training of old friend Frank Campana (Frank Grillo) and begins competing in smaller venue fights. After the fighter Frank planned to enter into the Sparta tournament is injured during training, Brendan convinces Frank to enter him as a replacement.After arriving at the tournament, Brendan discovers that Tommy has also entered. Tommy is still bitter at Brendan for staying behind with Tess when Tommy and their mother left the drunken and abusive Paddy; Tommy was left to care for their mother when she became terminally ill. Brendan claims that he has forgiven his father for the wrong he has done, but Tommy is unconvinced.Meanwhile, the video of Tommy beating \"Mad Dog\" attracts the attention of a Marine in Iraq whose life was saved by Tommy months prior. The information and video of Tommy saving the Marine is shared with the press and Tommy becomes a national hero, gaining a massive fan base and appreciation from not only viewers, but from the U.S. Marine Corps as well. However, Tommy's records surface from the Corps and reveal that he deserted the military after his entire unit was killed in a friendly fire bombing. Tommy had been using his mother's maiden name as his own surname in order to evade arrest for his desertion. The military police will take him into custody after the tournament is over.Over two nights, Brendan and Tommy have contrasting fortunes: Tommy quickly and brutally knocks out his three opponents, while Brendan has a much tougher time, outmatched physically but utilizing Brazilian Jiu-Jitsu to force submissions. In the semi-final match, Brendan forces the Russian champion Koba (Kurt Angle) to tap out. The night before the final day, Paddy attempts to talk to Tommy about his actions in Iraq only to be berated and dismissed, which the following morning has caused a distraught Paddy to start drinking again. Seeing his terrible pain, Tommy calms and comforts him. In the end the brothers are the last fighters remaining in the tournament, and despite Brendan's desire to reconcile, they unleash all the anger they have towards one another.The fight between the brothers shows Tommy having the upper hand initially, but Brendan manages to dislocate Tommy's shoulder. Tommy refuses to tap, and finally Brendan traps him in a rear naked choke. While they both lie struggling on the mat, Brendan tearfully apologizes to Tommy and tells him that he loves him. After some hesitation, Tommy taps out. The two reconciled brothers exit the ring as their father smiles."
}