{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/yYEOYzgqPB31mkSsuPdCvXH3zHv.jpg",
  "id": 626332,
  "title": "Flamin' Hot",
  "poster_path": "https://image.tmdb.org/t/p/w500/a7KyFMPXj0iY4EoLq1PIGU1WJPw.jpg",
  "release_date": "2023-03-11",
  "vote_average": 8.179,
  "popularity": 65.222,
  "overview": "The inspiring true story of Richard Montañez, the Frito Lay janitor who channeled his Mexican American heritage and upbringing to turn the iconic Flamin’ Hot Cheetos into a snack that disrupted the food industry and became a global pop culture phenomenon.",
  "imdb_id": "tt8105234",
  "budget": 0,
  "homepage": "https://www.searchlightpictures.com/flamin-hot",
  "revenue": 0,
  "runtime": 99,
  "genres": [
    "Comedy",
    "Drama"
  ],
  "summaries": [
    "This is the inspiring true story of Richard Montañez who, as a Frito Lay janitor, disrupted the food industry by channeling his Mexican heritage to turn Flamin' Hot Cheetos from a snack into an iconic global pop culture phenomenon."
  ],
  "synopsis": "In 1966 southern California, Richard Montañez grows up as a hard-working child with a strict father and supportive grandfather. He meets his future wife Judy in school where he begins selling burritos to other children. He is arrested at a young age when nobody believed that he made his money this way. As an adult, Richard and Judy live their lives as hoodlums selling drugs but turn their life around once Judy gets pregnant with their first child. A second child later, Richard and his family begin struggling trying to make ends meet as he searches for work. He eventually turns to his friend, and fellow former hoodlum, Tony Romero, who helps him get a job at Frito-Lay. Despite lying on his resumé, floor head Lonny Mason hires him. Richard begins paying attention to all the nuances of the factory and starts pursuing engineer maintenance leader Clarence C. Baker to help with teaching him about the machines. Despite some reluctance, Baker agrees and teaches Richard how to operate all the machinery in the factory. Unfortunately, the Reagan administration begins to severely affect low level paying jobs and Frito-Lay's stocks begin to go down. This eventually results in some of the workers getting laid off. Frito-Lay CEO Roger Enrico puts a video out to the workers which is viewed by Richard and gets the inspiration to \"think like a CEO\". After picking up his kids from school, Richard takes them out for elotes (Mexican street corn). Upon noticing that his youngest son Steven likes the spicy flavor, despite it bothering him, he realizes that the way to save Frito-Lay is to pitch to the Latino market. He convinces Baker and the rest of his coworkers to let him take some unflavored Cheetos home, but Judy offers that he talks to his father Vacho first about a job. Vacho ends up belittling Richard's plans, causing Judy to support Richard even more. The Montañezes work tirelessly trying to find the perfect spicy flavor for Cheetos, eventually getting the right concoction. Richard attempts to pitch his idea to Lonny, but he turns him down, forcing him to sneak in and copy Enrico's phone number. Richard manages to get through to Enrico who, while perplexed over being called by a janitor, is intrigued to learn that he saw his video and asks that he send his flavored Cheetos. He tastes them and is immediately hooked, setting up a meeting at the factory right away. While Lonny is upset with Richard, he prepares himself for the pitch, finally getting the approval of his father to back him up. Richard proceeds to speak from the heart and his pitch his accepted with the Flamin' Hot Cheetos being put into production. While this results in more jobs, the new flavor is not flying off the shelves. Disappointed, Richard's children point out that there is no advertisements for the flavor. Richard returns to work and orders everyone to use their skills to sell the new flavor straight from the street. The tactic works and Enrico calls to ask that the factory produce an even bigger order. While Baker gets the promotion, he always desired, Richard is still a janitor, though Baker gives him some support. Lonny asks Richard to clean upstairs, only to find Enrico who tells him that he understands his struggles growing up, before revealing that he has been promoted to head of international marketing. Richard is applauded by all his coworkers for his success, and he happily calls Judy to tell her the good news. The end titles reveal that Richard retired from the company after 45 years and that he and Judy are still together."
}