{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/xTsERrOCW15OIYl5aPX7Jbj38wu.jpg",
  "id": 724495,
  "title": "The Woman King",
  "poster_path": "https://image.tmdb.org/t/p/w500/438QXt1E3WJWb3PqNniK0tAE5c1.jpg",
  "release_date": "2022-09-16",
  "vote_average": 7.7,
  "vote_count": 1849,
  "popularity": 45.664,
  "overview": "The story of the Agojie, the all-female unit of warriors who protected the African Kingdom of Dahomey in the 1800s with skills and a fierceness unlike anything the world has ever seen, and General Nanisca as she trains the next generation of recruits and readies them for battle against an enemy determined to destroy their way of life.",
  "imdb_id": "tt8093700",
  "budget": 50000000,
  "homepage": "https://www.thewomanking.movie/",
  "revenue": 97300000,
  "runtime": 135,
  "genres": [
    "Action",
    "Drama",
    "History"
  ],
  "summaries": [
    "A historical epic inspired by true events that took place in The Kingdom of Dahomey, one of the most powerful states of Africa in the 18th and 19th centuries.",
    "The Woman King is the remarkable story of the Agojie, the all-female unit of warriors who protected the African Kingdom of Dahomey in the 1800s with skills and a fierceness unlike anything the world has ever seen. Inspired by true events, The Woman King follows the emotionally epic journey of General Nanisca (Oscar®-winner Viola Davis) as she trains the next generation of recruits and readies them for battle against an enemy determined to destroy their way of life. Some things are worth fighting for.",
    "The Kingdom of Dahomey, West Africa, 1823. Having sworn to risk life and limb to protect the land, formidable General Nanisca and the Agojie, the elite, all-female military regiment of King Ghezo, keep the bellicose Oyo Empire at bay. In the meantime, as the unbroken sisterhood trains a new generation of fearless warriors, their battle-scarred leader seeks alternative sources of profit. However, Ghezo's participation in the slave trade paves the way for the inevitable violent confrontation between the Agojie, the Oyo, and the slavers that will compromise the kingdom's future.—Nick Riganas"
  ],
  "synopsis": ""
}