{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/8LRcCJjbQI552BMCuGgYqph8USS.jpg",
  "id": 7345,
  "title": "There Will Be Blood",
  "poster_path": "https://image.tmdb.org/t/p/w500/fa0RDkAlCec0STeMNAhPaF89q6U.jpg",
  "release_date": "2007-12-26",
  "vote_average": 8.087,
  "vote_count": 6185,
  "popularity": 28.152,
  "overview": "Ruthless silver miner, turned oil prospector, Daniel Plainview, moves to oil-rich California. Using his son to project a trustworthy, family-man image, Plainview cons local landowners into selling him their valuable properties for a pittance. However, local preacher Eli Sunday suspects Plainview's motives and intentions, starting a slow-burning feud that threatens both their lives.",
  "imdb_id": "tt0469494",
  "budget": 25000000,
  "homepage": "https://www.netflix.com/title/70075473",
  "revenue": 77208711,
  "runtime": 158,
  "genres": [
    "Drama"
  ],
  "summaries": [
    "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.",
    "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California is presented. Miner turn oilman Daniel Plainview is a driven man who will do whatever it takes to achieve his goals. He works hard but he also takes advantage of those around him at their expense if need be. His business partner is his son H.W., who in reality he \"acquired\" when H.W.'s biological single father, who worked on one of Daniel's rigs, got killed in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins, whose family farm Daniel purchases for the major oil deposit located on it. Eli, the local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.—Huggo",
    "Los Angeles, California, 1902. After stumbling upon a large oil field, shrewd prospector Daniel Plainview shifts his focus from precious metals to oil. As a result, ruthless Daniel follows up on a promising lead with his adopted son in tow, determined to create an empire. And as silver-tongued Plainview poses as a trustworthy family man to talk the local landowners into selling vast plots of seemingly barren land for a song, a grim tale of pride, obsession, greed, and blood unfolds.—Nick Riganas",
    "The film follows the rise to power of Daniel Plainview - a charismatic and ruthless oil prospector, driven to succeed by his intense hatred of others and desperate need to see any and all competitors fail. When he learns of oil-rich land in California that can be bought cheaply, he moves his operation there and begins manipulating and exploiting the local landowners into selling him their property. Using his young adopted son H.W. to project the image of a caring family man, Plainview gains the cooperation of almost all the locals with lofty promises to build schools and cultivate the land to make their community flourish. Over time, Plainview's gradual accumulation of wealth and power causes his true self to surface, and he begins to slowly alienate himself from everyone in his life.—Denny Gibbons",
    "Daniel Plainview is an oil man and spends his days harvesting the money from discovered oil. When Paul Sunday asks Plainview to dig for the oil at his family home, he finds it too hard to resist. Soon, he is up in Little Boston, California. Not everyone is pleased to see him as tension builds between Daniel and preacher, Eli Sunday as well as the greed.—FilmFanUk"
  ],
  "synopsis": "In 1898, Daniel Plainview (Daniel Day-Lewis), a prospector in New Mexico, mines a potentially precious ore vein from a pit mine hole. In the process of dynamiting the lode, he falls and breaks his leg. With the silver sample, he climbs out of the mine, drags himself to an assay office, and receives a silver and gold certificate claim. In 1902, he discovers oil near Los Angeles and establishes a drilling company. Following the death of a worker in an accident, Daniel adopts the man's orphaned son. He refers to the child, H. W. (Dillon Freasier), as his business partner, which allows him to present himself to potential investors as a family man.In 1911, Daniel is approached by Paul Sunday (Paul Dano), who tells him of an oil deposit under his family's property in Little Boston, California. Daniel attempts to buy the farm at a bargain price. However, Paul's twin brother (Paul Dano), Eli, demands $10,000 for the church, of which he is pastor. An agreement is made for $5,000 after the well begins producing, and Daniel acquires all the available surrounding land, except for one holdout: William Bandy (Hans Howes). Oil production begins, but an accident kills a worker and a gas blowout deafens H. W (Russell Harvard). Eli blames the disasters on the well not being properly blessed (Daniel refused Eli's offer to bless the well at its inauguration in front of the whole town). When Eli demands the $5,000 that Daniel still owes, Daniel beats and humiliates him. At the dinner table, Eli berates his father for trusting Daniel.A man arrives at Daniel's doorstep claiming to be his half-brother, Henry (Kevin J. O'Connor). Daniel hires Henry and the two grow close. H. W. sets fire to their house, intending to kill Henry. Angry, Daniel sends him away to a school for the deaf in San Francisco. A representative from Standard Oil offers to buy out Daniel's local interests, but Daniel strikes a deal with Union Oil and constructs a pipeline to the California coast, though the Bandy ranch remains an impediment.While reminiscing about his childhood, Daniel becomes suspicious about Henry's story and one night quizzes him about it at gunpoint. \"Henry\" confesses that he was a friend of the real Henry's, who died from tuberculosis, and that he learned the details of Henry's life by reading his personal journal. In a fit of rage, Daniel murders the impostor and buries his body. The next morning, Daniel is awakened by Bandy, who knows of the previous night's events and wants Daniel to repent. He also wants Daniel to baptize and that's the only way he will allow Daniel to build the pipeline. At the church, as part of Daniel's baptism, Eli humiliates him, strikes him, and makes him confess to having abandoned his son, before announcing to the congregation that Daniel will be making a large donation to the church. With the pipeline underway, Daniel arranges for the still angry H. W. to return, while Eli leaves town for missionary work.In 1927, H. W. marries Mary (Colleen Foy), Eli and Paul's sister. Daniel, now extremely wealthy but suffering from alcoholism, lives as a recluse in a large mansion. Through a sign language interpreter, H. W. asks Daniel to dissolve their partnership so that H. W. can establish his own oil company in Mexico. Daniel reacts brutally, mocks H. W.'s deafness, and reveals H. W.'s true origins as an orphan. H. W. thanks God he has \"none of Daniel in him\" and leaves.Eli visits Daniel, who is drunk, in Daniel's private bowling alley. Eli, now a radio preacher, offers to sell Daniel drilling rights on the land of William Bandy, who has recently died. Daniel agrees on the condition that Eli denounce his faith and his own credibility. Eli reluctantly does so. Daniel reveals that the property is now worthless because he has already drained its oil by slant drilling from surrounding wells. Shaken, Eli confesses to being in dire financial straits and to having strayed morally. Daniel taunts him, chases him around the bowling alley, and beats him to death with a bowling pin. When his butler enters the room, he finds Daniel sitting on the floor as he mutters \"I'm finished!\""
}