{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/nlCHUWjY9XWbuEUQauCBgnY8ymF.jpg",
  "id": 76341,
  "title": "Mad Max: Fury Road",
  "poster_path": "https://image.tmdb.org/t/p/w500/8tZYtuWezp8JbcsvHYO0O46tFbo.jpg",
  "release_date": "2015-05-13",
  "vote_average": 7.6,
  "vote_count": 21294,
  "popularity": 86.763,
  "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
  "imdb_id": "tt1392190",
  "budget": 150000000,
  "homepage": "https://www.warnerbros.com/movies/mad-max-fury-road",
  "revenue": 378858340,
  "runtime": 121,
  "genres": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "summaries": [
    "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search for her homeland with the aid of a group of female prisoners, a psychotic worshiper and a drifter named Max.",
    "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.—Production",
    "In the stark desert wasteland populated by a broken humanity driven with survival and the unending ravage for gasoline, a loner named Max finds himself unwantedly caught in the middle of a chase while aiding the heroine Furiosa and her female companions. She struggles to return to her homeland and escape the clutches of a ruthless desert gang leader, Immortal Joe. With the harsh desert sands in front of them and marauders behind, only the maddest will prevail the storm.",
    "Years after the collapse of civilization, the tyrannical Immortan Joe enslaves apocalypse survivors inside the desert fortress the Citadel. When the warrior Imperator Furiosa leads the despot's five wives in a daring escape, she forges an alliance with Max Rockatansky, a loner and former captive. Fortified in the massive, armored truck the War Rig, they try to outrun the ruthless warlord and his henchmen in a deadly high-speed chase through the Wasteland.—Jwelch5742",
    "Trapped in the barren deserts of the dystopian Wasteland, lone road warrior Max Rockatansky struggles to stay one step ahead of the water-controlling overlord Immortan Joe and the Wild Boys, his loyal gang of marauders. But life in the carcass of civilisation is cheap. And to further complicate matters, Max then crosses paths with fearless Imperator Furiosa: one of Joe's elite lieutenants and a traitor--she has just fled the Citadel in her heavily armoured truck, The War Rig, absconding with an irreplaceable quintet of wives. Now, there is no turning back. As the powerful tyrant and his unstoppable horde of delusional zealots hunt them down with murderous intent, Max and Furiosa will need all the help they can get to stay alive. However, do they have what it takes to cheat death and live to tell the tale?—Nick Riganas"
  ],
  "synopsis": "Following a nuclear holocaust, the world has become a desert wasteland and civilization has collapsed. Max Rockatansky (Tom Hardy), a survivor, is captured by the War Boys, the army of the tyrannical Immortan Joe (Hugh Keays-Byrne) and taken to Joe's Citadel. Designated a universal blood donor, Max is imprisoned and used as a \"blood bag\" for a sick War Boy called Nux (Nicholas Hoult). Meanwhile, Imperator Furiosa (Charlize Theron), one of Joe's lieutenants, is sent in her armored truck to collect gasoline. When she drives off-route, Joe realizes that his five wives-women selected for breeding-are missing. Joe leads his entire army in pursuit of Furiosa, calling on the aid of nearby Gas Town and the Bullet Farm.Nux joins the pursuit with Max strapped to his car to continue supplying blood. A battle ensues between the truck and Joe's forces. Furiosa drives into a sandstorm, evading her pursuers, except Nux, who attempts to sacrifice himself to destroy the truck. Max escapes and restrains Nux, but the car is destroyed. After the storm, Max sees Furiosa repairing her truck, accompanied by the Wives: Capable (Riley Keough), Cheedo (Courtney Eaton), Toast (Zoe Kravitz), the Dag (Abbey Lee), and Angharad (Rosie Huntington-Whiteley), the last of whom is heavily pregnant with Joe's child. Max steals the truck, but its kill switch disables it. Max reluctantly agrees to let Furiosa, and the Wives accompany him; Nux, left behind, is picked up by Joe's army.Furiosa drives through a biker gang-controlled canyon to barter a deal for safe passage; however, with Joe's forces pursuing, the gang turns on her, forcing her and the group to flee while the bikers detonate the canyon walls to block Joe. Max and Furiosa fight pursuing bikers as Joe's car, with Nux now on board, surmounts the blockade and eventually attacks Furiosa's truck, allowing Nux to board. However, as the truck escapes, Angharad falls off in an attempt to protect Max and is run over by Joe's car, mortally wounding her and her child.Furiosa explains to Max that they are escaping to the \"Green Place\", an idyllic land she remembers from her childhood. Capable finds Nux hiding in the truck, distraught over his failure, and consoles him. That night, the truck gets stuck in mud. Furiosa and Max slow Joe's forces with mines, but Joe's ally, the Bullet Farmer (Richard Carter), continues pursuing them. Nux helps Max free the truck while Furiosa shoots and blinds the Bullet Farmer. Max walks into the dark to confront the Bullet Farmer and his men, returning with guns and ammunition.They drive the truck overnight through swampland and desert, coming across a naked woman the next day. Max suspects a trap, but Furiosa approaches the woman and states her history and clan affiliation. The naked woman summons her clan, the Vuvalini, who recognize Furiosa as one of their own who was kidnapped as a child. Furiosa is devastated to learn that the swampland they passed was indeed the Green Place, now inhospitable. The group then plans to ride motorbikes across immense salt flats in the hope of finding a new home. Max chooses to stay behind, but after seeing visions of a child he failed to save, he convinces them to return to the undefended Citadel, which has ample water and greenery that Joe keeps for himself, and trap Joe and his army in the bikers' canyon.The group heads back to the Citadel, but they are attacked en route by Joe's forces, and Furiosa is seriously wounded. Joe positions his car in front of the truck to slow it, while Max fights Joe's giant son, Rictus Erectus. Joe captures Toast, but she distracts him long enough for Furiosa to rip off his breathing mask, killing him. Nux sacrifices himself by wrecking the truck, killing Rictus and blocking the canyon, allowing Max, Furiosa, the wives, and the Vuvalini to successfully escape in Joe's car, where Max transfuses his blood to Furiosa to help her survive her injuries.At the Citadel, the impoverished citizens are overjoyed at the sight of Joe's corpse. Furiosa, the wives, and the Vuvalini are cheered by the people and welcomed by the War Boys, but Max walks away, sharing a glance with Furiosa before disappearing into the crowd."
}