{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/pBdQ4iorzRV2G38mdS6rzrmUfMA.jpg",
  "id": 840326,
  "title": "Sisu",
  "poster_path": "https://image.tmdb.org/t/p/w500/ygO9lowFMXWymATCrhoQXd6gCEh.jpg",
  "release_date": "2023-01-27",
  "vote_average": 7.5,
  "vote_count": 1680,
  "popularity": 86.322,
  "overview": "Deep in the wilderness of Lapland, Aatami Korpi is searching for gold but after he stumbles upon Nazi patrol, a breathtaking and gold-hungry chase through the destroyed and mined Lapland wilderness begins.",
  "imdb_id": "tt14846026",
  "budget": 6200000,
  "homepage": "",
  "revenue": 13009289,
  "runtime": 91,
  "genres": [
    "Action",
    "War",
    "Western"
  ],
  "summaries": [
    "When an ex-soldier who discovers gold in the Lapland wilderness tries to take the loot into the city, Nazi soldiers led by a brutal SS officer battle him.",
    "During the last desperate days of WWII, a solitary prospector (Jorma Tommila) crosses paths with Nazis on a scorched-earth retreat in northern Finland. When the Nazis steal his gold, they quickly discover that they have just tangled with no ordinary miner. While there is no direct translation for the Finnish word \"sisu\", this legendary ex-commando will embody what sisu means: a white-knuckled form of courage and unimaginable determination in the face of overwhelming odds. And no matter what the Nazis throw at him, the one-man death squad will go to outrageous lengths to get his gold back - even if it means killing every last Nazi in his path. Lionsgate presents, in association with Stage 6 Films, a Subzero Film Entertainment production, in association with Good Chaos.—Lionsgate",
    "Northern Finland, 1944. With the hideous scars of battle on his sinewy body betraying a violent past, grizzled prospector Aatami Korpi has sworn to leave the war behind him. But the Germans are everywhere--the more the Finns drive the enemy out of scorched Lapland, the more Adolf Hitler's strays are determined to destroy everything in their path. And now, of all times, fortune smiles upon the solitary gold panner. Unfortunately, as the precious discovery attracts unwanted attention, Korpi soon finds himself up against an armed-to-the-teeth Wehrmacht platoon bent on snatching his priceless shiny nuggets. But no one steals from Aatami--not even crazed, gun-toting Nazis desperate for a way out.—Nick Riganas",
    "1944. In the Soviet Union and Finland signing the Moscow Treaty which in part leaves the responsibility of driving the Nazis out of Finland to the Finns, the Nazi response, in their retreat largely from their bases in Finnish Lapland to Norway, literally is to rape in taking some young women by force for their sexual pleasure and pillage leaving a barren wasteland in their wake. While one Nazi platoon in retreat led by ranking officer Bruno Helldorf has done exactly all the aforementioned, they meet their match in an encounter with an elderly prospector seemingly with nothing except what he is carrying with him on his horse. After the elderly prospector gets the better of them in their initial encounter, Helldorf has a different perspective on the situation both learning who the prospector is - namely a former Finnish commando named Aatami Korpi gone rogue - and that he has with him a small cache of gold. Helldorf sees the gold as their ticket to survival in what looks to be the near end of the war in a Nazi defeat, but wants to kill Aatami now more than ever merely out of principle.—Huggo"
  ],
  "synopsis": "In late 1944, the Finns make a treaty with the Soviet Union, that aggression between them will cease if they will remove their former German allies from Finland. This conflict is known as the Lapland War, and the German forces retaliate against the Finns. Retired commando and prospector Aatami Korpi lives alone with only his horse and his faithful dog in the remote wilderness of Lapland. Aatami spends his days panning and mining in search of gold. He sees battles taking place in the distance, but takes little interest in them. After uncovering a rich gold deposit, he collects a hefty amount of nuggets and mounts his horse, heading for the nearest town with his dog in tow. Along the way, Aatami encounters a 30-man Wehrmacht platoon led by ruthless SS Obersturmführer Bruno Helldorf and his subordinate Wolf, who are destroying settlements in their retreat and have taken several Finnish women captive. Helldorf takes little interest in Aatami, letting him pass. Aatami is soon accosted by a second group of soldiers who discover his saddlebags full of gold and prepare to execute him and his dog, but he swiftly kills them all. Alerted by the gunfire, Bruno investigates and discovers the carnage. He finds one of Aatami's gold nuggets, taken by one of the dying soldiers. Bruno and his tank pursue Aatami to the edge of a minefield, where Aatami's horse is killed by a landmine. Gathering up his gold, Aatami intentionally detonates another mine to make his escape. The soldiers sent after him are quickly claimed by the minefield. Two of the captive women are ordered ahead to ensure a clear path. One of the captives, Aino, volunteers to take the place of one of the women and leads the way. Retrieving Aatami's dog tag, Bruno learns that he was once a Finnish commando who lost his family and home fighting against the Red Army during the Winter War. Left with nothing, the vengeful Aatami became a legendary \"one-man death squad\" nicknamed Koschei, the \"Immortal\", who has killed hundreds of Communist troops. Bruno ignores the warning, defying orders to turn around and cease following Aatami. Wounded and exhausted, Aatami is awakened by the platoon's approach. With the soldiers' dogs on his trail, he hangs underneath one of the German vehicles and punctures the fuel tank, dousing himself in gasoline to hide his scent. When the platoon halts to inspect the leak, Aatami flees, holding the dogs at bay by lighting himself on fire before diving into a nearby lake. Waiting for him to surface, Bruno sends soldiers into the lake, but Aatami slits their throats underwater and breathes in the escaping air from their necks. Aatami reaches the other side of the lake, but Bruno finds his dog. Aatami discovers the town has been left in burning ruins by the Germans, and takes shelter in a petrol station. Bruno sends Aatami's dog to find his master, with a lit dynamite stick attached to his collar. Aatami saves the dog but is subdued by the explosion. Bruno, Wolf, and tank driver Schütze hang Aatami from the petrol station's sign, taking the gold and leaving him for dead, but Aatami hooks his wounds onto a protruding reinforcement bar, saving him from the noose but rendering him unconscious and still hanging from the rope. A pair of German pilots land in search of fuel and the wind from the plane loosens the petrol station's sign and cause Aatami to fall to the ground. The engineer in the plane notices Aatami is alive and the pilot orders him to kill Aatami and the dog. Aatami manages to kill the engineer and knocks the pilot unconscious. Unwilling to face the consequences of Germany's impending defeat, Bruno intends to use the gold to escape with Wolf and Schütze, arranging for a pilot to fly them to safety while the rest of the platoon makes their way to Norway. Meanwhile, Aatami forces the surviving pilot to fly him towards the platoon. Soon, the soldiers discover the airplane crashed in their path, with the pilot hanged by the same noose Wolf used on Aatami. As the convoy continues, Aatami climbs onto the truck holding the captured women, kills their guards, and arms the women. He and Aino commandeer one of the trucks, allowing him to leap onto Bruno's tank while the women gun down the rest of the soldiers in the other truck. Pulling Wolf out of the tank and beating him badly, Aatami leaves him at the mercy of the women and follows Bruno, who callously kills Schütze before taking off with the pilot. Aatami fires on the plane, mortally wounding the pilot, and uses his pickax to hack his way on-board in midair. After engaging in hand-to-hand combat, Bruno beats Aatami with a static line, subduing him. As Bruno is about to hit him again, Aatami swiftly hooks the static line to a bomb and releases the bomb through the bomb-bay door, dropping Bruno to his death. Finding the pilot also dead, Aatami straps himself in as the plane crashes into a large swamp. Led by Aino, the women deliver Wolf and the German tank to an incredulous Finnish unit. Remarkably still alive, Aatami crawls out of the swamp, reunites with his dog, and makes his way to war-ravaged Helsinki. Bloody and battered, Aatami enters a bank where he dumps his gold nuggets on the counter. The other customers are smartly dressed and look at him in wonderment. He finally speaks for the first time in the movie, asking the teller to exchange them for large bank notes, explaining they will not be as heavy to carry as the nuggets have been."
}