{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/fm6KqXpk3M2HVveHwCrBSSBaO0V.jpg",
  "id": 872585,
  "title": "Oppenheimer",
  "poster_path": "https://image.tmdb.org/t/p/w500/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
  "release_date": "2023-07-19",
  "vote_average": 8.116,
  "vote_count": 6324,
  "popularity": 624.868,
  "overview": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
  "imdb_id": "tt15398776",
  "budget": 100000000,
  "homepage": "http://www.oppenheimermovie.com",
  "revenue": 952000000,
  "runtime": 181,
  "genres": [
    "Drama",
    "History"
  ],
  "summaries": [
    "The story of American scientist J. Robert Oppenheimer and his role in the development of the atomic bomb.",
    "A dramatization of the life story of J. Robert Oppenheimer, the physicist who had a large hand in the development of the atomic bomb, thus helping end World War 2. We see his life from university days all the way to post-WW2, where his fame saw him embroiled in political machinations.—grantss",
    "J. Robert Oppenheimer, the creator of The Atomic Bomb, is put on trial for his supposed communist ties in the past, all while coming to terms with what it meant to change the history of the world for the sake of winning World War Two. This is the story of how America's Prometheus was cast out by The Gods for giving mankind an unthinkable gift: power unlike any other, the power to destroy the world; the power of Olympus.—Johnny-the-Film-Sentinel-2187"
  ],
  "synopsis": "In 1926, 22-year-old doctoral student J. Robert Oppenheimer (Cillian Murphy) grapples with anxiety and homesickness while studying under experimental physicist Patrick Blackett (James D'Arcy) at the Cavendish Laboratory in the University of Cambridge. Patrick did not think much of the American Oppenheimer and insulted him every step of the way.\nUpset with Blackett's attitude, Oppenheimer leaves him a poisoned apple but later retrieves it. Visiting scientist Niels Bohr (Kenneth Branagh) advises Oppenheimer to study theoretical physics at the University of Gottingen instead.Oppenheimer completes his PhD there and meets fellow scientist Isidor Isaac Rabi (David Krumholtz). They later meet theoretical physicist Werner Heisenberg (Matthias Schweighofer) in Switzerland.\nWanting to expand quantum physics research in the United States, Oppenheimer begins teaching at the University of California, Berkeley and the California Institute of Technology. He marries Katherine \"Kitty\" Puening (Emily Blunt), a biologist and ex-communist, and has an intermittent affair with Jean Tatlock (Florence Pugh), a troubled communist who later dies in an apparent suicide.\nIn this period of his life, Oppenheimer is shown to have leftist leaning tendencies and he frequently brings his political thoughts into his classrooms. He was also being investigated by the FBI, though this was unknown to him. He wants to unionize the professors on campus and this alienates many people who like him for his work.\nHe makes contributions through the Communist Party to the Spanish Civil far. Oppenheimer considered the Fascists to be a bigger threat compared to the Socialists, which was contrary to the popular thinking at the time. But he never joins the Communist Party formally.In December 1938, nuclear fission is discovered, which Oppenheimer realizes could be converted into a weapon. Oppenheimer was convinced that the atom could not be split, but when the experiment is replicated in the US and results shown to him, he understands the potential for a chain reaction in fission and that this could be used to make a bomb.\nIn 1939, Hitler invades Poland, and Oppenheimer gradually sheds his views on being neutral and wants to help defeat the Fascists.In 1942, during World War II, U.S. Army Colonel Leslie Groves (Matt Damon)\nrecruits Oppenheimer as director of the Manhattan Project to develop an atomic bomb.\nIn 1942 Oppenheimer, who is Hebrew, is mainly concerned that the German nuclear research program, led by Heisenberg, might yield a fission bomb for the Nazis. Their only hope is that Hitler considers Quantum Physics as a Hebrew science and hence might deny Heisenberg the resources needed to complete his work.\nOppenheimer asks Groves to build the lab at Los Alamos, to bring together the best scientific minds of the country.He assembles a team consisting of Rabi, Hans Bethe (Gustaf Skarsgard) and Edward Teller (Benny Safdie) at the Los Alamos Laboratory, and also collaborating with scientists Enrico Fermi (Danny Deferrari), Leo Szilard (Máté Haumann) and David L. Hill (Rami Malek) at the University of Chicago. Fermi, Szilard and Hill achieve the first self-sustaining nuclear fission reaction, also known as the Chicago-Pile.\nTeller's calculations reveal an atomic detonation could trigger a catastrophic chain reaction that would ignite the atmosphere and destroy the world. After consulting with Albert Einstein (Tom Conti), Oppenheimer concludes the chances are acceptably low. Teller attempts to leave the project after his proposal to construct a hydrogen bomb is rejected (since a small fission bomb is required to produce enough force to develop a fusion device), but Oppenheimer convinces him to stay. At the time the US was struggling to produce barely enough Uranium or Plutonium to even make one bomb.\nOppenheimer is approached by scientists who want him to use unofficial channels to collaborate on their research with the Russians, as the US Government is forbidding to do so. Oppenheimer refutes such attempts as treason but doesn't report such approaches to the FBI.Oppenheimer wanted scientists to know everything end-to-end during the Manhattan project, while Groves wanted compartmentalization of information for security reasons. Oppenheimer overrode Groves to have the cross-department meetings and his own security clearance took its own time to arrive.\nGroves was livid with Oppenheimer for not honoring the security protocols around Project Manhattan and for trying to treat it like a science project. He even met Jean Tatlock in 1943 while he was working on the project.Boris Pash (Casey Affleck) is the head of security for the Manhattan project and knew of Oppenheimer's communist leanings. Oppenheimer tells Groves that he lied to Pash with a story about someone from the Russian embassy approaching a person on the Manhattan project team. But Oppenheimer never shared a name with Pash.\nTo protect Oppenheimer, Groves had Pash transferred to London to keep an eye on the German bomb project.Following Adolf Hitler's death in 1945, some Project scientists question the bomb's relevance through the Szilárd petition; Oppenheimer believes it would end the ongoing Pacific War and save lives.\nThe Trinity test is successful (The test takes place at 5:30 am and produces a force of 18.6 KT when the expected yield was 3 KT. The US spent $2 Bn on the project to produce the first Atomic bomb), and President Harry S. Truman (Gary Oldman) orders the atomic bombings of Hiroshima and Nagasaki, inducing Japan's surrender. Oppenheimer wanted Truman to brief Stalin before using it in Japan, but Truman does no such thing. The Soviets are threatened, and Oppenheimer believes that this started the nuclear arms race.\nThough publicly praised, Oppenheimer is haunted by the mass destruction and fatalities. He later meets Truman, and after expressing his personal guilt, Truman berates Oppenheimer as he considers himself responsible for the decision to use the bomb. Oppenheimer urges restricting further nuclear weapons development, which Truman dismisses.Rear Admiral Lewis Strauss is a retired Naval officer and high-ranking member of the U.S. Atomic Energy Commission (AEC). Strauss had recruited Oppenheimer as a scientific advisor to the AEC, after the war was over.As an advisor to the United States Atomic Energy Commission (AEC), Oppenheimer's stance generates controversy, while Teller's hydrogen bomb receives renewed interest in the middle of the burgeoning Cold War. Oppenheimer says that a Hydrogen presented insurmountable technical difficulties and should not be pursued. He instead tries to convince the AEC to control the spread of nuclear weapons around the world.\nAEC Chairman Lewis Strauss (Robert Downey Jr.) resents Oppenheimer for having publicly humiliated him by dismissing his concerns about exporting radioisotopes (which helped other nations build the Atomic bomb) and for recommending negotiations with the Soviet Union after they successfully detonated their own bomb. Oppenheimer suggested that US and Soviets should offer concessions to each other not to pursue a Hydrogen bomb as if US builds one, Soviets will have no choice to build one as well.\nDespite Oppenheimer's objections, Truman green-lights the H-bomb program.\nStrauss believed that Oppenheimer collaborated with the Russians during the Manhattan project, and this is how they were able to produce a bomb in such a short period after the war.Strauss also believes that Oppenheimer denigrated him during a conversation Oppenheimer had with Einstein in 1947.In 1954, wanting to eliminate Oppenheimer's political influence, Strauss secretly orchestrates a private security hearing before a Personnel Security Board concerning Oppenheimer's Q clearance. However, it becomes clear that the hearing has a predetermined outcome.\nStrauss claims that he was the Chairman of the AEC, but the charges against Oppenheimer were brought by William L. Borden (David Dastmalchian), a lawyer and executive director of the JCAE who wrote to the FBI.\nStrauss claims that Borden was a rabid anti-Communist and had access to Oppenheimer's security file on which he based his claims. It is strongly indicated that Strauss provided Oppenheimer's security file to Borden and used Borden to bring Oppenheimer down.Oppenheimer's past communist ties are exploited, and Groves' and other associates' testimony is twisted against him.\nOppenheimer brought his brother to work on the Manhattan project, and he was a known Communist. This also goes against Oppenheimer.\nTeller testifies that he lacks confidence in Oppenheimer and recommends revocation. Groves supports Oppenheimer.\nThe entire review was done behind closed doors, as an administrative process, with no public hearing and no burden of proof on the prosecution. Roger Robb (Jason Clarke) served as special counsel to the AEC at Oppenheimer's security hearing and was appointed by Strauss. He had full access to Oppenheimer's file while Oppenheimer's attorney didn't have access to his client's file.\nThe board revokes Oppenheimer's Q clearance, damaging his public image and limiting his influence on nuclear policy.In 1959, during Strauss' Senate confirmation hearing for Secretary of Commerce, Hill testifies about Strauss' personal motives in engineering Oppenheimer's downfall, resulting in the Senate voting against his nomination.In 1963, President Lyndon B. Johnson (Hap Lawrence) presents Oppenheimer with the Enrico Fermi Award as a gesture of political rehabilitation.\nA flashback reveals Oppenheimer and Einstein's 1947 conversation never mentioned Strauss. Oppenheimer instead expressed his belief that they had indeed started a chain reaction-a nuclear arms race-that would one day destroy the world."
}