{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/csz3oWxd04wgXUzenXgenIVwXGl.jpg",
  "id": 930094,
  "title": "Red, White & Royal Blue",
  "poster_path": "https://image.tmdb.org/t/p/w500/uffOY4W354o9RTRmercFyVvl56Z.jpg",
  "release_date": "2023-07-27",
  "vote_average": 8.1,
  "vote_count": 1000,
  "popularity": 47.454,
  "overview": "After an altercation between Alex, the president's son, and Britain's Prince Henry at a royal event becomes tabloid fodder, their long-running feud now threatens to drive a wedge in U.S./British relations. When the rivals are forced into a staged truce, their icy relationship begins to thaw and the friction between them sparks something deeper than they ever expected.",
  "imdb_id": "tt10172266",
  "budget": 0,
  "homepage": "https://www.amazon.com/dp/B0BYST2QY1",
  "revenue": 0,
  "runtime": 121,
  "genres": [
    "Comedy",
    "Romance"
  ],
  "summaries": [
    "When the feud between the son of the American President and Britain's prince threatens to drive a wedge in U.S./British relations, the two are forced into a staged truce that sparks something deeper.",
    "Based on the novel of the same name, this story focuses on Alex Claremont-Diaz, the First Son of the president of the United States, and his rivalry with the young prince of England, Henry. After causing a major uproar at the prince's brother's wedding, the two are forced to avoid a national incident by playing up their non-existent friendship. Their rivalry soon turns into a forced friendship and then blossoms into something even more. The two try to keep their relationship a secret despite their highly public lives amid Alex's mother's re-election campaign as the first female President.—garthfan29",
    "An adaptation of Casey McQuiston's 2019 best-seller of the same name. It centers on a star-crossed power couple -- the Latino character of Alex Claremont-Diaz, the son of the president of the United States, and his relationship with Prince Henry, grandson of the King of England."
  ],
  "synopsis": "Alex Claremont-Diaz (Taylor Zakhar Perez), his mother, the first female president of the United States, Ellen Claremont (Uma Thurman) attend Prince Phillip's (Thomas Philip) royal wedding. There he meets the groom's brother Prince Henry (Nicholas Galitzine), whom he despises for his snobbish attitude, and in turn, Prince Henry despises Alex for being too animated and irritating. During the reception Alex gets drunk and the two get into a heated argument, after which the wedding cake falls onto them, causing a worldwide media attraction.With the elections on the line, Ellen asks Alex for damage control. She flies her son back to London so Alex and Henry can act like they've been friends their entire lives. During a school visit the pair get stuck in a supply room, it is revealed that Alex can't stand Henry since he perceived the latter as disrespectful. In turn, Henry apologizes and explains that he was going through tough times during his father's death, hence his behavior. Before leaving, Alex invites Prince Henry to his New Year's party, which he originally declines, but after bantering over social media he eventually attends.They hit off at said party, but later a visibly distressed Henry leaves after Alex kisses multiple girls at midnight. Alex then goes after him, where Henry expresses how there's nobody whom he can date. After his monologue he kisses Alex, who then realizes that they both have feelings for each other. Next month, during the President's Dinner they meet each other again, and eventually hook up. They then start a secret intercontinental relationship.After a journalist uncovers Alex's plans to flip Texas, Ellen has an argument with her son. She eventually sends him to Texas so as to carry out said plan. During a New York trip of the campaign, Alex and Henry meet and hook up again in a hotel room. The following morning the White House Deputy Chief of Staff, Zahra (Sarah Shahi) discovers their affair, which prompts Alex to come out to his mother.Thanks in partly to her encouragement, he invites Henry to Austin, where he tries to confess his feelings, but Henry - not wanting to break Alex's heart - gets away and flies back to London, to end the connection. An infuriated Alex then flies over, where he has the following proposition: either continue the affair, or end it for good. Henry then takes Alex to statue park over night and confesses; they eventually settle for the first option.Two days later, Henry finds out their private emails are leaked and is forced to suspend all communication with his partner. Alex delivers a speech on the matter, which motivates Zahra to use his connection with Henry's equerry to secure a phone call between the two. Alex then flies over to London, where the king calls for them; him and Phillip explain that their relationship contradicts with the values of the royal crown. However, they get the news protests in their support have broken out all over the UK, including in front of Buckingham palace, whom the couple greet by stepping out on the balcony together. A week later, it is revealed that, thanks to Alex's contributions, Texas was flipped, which confirms Ellen's re-election."
}