{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/5qsyqA7FeYRymBmNbPBqBgqWPO4.jpg",
  "id": 9340,
  "title": "The Goonies",
  "poster_path": "https://image.tmdb.org/t/p/w500/eBU7gCjTCj9n2LTxvCSIXXOvHkD.jpg",
  "release_date": "1985-06-07",
  "vote_average": 7.5,
  "vote_count": 5381,
  "popularity": 43.314,
  "overview": "A young teenager named Mikey Walsh finds an old treasure map in his father's attic. Hoping to save their homes from demolition, Mikey and his friends Data Wang, Chunk Cohen, and Mouth Devereaux run off on a big quest to find the secret stash of Pirate One-Eyed Willie.",
  "imdb_id": "tt0089218",
  "budget": 19000000,
  "homepage": "https://www.warnerbros.com/movies/goonies",
  "revenue": 61389680,
  "runtime": 114,
  "genres": [
    "Adventure",
    "Comedy",
    "Family"
  ],
  "summaries": [
    "A group of young misfits called The Goonies discover an ancient map and set out on an adventure to find a legendary pirate's long-lost treasure.",
    "Goon Docks, Oregon. To make way for a new golf course, the entire community of the peaceful coastal town faces imminent foreclosure. But the game isn't over until the fat lady sings. When a band of local childhood friends calling themselves the Goonies stumble upon an old map, secret clues leading to the fabled treasure of notorious pirate One-Eyed Willy set in motion a wild mission to save their homes. With the criminal Fratelli family hot on their trail, a frantic race against time begins. Faced with Willy's complex booby traps, will the Goonies prove their mettle? But first things first. Is the mythical treasure real?—Nick Riganas",
    "A ruthless crime family calling themselves the \"Fratellis\" have somehow escaped from jail and are now hiding in a town of Astoria, Oregon. Home of a secret kid society known as \"The Goonies\", their leader is Michael \"Mikey\" Walsh, and they are enjoying their last weekend together as a system of contractors have bought their neighborhood and are considering on transforming it into a golf course. However Mikey, stumbles upon a mysterious map to a treasure of a famed pirate \"One-Eyed\" Willie. So, The Goonies embark on an adventure to find the treasure and save their neighborhood. However, they also came across the Fratellis. So, The Goonies have to stay one step head of the Fratellis and find the treasure while avoiding a system of traps.—John Wiggins",
    "The Goonies are a group of friends living in a village, the groups leader Mikey Walsh, his older brother Brand and gang members Andy, Data, Stef, Mouth, and Chunk are being evicted from their homes which are to be demolished. Setting out to find a way of saving their homes, The Goonies find a treasure map and they set off in search for the treasure of the legendary pirate One-Eyed Willy. The Goonies embark on a great adventure through a underground maze filled with traps and skeletons, where they are pursued by Momma Fratelli and brothers Jake and Francis who are also after One-Eyed Willy's treasure and they are willing to get the treasure first.—Daniel Williamson"
  ],
  "synopsis": ""
}