{
  "backdrop_path": "https://image.tmdb.org/t/p/w500/7PBXKqTDCsSZb3GATn94DfXoAGx.jpg",
  "id": 98,
  "title": "Gladiator",
  "poster_path": "https://image.tmdb.org/t/p/w500/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
  "release_date": "2000-05-04",
  "vote_average": 8.213,
  "popularity": 73.824,
  "overview": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos.  Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor.  As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed.  He escapes, but is captured by slave traders.  Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences.",
  "imdb_id": "tt0172495",
  "budget": 103000000,
  "homepage": "",
  "revenue": 465361176,
  "runtime": 155,
  "genres": [
    "Action",
    "Drama",
    "Adventure"
  ],
  "summaries": [
    "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
    "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge.—Chris \"Morphy\" Terry",
    "Commodus takes power and strips rank from Maximus, one of the favored generals of his predecessor and father, Emperor Marcus Aurelius, the great stoical philosopher. Maximus is then relegated to fighting to the death in the gladiator arenas.—Jwelch5742",
    "In 180 A.D. Rome, the weary and dying emperor, Marcus Aurelius, names his loyal and triumphant general, Maximus Decimus Meridius, his successor and protector of Rome, much to the dismay of his haughty and unbalanced son, Commodus. But, instead, death and entrapment await, as the embittered and blind with rage rival rewards Rome's hero with an order for his execution, only to wind up as a slave to the former gladiator, Proximo. From the vast deserts of North Africa, a new Maximo will rise as a gladiator, hacking and slashing his way through all the way up to Mother Rome and the unsuspecting dictator, Commodus. But will the popular general ever find peace in a long-awaited retribution?—Nick Riganas",
    "In Gladiator, victorious general Maximus Decimus Meridias has been named keeper of Rome and its empire by dying emperor Marcus Aurelius, so that rule might pass from the Caesars back to the people and Senate. Marcus' neglected and power-hungry son, Commodus, has other ideas, however. Escaping an ordered execution, Maximus hurries back to his home in Spain, too late to save his wife and son from the same order. Taken into slavery and trained as a gladiator by Proximo, Maximus lives only that he might someday take his revenge and fulfill the dying wish of his emperor. The time soon comes when Proximo's troupe is called to Rome to participate in a marathon of gladiator games held at the behest of the new emperor, Commodus. Once in Rome, Maximus wastes no time in making his presence known, and is soon involved in a plot to overthrow the emperor with his former-love Lucilla, Commodus' sister, after whom he lusts, and also the widowed mother of Lucius, heir to the empire after his uncle, and democratic-minded senator, Gracchus.—ahmetkozan"
  ],
  "synopsis": "Shouting \"Roma Invicta!\" as his forces attack, General Maximus Decimus Meridius (Russell Crowe) leads the Roman Army to victory against Germanic barbarians in the year 180 A.D., ending a prolonged war and earning the esteem of elderly Emperor Marcus Aurelius. Although the dying Aurelius has a son, Commodus (Joaquin Phoenix), he decides to appoint temporary leadership to the morally-upstanding Maximus, with a desire to eventually return power to the Roman Senate. Aurelius informs Maximus and offers him time to consider before informing Commodus, who, in a bout of jealousy, murders his father.Declaring himself the emperor, Commodus asks Maximus for his loyalty, which Maximus, realizing Commodus' involvement in the Emperor's death, refuses. Commodus orders Maximus' execution and dispatches Praetorian Guards to murder Maximus' wife and son. Maximus narrowly escapes his execution and races home only to discover his family's charred and crucified bodies in the smoldering ruins of his villa. After burying his wife and son, a grieving Maximus succumbs to exhaustion and collapses on their graves.Slave traders find Maximus and take him to Zucchabar, a rugged province in North Africa, where he is purchased by Proximo, the head of a local gladiator school. Distraught and nihilistic over the death of his family and betrayal by his empire, Maximus initially refuses to fight, but as he defends himself in the arena his formidable combat skills lead to a rise in popularity with the audience. As he trains and fights further, Maximus befriends Hagen, a Germanic barbarian, and Juba, a Numidian hunter, the latter becoming a close friend and confidant to the grieving Maximus, the two speaking frequently of the afterlife and Maximus' eventual reunification with his family.In Rome, Commodus reopens the gladiatorial games to commemorate his father's death, and Proximo's company of gladiators are hired to participate. In a recreation of the Battle of Zama (incorrectly named the Battle of Carthage) at the Colosseum, Maximus leads Proximo's gladiators to decisive victory against a more powerful force, much to the amazement of the crowd. Commodus descends into the arena to meet the victors and is stunned to discover Maximus as the leader of Proximo's gladiators. The Emperor, unable to kill Maximus because of the crowd's roaring approval for him, sulks out of the arena.As the games continue, Commodus pits Maximus against Tigris of Gaul, Rome's only undefeated gladiator, in an arena surrounded by chained tigers with handlers instructed to target Maximus. Following an intense battle, Maximus narrowly defeats Tigris and awaits Commodus' decision to kill or spare Tigris. As Commodus votes for death, Maximus spares Tigris, deliberately insulting the Emperor and garnering the audience's approval. His bitter enemy now known as \"Maximus the Merciful,\" Commodus becomes more frustrated at his inability to kill Maximus or stop his ascending popularity while Commodus' own popularity shrinks.Following the fight, Maximus meets his former servant Cicero, who reveals that Maximus's army remains loyal to him. They are camped at the port Ostia. Maximus forms a plot with Lucilla, Commodus' sister, and Senator Gracchus to reunite Maximus with his army and overthrow Commodus. Commodus however, suspecting his sister's betrayal, threatens her young son and forces her to reveal the plot. Praetorian guards immediately storm Proximo's gladiator barracks, battling the gladiators while Maximus escapes. Hagen and Proximo are killed in the siege while Juba and the survivors are imprisoned. Maximus escapes to the city walls only to witness Cicero's death and be ambushed by a legion of Praetorian guards.Concluding that legends born in the Colosseum must die there, Commodus personally challenges Maximus to a duel in front of a roaring audience. Acknowledging that Maximus' skill exceeds his own, Commodus deliberately stabs Maximus with a stiletto, puncturing his lung, and has the wound concealed beneath the gladiator's armor. In the arena, the two exchange blows before Maximus rips the sword from Commodus's hands. Commodus requests a sword from his guards, but they betray him and refuse to lend him their weapons. Maximus drops his own sword, but Commodus pulls a hidden stiletto and renews his attack. Maximus then beats Commodus into submission and kills him with his own stiletto.As Commodus collapses in the now-silent Colosseum, a dying Maximus begins seeing his wife and son in the afterlife. He reaches for them but is pulled back to reality by the Praetorian prefect Quintus, who asks for instructions. Maximus orders the release of Proximo's gladiators and Senator Gracchus, whom he reinstates and instructs to return Rome to a Senate-based government.Maximus collapses, and Lucilla rushes to his aid. After being reassured that her son is safe and Commodus is dead, Maximus dies and wanders into the afterlife to his family in the distance. Senator Gracchus and Proximo's gladiators carry his body out of the Colosseum. That night, a newly freed Juba buries Maximus' two small statues of his wife and son in the Colosseum, and says that he too will eventually join them, but not yet."
}